{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"}":96,"~":97,"":98,"":99,"¡":100,"¢":101,"£":102,"¤":103,"¥":104,"¦":105,"§":106,"©":107,"«":108,"¬":109,"­":110,"®":111,"°":112,"±":113,"¶":114,"·":115,"»":116,"¿":117,"À":118,"Á":119,"Â":120,"Ã":121,"Ä":122,"Å":123,"Æ":124,"Ç":125,"È":126,"É":127,"Ê":128,"Ë":129,"Ì":130,"Í":131,"Î":132,"Ï":133,"Ð":134,"Ñ":135,"Ò":136,"Ó":137,"Ô":138,"Õ":139,"Ö":140,"×":141,"Ø":142,"Ù":143,"Ú":144,"Û":145,"Ü":146,"Ý":147,"Þ":148,"ß":149,"à":150,"á":151,"â":152,"ã":153,"ä":154,"å":155,"æ":156,"ç":157,"è":158,"é":159,"ê":160,"ë":161,"ì":162,"í":163,"î":164,"ï":165,"ð":166,"ñ":167,"ò":168,"ó":169,"ô":170,"õ":171,"ö":172,"÷":173,"ø":174,"ù":175,"ú":176,"û":177,"ü":178,"ý":179,"þ":180,"ÿ":181,"Ā":182,"ā":183,"ă":184,"ą":185,"ć":186,"Č":187,"č":188,"đ":189,"Ē":190,"ē":191,"Ė":192,"ė":193,"ę":194,"ě":195,"ğ":196,"ģ":197,"Ī":198,"ī":199,"į":200,"İ":201,"ı":202,"Ķ":203,"ķ":204,"ĸ":205,"ļ":206,"ľ":207,"Ł":208,"ł":209,"ń":210,"ņ":211,"ň":212,"ō":213,"ő":214,"œ":215,"Ř":216,"ř":217,"Ś":218,"ś":219,"Ş":220,"ş":221,"Š":222,"š":223,"ţ":224,"ť":225,"Ū":226,"ū":227,"ů":228,"ų":229,"ź":230,"Ż":231,"ż":232,"Ž":233,"ž":234,"ș":235,"ț":236,"ə":237,"́":238,"̄":239,"̆":240,"̈":241,"̊":242,"̧":243,"Α":244,"Β":245,"Γ":246,"Δ":247,"Ε":248,"Η":249,"Ι":250,"Κ":251,"Λ":252,"Μ":253,"Ν":254,"Ο":255,"Π":256,"Ρ":257,"Σ":258,"Τ":259,"Υ":260,"Φ":261,"Χ":262,"Ω":263,"ά":264,"έ":265,"ή":266,"ί":267,"α":268,"β":269,"γ":270,"δ":271,"ε":272,"ζ":273,"η":274,"θ":275,"ι":276,"κ":277,"λ":278,"μ":279,"ν":280,"ξ":281,"ο":282,"π":283,"ρ":284,"ς":285,"σ":286,"τ":287,"υ":288,"φ":289,"χ":290,"ω":291,"ϊ":292,"ό":293,"ύ":294,"ώ":295,"Ё":296,"Ђ":297,"Є":298,"Ѕ":299,"І":300,"Ї":301,"Ј":302,"Ў":303,"Џ":304,"А":305,"Б":306,"В":307,"Г":308,"Д":309,"Е":310,"Ж":311,"З":312,"И":313,"Й":314,"К":315,"Л":316,"М":317,"Н":318,"О":319,"П":320,"Р":321,"С":322,"Т":323,"У":324,"Ф":325,"Х":326,"Ц":327,"Ч":328,"Ш":329,"Щ":330,"Ъ":331,"Ы":332,"Ь":333,"Э":334,"Ю":335,"Я":336,"а":337,"б":338,"в":339,"г":340,"д":341,"е":342,"ж":343,"з":344,"и":345,"й":346,"к":347,"л":348,"м":349,"н":350,"о":351,"п":352,"р":353,"с":354,"т":355,"у":356,"ф":357,"х":358,"ц":359,"ч":360,"ш":361,"щ":362,"ъ":363,"ы":364,"ь":365,"э":366,"ю":367,"я":368,"ё":369,"є":370,"і":371,"ї":372,"ј":373,"ў":374,"ѣ":375,"ѳ":376,"Ґ":377,"ґ":378,"Ғ":379,"ғ":380,"Қ":381,"қ":382,"ң":383,"Ү":384,"ү":385,"Ұ":386,"ұ":387,"ҳ":388,"Ә":389,"ә":390,"Ө":391,"ө":392,"Ա":393,"Գ":394,"Դ":395,"Ե":396,"Կ":397,"Հ":398,"Մ":399,"Ն":400,"Ո":401,"Ս":402,"Վ":403,"Ր":404,"ա":405,"բ":406,"գ":407,"դ":408,"ե":409,"զ":410,"ը":411,"թ":412,"ի":413,"լ":414,"խ":415,"ծ":416,"կ":417,"հ":418,"ձ":419,"ղ":420,"մ":421,"յ":422,"ն":423,"շ":424,"ո":425,"պ":426,"ջ":427,"ռ":428,"ս":429,"վ":430,"տ":431,"ր":432,"ց":433,"ւ":434,"ք":435,"א":436,"ב":437,"ד":438,"ה":439,"ו":440,"ט":441,"י":442,"ל":443,"ם":444,"מ":445,"נ":446,"ס":447,"ע":448,"פ":449,"ק":450,"ר":451,"ש":452,"ת":453,"أ":454,"ا":455,"ب":456,"ة":457,"ت":458,"ج":459,"ح":460,"د":461,"ر":462,"س":463,"ش":464,"ص":465,"ع":466,"ف":467,"ق":468,"ك":469,"ل":470,"م":471,"ن":472,"ه":473,"و":474,"ي":475,"َ":476,"ُ":477,"ِ":478,"ّ":479,"ْ":480,"ی":481,"ं":482,"र":483,"ा":484,"ि":485,"्":486,"ං":487,"ක":488,"ග":489,"ට":490,"ඩ":491,"ත":492,"ද":493,"න":494,"ප":495,"බ":496,"ම":497,"ය":498,"ර":499,"ල":500,"ව":501,"ස":502,"හ":503,"ළ":504,"ා":505,"ැ":506,"ි":507,"ු":508,"ෙ":509,"ේ":510,"ො":511,"ก":512,"ค":513,"ง":514,"ต":515,"ท":516,"น":517,"บ":518,"ป":519,"ม":520,"ย":521,"ร":522,"อ":523,"ั":524,"า":525,"ิ":526,"เ":527,"ა":528,"ე":529,"ი":530,"‍":531,"‎":532,"‏":533,"‐":534,"‒":535,"–":536,"—":537,"―":538,"‘":539,"’":540,"‚":541,"“":542,"”":543,"„":544,"‟":545,"†":546,"•":547,"‪":548,"‬":549,"‭":550,"‰":551,"′":552,"‹":553,"›":554,"⁄":555,"€":556,"₴":557,"←":558,"↑":559,"→":560,"↓":561,"−":562,"∙":563,"√":564,"∞":565,"≈":566,"≤":567,"≥":568,"≪":569,"≫":570,"⋅":571,"⌘":572,"─":573,"│":574,"▁":575,"█":576,"▓":577,"■":578,"▪":579,"▬":580,"►":581,"▼":582,"◄":583,"●":584,"★":585,"♥":586,"♦":587,"✓":588,"✔":589,"❤":590,"❧":591,"➊":592,"➋":593,"➌":594,"➍":595,"➎":596,"➏":597,"➧":598,"『":599,"』":600,"い":601,"こ":602,"し":603,"す":604,"て":605,"と":606,"な":607,"に":608,"の":609,"れ":610,"を":611,"ん":612,"ア":613,"ィ":614,"イ":615,"カ":616,"ク":617,"グ":618,"シ":619,"ス":620,"タ":621,"ッ":622,"ト":623,"ド":624,"フ":625,"ブ":626,"ラ":627,"リ":628,"ル":629,"レ":630,"ロ":631,"ン":632,"・":633,"ー":634,"一":635,"三":636,"上":637,"下":638,"业":639,"东":640,"中":641,"主":642,"之":643,"亚":644,"亞":645,"亡":646,"产":647,"人":648,"什":649,"伊":650,"会":651,"体":652,"保":653,"信":654,"傲":655,"像":656,"先":657,"克":658,"公":659,"兹":660,"军":661,"击":662,"刀":663,"分":664,"利":665,"加":666,"动":667,"努":668,"匠":669,"卡":670,"卫":671,"及":672,"反":673,"发":674,"受":675,"可":676,"司":677,"合":678,"吼":679,"告":680,"咆":681,"和":682,"品":683,"哈":684,"哮":685,"嗜":686,"器":687,"国":688,"在":689,"地":690,"坤":691,"城":692,"堕":693,"塑":694,"塔":695,"墨":696,"墮":697,"士":698,"多":699,"大":700,"天":701,"失":702,"头":703,"女":704,"妃":705,"姆":706,"子":707,"孤":708,"学":709,"守":710,"客":711,"家":712,"寧":713,"寶":714,"封":715,"将":716,"將":717,"小":718,"尔":719,"岡":720,"工":721,"巨":722,"市":723,"师":724,"希":725,"帝":726,"年":727,"库":728,"应":729,"式":730,"引":731,"志":732,"忘":733,"恐":734,"惡":735,"意":736,"慍":737,"慢":738,"憎":739,"懼":740,"戈":741,"战":742,"户":743,"托":744,"护":745,"拉":746,"擊":747,"攻":748,"数":749,"文":750,"斯":751,"新":752,"无":753,"日":754,"普":755,"暗":756,"會":757,"有":758,"本":759,"机":760,"杰":761,"林":762,"柯":763,"格":764,"梅":765,"梭":766,"楚":767,"模":768,"機":769,"死":770,"泉":771,"洛":772,"海":773,"滅":774,"满":775,"滿":776,"潘":777,"灵":778,"热":779,"煞":780,"爾":781,"特":782,"狱":783,"獄":784,"獨":785,"王":786,"珀":787,"瑪":788,"生":789,"用":790,"电":791,"登":792,"的":793,"皇":794,"目":795,"相":796,"眼":797,"石":798,"破":799,"碎":800,"神":801,"稷":802,"穹":803,"納":804,"索":805,"縛":806,"纳":807,"缚":808,"罗":809,"羅":810,"翁":811,"翻":812,"翼":813,"老":814,"考":815,"者":816,"联":817,"聖":818,"艾":819,"苏":820,"英":821,"茲":822,"莫":823,"萊":824,"萨":825,"落":826,"葛":827,"蕾":828,"薩":829,"蝎":830,"螳":831,"血":832,"行":833,"衛":834,"表":835,"衫":836,"西":837,"語":838,"諾":839,"議":840,"诅":841,"译":842,"诺":843,"豐":844,"賈":845,"贡":846,"败":847,"赫":848,"軍":849,"达":850,"迦":851,"迪":852,"達":853,"遺":854,"邪":855,"里":856,"金":857,"釜":858,"鋒":859,"鋼":860,"鐵":861,"钢":862,"铁":863,"锋":864,"長":865,"隆":866,"雄":867,"雙":868,"雷":869,"靈":870,"領":871,"顱":872,"领":873,"風":874,"馬":875,"马":876,"魂":877,"魔":878,"鲁":879,"黑":880,"齊":881,"龍":882,"가":883,"갈":884,"강":885,"거":886,"결":887,"곤":888,"공":889,"괴":890,"교":891,"구":892,"국":893,"군":894,"굶":895,"그":896,"기":897,"나":898,"너":899,"노":900,"다":901,"대":902,"덴":903,"돈":904,"두":905,"둥":906,"들":907,"디":908,"라":909,"락":910,"람":911,"랙":912,"러":913,"레":914,"령":915,"로":916,"록":917,"론":918,"루":919,"르":920,"리":921,"린":922,"림":923,"만":924,"말":925,"메":926,"멜":927,"모":928,"무":929,"바":930,"박":931,"받":932,"블":933,"비":934,"빛":935,"사":936,"샤":937,"성":938,"션":939,"셴":940,"속":941,"수":942,"술":943,"쉬":944,"스":945,"시":946,"십":947,"쌍":948,"쓰":949,"아":950,"암":951,"에":952,"엘":953,"영":954,"왕":955,"용":956,"우":957,"울":958,"원":959,"위":960,"유":961,"은":962,"의":963,"이":964,"잊":965,"자":966,"잘":967,"장":968,"잿":969,"저":970,"전":971,"제":972,"주":973,"즈":974,"지":975,"진":976,"철":977,"코":978,"쿤":979,"퀀":980,"크":981,"클":982,"타":983,"토":984,"파":985,"판":986,"펑":987,"품":988,"퓨":989,"프":990,"피":991,"헬":992,"혀":993,"호":994,"혼":995,"황":996,"회":997,"흑":998,"":999,"":1000,"":1001,"":1002,"️":1003,"�":1004,"▁п":1005,"ст":1006,"▁в":1007,"▁с":1008,"ен":1009,"ра":1010,"ов":1011,"▁н":1012,"▁о":1013,"но":1014,"то":1015,"▁и":1016,"ко":1017,"ре":1018,"ро":1019,"го":1020,"ли":1021,"▁по":1022,"ни":1023,"ет":1024,"▁д":1025,"ль":1026,"▁на":1027,"ка":1028,"ри":1029,"ны":1030,"ла":1031,"▁м":1032,"те":1033,"за":1034,"на":1035,"ер":1036,"та":1037,"▁б":1038,"ени":1039,"да":1040,"ки":1041,"ле":1042,"ть":1043,"ва":1044,"▁ч":1045,"ло":1046,"▁у":1047,"ти":1048,"▁не":1049,"ся":1050,"ци":1051,"▁ко":1052,"▁за":1053,"ру":1054,"ми":1055,"во":1056,"ди":1057,"ста":1058,"ви":1059,"▁\"":1060,"ова":1061,"ем":1062,"▁про":1063,"▁ра":1064,"▁со":1065,"▁а":1066,"▁В":1067,"ля":1068,"сс":1069,"▁П":1070,"▁э":1071,"не":1072,"де":1073,"▁С":1074,"▁-":1075,"ма":1076,"сти":1077,"▁к":1078,"▁об":1079,"ско":1080,"▁от":1081,"▁что":1082,"▁до":1083,"по":1084,"мо":1085,"▁го":1086,"▁г":1087,"▁К":1088,"▁при":1089,"ры":1090,"ча":1091,"че":1092,"бо":1093,"ду":1094,"▁пре":1095,"▁во":1096,"▁М":1097,"ей":1098,"▁2":1099,"чи":1100,"сто":1101,"▁Р":1102,"ово":1103,"же":1104,"▁1":1105,"ски":1106,"▁Н":1107,"хо":1108,"▁вы":1109,"▁т":1110,"▁ре":1111,"ения":1112,"ных":1113,"▁е":1114,"ной":1115,"▁ка":1116,"тель":1117,"ве":1118,"па":1119,"▁то":1120,"лу":1121,"се":1122,"ку":1123,"до":1124,"ного":1125,"▁из":1126,"сь":1127,"га":1128,"ши":1129,"▁бы":1130,"ги":1131,"жи":1132,"ств":1133,"ме":1134,"ну":1135,"▁О":1136,"▁А":1137,"щи":1138,"▁мо":1139,"▁ф":1140,"▁это":1141,"сси":1142,"ан":1143,"об":1144,"ров":1145,"мен":1146,"зи":1147,"ют":1148,"ение":1149,"ные":1150,"▁(":1151,"ере":1152,"ный":1153,"ции":1154,"си":1155,"сть":1156,"▁те":1157,"▁та":1158,"му":1159,"ту":1160,"▁Д":1161,"▁Т":1162,"ня":1163,"пи":1164,"▁кото":1165,"он":1166,"▁И":1167,"ков":1168,"▁20":1169,"▁По":1170,"ты":1171,"ще":1172,"ше":1173,"ря":1174,"стра":1175,"▁под":1176,"▁бо":1177,"▁Б":1178,"м,":1179,"▁де":1180,"▁ме":1181,"ется":1182,"са":1183,"▁раз":1184,"ар":1185,"би":1186,"лю":1187,"▁Г":1188,"пе":1189,"нов":1190,"▁пред":1191,"жа":1192,"ния":1193,"лов":1194,"▁Ро":1195,"лен":1196,"\",":1197,"ор":1198,"▁з":1199,"▁ста":1200,"▁ма":1201,"рова":1202,"ке":1203,"уд":1204,"ской":1205,"тов":1206,"▁ми":1207,"це":1208,"▁для":1209,"ек":1210,"су":1211,"▁ин":1212,"каза":1213,"вы":1214,"▁все":1215,"ства":1216,"спо":1217,"ствен":1218,"сле":1219,"бы":1220,"▁пере":1221,"▁ли":1222,"гра":1223,"лет":1224,"▁я":1225,"▁сво":1226,"ского":1227,"ным":1228,"мы":1229,"▁На":1230,"жно":1231,"пу":1232,"▁Росси":1233,"про":1234,"▁ро":1235,"▁У":1236,"ды":1237,"ство":1238,"ак":1239,"ден":1240,"▁Е":1241,"▁са":1242,"ез":1243,"ща":1244,"▁которы":1245,"▁но":1246,"▁кон":1247,"вер":1248,"она":1249,"▁201":1250,"▁си":1251,"рав":1252,"▁как":1253,"аль":1254,"▁ру":1255,"ться":1256,"ние":1257,"ная":1258,"▁так":1259,"\".":1260,"▁ни":1261,"ск":1262,"ное":1263,"ба":1264,"бе":1265,"ном":1266,"▁Л":1267,"00":1268,"тив":1269,"лей":1270,"▁воз":1271,"кра":1272,"гу":1273,"зы":1274,"ска":1275,"со":1276,"нии":1277,"чен":1278,"▁ком":1279,"▁года":1280,"цен":1281,"ности":1282,"тся":1283,"▁хо":1284,"▁се":1285,"▁ве":1286,"▁пра":1287,"ур":1288,"фи":1289,"сту":1290,"▁его":1291,"лся":1292,"овы":1293,"ении":1294,"ша":1295,"ский":1296,"из":1297,"дер":1298,"жен":1299,"ских":1300,"▁сооб":1301,"▁Ф":1302,"▁3":1303,"рем":1304,"▁стра":1305,"лько":1306,"▁рабо":1307,"став":1308,"▁сто":1309,"▁«":1310,"▁су":1311,"ран":1312,"кс":1313,"ющи":1314,"ция":1315,"er":1316,"▁З":1317,"ходи":1318,"▁он":1319,"стро":1320,"▁России":1321,"▁дол":1322,"▁Э":1323,"▁буд":1324,"пре":1325,"мер":1326,"лись":1327,"жет":1328,"ха":1329,"in":1330,"ца":1331,"▁жи":1332,"стви":1333,"гда":1334,"ин":1335,"▁после":1336,"кой":1337,"зу":1338,"▁да":1339,"▁же":1340,"ную":1341,"л,":1342,"ность":1343,"тра":1344,"ети":1345,"ления":1346,"дни":1347,"лы":1348,"▁пер":1349,"▁будет":1350,"▁Мо":1351,"▁че":1352,"м.":1353,"ета":1354,"ят":1355,"нима":1356,"..":1357,"род":1358,"▁полу":1359,"▁ви":1360,"при":1361,"стави":1362,"▁ча":1363,"▁па":1364,"ев":1365,"on":1366,"ред":1367,"й,":1368,"рен":1369,"▁врем":1370,"▁Ч":1371,"сли":1372,"лось":1373,"стоя":1374,"▁боль":1375,"▁од":1376,"прав":1377,"▁фи":1378,"▁t":1379,"an":1380,"▁ш":1381,"▁ос":1382,"▁дру":1383,"жда":1384,"дин":1385,"яви":1386,"зна":1387,"▁сов":1388,"▁ва":1389,"ром":1390,"гла":1391,"ень":1392,"пер":1393,"ник":1394,"фор":1395,"▁ав":1396,"дар":1397,"вя":1398,"▁гла":1399,"▁лю":1400,"зова":1401,"▁Ко":1402,"вши":1403,"ву":1404,"кт":1405,"▁бу":1406,"ские":1407,"рии":1408,"en":1409,"ству":1410,"▁4":1411,"рга":1412,"▁расс":1413,"▁также":1414,"ению":1415,"вет":1416,"▁поли":1417,"▁Ка":1418,"▁уже":1419,"▁ди":1420,"ман":1421,"ются":1422,"руп":1423,"но,":1424,"▁5":1425,"▁0":1426,"тер":1427,"▁этом":1428,"ласти":1429,"лее":1430,"бли":1431,"▁слу":1432,"тор":1433,"ком":1434,"▁мы":1435,"▁году":1436,"ход":1437,"ему":1438,"▁уча":1439,"стре":1440,"▁ак":1441,"▁было":1442,"▁росси":1443,"▁время":1444,"▁обра":1445,"х,":1446,"е,":1447,"лова":1448,"том":1449,"ес":1450,"▁Во":1451,"▁орга":1452,"▁За":1453,"▁челов":1454,"▁руб":1455,"▁Х":1456,"зиден":1457,"цию":1458,"▁объ":1459,"коно":1460,"лась":1461,"▁пла":1462,"ными":1463,"▁был":1464,"▁или":1465,"▁чем":1466,"зыва":1467,"бу":1468,"▁без":1469,"he":1470,"▁цен":1471,"ника":1472,"or":1473,"дова":1474,"сы":1475,"▁пров":1476,"▁Я":1477,"▁их":1478,"пы":1479,"кон":1480,"теля":1481,"тиче":1482,"рово":1483,"го,":1484,"▁ты":1485,"20":1486,"жду":1487,"вро":1488,"цион":1489,"▁только":1490,"телей":1491,"гово":1492,"ге":1493,"вля":1494,"ений":1495,"сте":1496,"▁мл":1497,"▁чи":1498,"es":1499,"▁пар":1500,"▁которые":1501,"▁зна":1502,"дет":1503,"▁компа":1504,"циаль":1505,"кры":1506,"▁произ":1507,"ская":1508,"▁нача":1509,").":1510,"ть,":1511,"ar":1512,"сов":1513,"ление":1514,"▁Ма":1515,"▁может":1516,"▁Но":1517,"▁ус":1518,"рь":1519,"ней":1520,"ний":1521,"▁гра":1522,"рт":1523,"▁гово":1524,"▁чтобы":1525,"нее":1526,"рта":1527,"дут":1528,"▁тре":1529,"три":1530,"тия":1531,"▁россий":1532,"год":1533,"▁авто":1534,"▁A":1535,"▁му":1536,"цы":1537,"аз":1538,"),":1539,"жд":1540,"▁лет":1541,"▁еще":1542,"яб":1543,"▁Со":1544,"▁дан":1545,"станов":1546,"ском":1547,"▁6":1548,"▁пу":1549,"▁19":1550,"ене":1551,"тели":1552,"▁пи":1553,"тре":1554,"▁Ми":1555,"▁сле":1556,"▁спо":1557,"▁ле":1558,"▁S":1559,"▁200":1560,"шен":1561,"вать":1562,"at":1563,"▁более":1564,"▁само":1565,"▁При":1566,"судар":1567,"ников":1568,"al":1569,"▁T":1570,"ент":1571,"▁они":1572,"▁ку":1573,"▁х":1574,"▁P":1575,"ональ":1576,"▁которо":1577,"шения":1578,"▁рас":1579,"▁—":1580,"я,":1581,"пла":1582,"чита":1583,"**":1584,"т,":1585,"▁Ш":1586,"is":1587,"ью":1588,"▁испо":1589,"шение":1590,"▁слова":1591,"▁были":1592,"пол":1593,"▁10":1594,"▁заяви":1595,"кан":1596,"▁Укра":1597,"▁Как":1598,"▁который":1599,"зо":1600,"ли,":1601,"▁7":1602,"▁президен":1603,"▁органи":1604,"▁M":1605,"дом":1606,"али":1607,"ед":1608,"▁Але":1609,"ково":1610,"сла":1611,"ed":1612,"логи":1613,"▁свя":1614,"▁прави":1615,"▁реги":1616,"▁Моск":1617,"▁сообща":1618,"ением":1619,"х.":1620,"▁Ц":1621,"ут":1622,"от":1623,"▁свои":1624,"зда":1625,"▁эти":1626,"тин":1627,"лож":1628,"▁помо":1629,"▁Украи":1630,"льта":1631,"▁сказа":1632,"▁говори":1633,"▁Ра":1634,"тру":1635,"it":1636,"ки,":1637,"ет,":1638,"форма":1639,"нова":1640,"ску":1641,"▁Это":1642,"▁Го":1643,"чно":1644,"▁–":1645,"ми,":1646,"реди":1647,"оне":1648,"▁\"С":1649,"ступ":1650,"▁государ":1651,"▁Та":1652,"▁вопро":1653,"▁дей":1654,"▁Бо":1655,"пра":1656,"стве":1657,"▁есть":1658,"▁тер":1659,"▁спе":1660,"▁получи":1661,"▁им":1662,"ША":1663,"слу":1664,"мети":1665,"емы":1666,"▁сообщи":1667,"▁ее":1668,"клю":1669,"дела":1670,"▁между":1671,"лли":1672,"▁отно":1673,"▁Ки":1674,"▁того,":1675,"▁области":1676,"▁Са":1677,"й.":1678,"чень":1679,"тельно":1680,"ов,":1681,"кономи":1682,"▁вер":1683,"▁вз":1684,"st":1685,"▁США":1686,"ких":1687,"час":1688,"можно":1689,"▁Не":1690,"чет":1691,"▁I":1692,"годня":1693,"▁8":1694,"ю,":1695,"тора":1696,"▁работа":1697,"▁РФ":1698,"ou":1699,"▁пол":1700,"нист":1701,"бра":1702,"201":1703,"хи":1704,"лом":1705,"ейчас":1706,"рд":1707,"▁человек":1708,"яв":1709,"-то":1710,"бор":1711,"▁горо":1712,"вод":1713,"дера":1714,"▁коман":1715,"▁h":1716,"с.":1717,"пера":1718,"▁представи":1719,"▁кра":1720,"▁Ан":1721,"▁обо":1722,"трудни":1723,"ники":1724,"▁други":1725,"сты":1726,"▁когда":1727,"зульта":1728,":0":1729,"мента":1730,"▁Алекс":1731,"▁этого":1732,"ми.":1733,"▁пе":1734,"▁созда":1735,"▁результа":1736,"щен":1737,"яс":1738,"▁исто":1739,"▁будут":1740,"пас":1741,"лади":1742,"вест":1743,"тому":1744,"рон":1745,"▁Ва":1746,"▁если":1747,"▁иг":1748,"▁бан":1749,"▁ры":1750,"шего":1751,"ставля":1752,"льно":1753,"ября":1754,"кла":1755,"чения":1756,"льзова":1757,"▁счита":1758,"грам":1759,"▁ба":1760,"▁проек":1761,"▁Об":1762,"▁це":1763,"om":1764,"▁очень":1765,"...":1766,"▁информа":1767,"тельства":1768,"▁явля":1769,"▁дела":1770,"▁экс":1771,"нако":1772,"публи":1773,"ую":1774,"▁ки":1775,"▁ж":1776,"▁приня":1777,"строи":1778,"чение":1779,"цев":1780,"лага":1781,"▁оста":1782,"тери":1783,"нет":1784,"ствова":1785,"ов.":1786,"цу":1787,"▁\"Р":1788,"▁C":1789,"шей":1790,"▁день":1791,"кие":1792,"▁можно":1793,"▁том,":1794,"▁сред":1795,"гут":1796,"кого":1797,"дол":1798,"▁организа":1799,"овой":1800,"фе":1801,"▁тех":1802,"▁случа":1803,"н.":1804,"▁ст":1805,"держа":1806,"▁рай":1807,"re":1808,"▁9":1809,"▁разви":1810,"▁Влади":1811,"▁груп":1812,"н,":1813,"ряд":1814,"шо":1815,"▁сотрудни":1816,"▁дет":1817,"▁ад":1818,"▁была":1819,"▁где":1820,"▁чет":1821,"▁вс":1822,"▁год":1823,"▁Ни":1824,"ка,":1825,"на,":1826,"▁Си":1827,"▁w":1828,"дель":1829,"▁новы":1830,"бле":1831,"▁\"М":1832,"мери":1833,"рес":1834,"лови":1835,"▁быть":1836,"зва":1837,"рабо":1838,"▁Сер":1839,":1":1840,"вает":1841,"▁фина":1842,"▁ту":1843,"▁обще":1844,"нер":1845,"▁12":1846,"нес":1847,"▁15":1848,"▁суд":1849,"▁бе":1850,"ции,":1851,"▁прош":1852,"▁c":1853,"▁Евро":1854,"▁экономи":1855,"le":1856,"ремен":1857,"сков":1858,"торы":1859,"▁ну":1860,"емо":1861,"▁неско":1862,"вести":1863,"▁мат":1864,"▁отмети":1865,"▁сист":1866,"седа":1867,"▁поз":1868,"сса":1869,"тро":1870,"▁возможно":1871,"▁R":1872,"▁име":1873,"ложи":1874,"ru":1875,"е.":1876,"смо":1877,"ским":1878,"рек":1879,"▁ар":1880,"ках":1881,"нали":1882,"▁пока":1883,"дей":1884,"вой":1885,"нь":1886,"▁N":1887,"▁Ю":1888,"едера":1889,"вед":1890,"бира":1891,"▁встре":1892,"чь":1893,"▁Пу":1894,"▁Се":1895,"ших":1896,"анд":1897,"мни":1898,"ны,":1899,"рован":1900,"▁s":1901,"ent":1902,"кова":1903,"▁Он":1904,"▁она":1905,"туа":1906,"▁пов":1907,"▁Про":1908,"▁долж":1909,"▁руково":1910,"▁a":1911,"▁переда":1912,"мент":1913,"▁согла":1914,"▁Па":1915,"▁подо":1916,"нистра":1917,"шь":1918,"▁рублей":1919,"▁необ":1920,"л.":1921,"ит":1922,"ций":1923,"▁Владими":1924,"ющих":1925,"ic":1926,"▁жиз":1927,"▁нас":1928,"▁много":1929,"▁Так":1930,"▁глав":1931,"прия":1932,"▁Да":1933,"▁Ж":1934,"▁гражда":1935,"ки.":1936,"▁мар":1937,"▁ию":1938,"луч":1939,"щей":1940,"▁смо":1941,"▁прове":1942,"▁the":1943,"стран":1944,"ена":1945,"ровать":1946,"сно":1947,"рия":1948,"▁тыся":1949,"▁Те":1950,"ствия":1951,"бя":1952,"▁То":1953,"▁L":1954,"льного":1955,"▁B":1956,"тя":1957,"ному":1958,"жения":1959,"▁пло":1960,"▁компании":1961,"твер":1962,"▁програм":1963,"льный":1964,"к,":1965,"и,":1966,"коло":1967,"ется,":1968,"▁уда":1969,"▁чемпи":1970,"▁откры":1971,"▁\"П":1972,"народ":1973,"▁11":1974,"тельство":1975,"дели":1976,"писа":1977,"▁ду":1978,"▁F":1979,"▁\"В":1980,"▁даже":1981,"▁сдела":1982,"▁дву":1983,"чу":1984,"▁участ":1985,"бер":1986,"▁два":1987,"ья":1988,"рий":1989,"▁сторо":1990,"▁управ":1991,"▁один":1992,"-за":1993,"▁теле":1994,"▁Александ":1995,"лан":1996,"соб":1997,"▁сообщает":1998,"▁\"А":1999,"▁против":2000,"рук":2001,"▁Ин":2002,"▁сер":2003,"tt":2004,"▁пробле":2005,"рито":2006,"▁ситуа":2007,"йте":2008,"//":2009,"нию":2010,"▁Мы":2011,"ны.":2012,"лич":2013,"▁больше":2014,"▁право":2015,"▁ю":2016,"▁побе":2017,"ское":2018,"ем,":2019,"мет":2020,"▁Ви":2021,"▁необходи":2022,"▁Ба":2023,"ing":2024,"ющий":2025,"▁поч":2026,"стов":2027,"води":2028,"▁кор":2029,"▁воен":2030,"дов":2031,"▁Од":2032,"▁офи":2033,"▁G":2034,"ции.":2035,"▁сегодня":2036,"лле":2037,"▁оп":2038,"▁ново":2039,"рой":2040,"▁\"К":2041,"▁соб":2042,"ять":2043,"держ":2044,"▁Все":2045,"▁#":2046,"▁фор":2047,"▁млрд":2048,"▁состоя":2049,"▁До":2050,"▁них":2051,"▁могут":2052,":3":2053,"ла,":2054,"бур":2055,"щего":2056,"вали":2057,"▁коми":2058,"▁ско":2059,"меча":2060,"▁продол":2061,"сс-":2062,"▁террито":2063,"тен":2064,"мени":2065,"ерез":2066,"▁инте":2067,"▁нет":2068,"▁Вы":2069,"пута":2070,"▁каж":2071,"▁мен":2072,"▁сейчас":2073,"ледова":2074,"ка.":2075,"циональ":2076,"чер":2077,"▁призна":2078,"него":2079,"▁мест":2080,"▁млн":2081,"▁челове":2082,"рак":2083,"вший":2084,"▁вла":2085,"▁\"Н":2086,"▁Ку":2087,"хра":2088,"▁всех":2089,"рая":2090,"т.":2091,"▁первы":2092,"▁руб.":2093,"рти":2094,"жден":2095,"▁Ме":2096,"▁милли":2097,"ступи":2098,"ay":2099,"▁участи":2100,"ческой":2101,"казыва":2102,"жение":2103,"мерикан":2104,":2":2105,"ким":2106,"стей":2107,"as":2108,"моби":2109,"шел":2110,"▁этот":2111,"▁p":2112,"на.":2113,"▁несколько":2114,"▁уров":2115,"▁финан":2116,"нен":2117,"ответ":2118,"▁основ":2119,"зя":2120,"ющие":2121,"ot":2122,"но-":2123,"да,":2124,"имо":2125,"▁три":2126,"▁доро":2127,"нем":2128,"▁года.":2129,"▁является":2130,"-1":2131,"лаго":2132,"▁послед":2133,"▁тран":2134,"лия":2135,"▁комп":2136,"▁этой":2137,"▁самы":2138,"▁Из":2139,"стя":2140,"▁Бе":2141,"el":2142,"министра":2143,"личи":2144,"роме":2145,"щения":2146,"бова":2147,"▁тем":2148,"▁тра":2149,"▁f":2150,"▁находи":2151,"▁высо":2152,"▁около":2153,"▁прода":2154,"йти":2155,"▁жен":2156,"льной":2157,"ис":2158,"▁оче":2159,"стан":2160,"▁25":2161,"▁сем":2162,"льных":2163,"нитель":2164,"скую":2165,"▁кто":2166,"▁показа":2167,"▁место":2168,"▁опера":2169,"il":2170,"ете":2171,"ть.":2172,"▁18":2173,"▁тыс.":2174,"▁которая":2175,"ttp":2176,"▁От":2177,"://":2178,"лья":2179,"▁выбо":2180,"ждения":2181,"▁b":2182,"▁вос":2183,"▁ис":2184,"▁прово":2185,"ческих":2186,"▁Ар":2187,"▁14":2188,"▁оказа":2189,"▁строи":2190,"лены":2191,"▁Если":2192,"»,":2193,"▁сказал":2194,"-лет":2195,"▁га":2196,"гли":2197,"▁вто":2198,"нения":2199,"▁бли":2200,"к.":2201,"вают":2202,"рует":2203,"▁пресс-":2204,"юд":2205,"im":2206,"тии":2207,"▁рассказа":2208,"шении":2209,"туры":2210,"▁D":2211,"▁готов":2212,"▁свое":2213,"прави":2214,"опас":2215,"шин":2216,"▁извест":2217,"▁защи":2218,"▁эле":2219,"ности,":2220,"▁тор":2221,"▁Ли":2222,"▁тру":2223,"ttp://":2224,"▁автомоби":2225,":4":2226,"▁евро":2227,"▁W":2228,"▁\"Б":2229,"▁которых":2230,"▁доку":2231,"▁моло":2232,"▁следу":2233,"▁всего":2234,"▁рын":2235,"нут":2236,"раз":2237,"чество":2238,"гов":2239,"▁13":2240,"▁меся":2241,"рей":2242,"ева":2243,"утбо":2244,"та,":2245,"▁обла":2246,"кре":2247,"▁себя":2248,"яза":2249,"ro":2250,"▁установ":2251,"▁Ве":2252,"▁аг":2253,"фер":2254,"▁Ре":2255,"▁луч":2256,"▁произо":2257,"ion":2258,"готов":2259,"▁из-за":2260,"▁через":2261,"ноги":2262,"ступа":2263,"▁16":2264,"▁30":2265,"вра":2266,"дь":2267,"▁город":2268,"кий":2269,"зе":2270,"ясни":2271,"▁Ново":2272,"пита":2273,"and":2274,"▁газ":2275,"▁\"И":2276,"▁Пре":2277,"помни":2278,"▁фак":2279,"щее":2280,"▁Однако":2281,"▁сбор":2282,",5":2283,"ac":2284,"▁меня":2285,"ческого":2286,"▁2016":2287,"▁2014":2288,"▁уве":2289,"▁позво":2290,"▁перво":2291,"точ":2292,"вно":2293,"▁соответ":2294,"▁города":2295,"▁вой":2296,"▁тысяч":2297,"кру":2298,"▁том":2299,"ходя":2300,"мина":2301,"▁дома":2302,"▁После":2303,"▁заявил":2304,"▁использова":2305,"ют,":2306,"ты,":2307,"et":2308,"▁укра":2309,"вле":2310,"спе":2311,"▁над":2312,"▁кри":2313,"▁эта":2314,"▁круп":2315,"фон":2316,"▁свою":2317,"нению":2318,"of":2319,".ru":2320,"▁словам":2321,"».":2322,"▁совер":2323,"▁двух":2324,"▁просто":2325,"тр":2326,":5":2327,"▁стать":2328,"цией":2329,"▁17":2330,"дук":2331,"▁ква":2332,"▁хоро":2333,"▁эк":2334,"тов,":2335,"▁интер":2336,"лого":2337,"▁проце":2338,"▁дирек":2339,"am":2340,"▁власти":2341,"ly":2342,"ун":2343,"ностью":2344,"менно":2345,"▁би":2346,"▁законо":2347,"▁m":2348,"▁фа":2349,"▁\"Д":2350,"▁клу":2351,"▁ито":2352,"строй":2353,"▁американ":2354,"▁решение":2355,"▁пос":2356,"▁Гла":2357,"▁занима":2358,"неш":2359,"▁полити":2360,"▁направ":2361,"▁дви":2362,"ра,":2363,"▁сы":2364,"ственной":2365,"ow":2366,"▁г.":2367,"лении":2368,"бой":2369,"жида":2370,"етер":2371,"▁сни":2372,"анк":2373,"▁ан":2374,"ору":2375,"▁уго":2376,"чина":2377,"▁\"Т":2378,"▁официаль":2379,"▁депута":2380,"▁2013":2381,"▁ответ":2382,"▁Кон":2383,"▁безопас":2384,"▁чемпиона":2385,"еспе":2386,"▁обви":2387,"щение":2388,"ске":2389,"▁шко":2390,"▁нару":2391,"юджет":2392,"шли":2393,"▁прав":2394,"▁H":2395,"▁заяв":2396,"▁футбо":2397,"▁должны":2398,"▁E":2399,"▁услови":2400,"ния,":2401,"этому":2402,"ема":2403,"жива":2404,"▁Мин":2405,"и.":2406,"▁дея":2407,"▁обяза":2408,"но.":2409,"циа":2410,"▁международ":2411,"▁ему":2412,"▁n":2413,"▁биз":2414,"▁вме":2415,"преде":2416,"ото":2417,"ьер":2418,"▁площа":2419,"сова":2420,"▁ино":2421,"▁игра":2422,"▁Владимир":2423,"та.":2424,"▁2015":2425,"▁\"О":2426,"шие":2427,"▁то,":2428,"▁числе":2429,"▁перед":2430,"тие":2431,"▁ц":2432,"▁стал":2433,"▁(1":2434,"ur":2435,"чной":2436,"▁обеспе":2437,"▁своей":2438,"▁матери":2439,"СС":2440,"ров.":2441,"лено":2442,"гей":2443,"ww":2444,"кну":2445,"вших":2446,"лем":2447,"▁Кроме":2448,"кая":2449,"▁Россия":2450,"нием":2451,"лез":2452,"перь":2453,"▁разме":2454,"▁Сов":2455,"фф":2456,"служ":2457,"▁Де":2458,"▁виде":2459,"ков,":2460,"десь":2461,"▁/":2462,"▁сро":2463,"▁экспер":2464,"▁\"Г":2465,"▁минист":2466,"▁заклю":2467,"▁$":2468,"лена":2469,"ad":2470,"▁спи":2471,"ственного":2472,"▁предо":2473,"▁работы":2474,"пад":2475,"▁Пер":2476,"кое":2477,"онов":2478,"пло":2479,"кси":2480,"▁производ":2481,"тета":2482,"▁част":2483,"▁конку":2484,"▁администра":2485,"▁2012":2486,"▁него":2487,"▁on":2488,"нва":2489,"ками":2490,"▁жур":2491,"кти":2492,"▁друго":2493,"циали":2494,"ы,":2495,"▁связи":2496,"ра.":2497,"▁необходимо":2498,"▁бюджет":2499,"каб":2500,"▁действи":2501,"тий":2502,"ье":2503,"ходит":2504,"▁испол":2505,"тить":2506,"▁поги":2507,"▁Дми":2508,"нди":2509,"▁Москве":2510,"ag":2511,"лим":2512,"▁должно":2513,"▁дело":2514,"ol":2515,"▁помощ":2516,"▁чу":2517,"▁настоя":2518,"▁благо":2519,"▁The":2520,"▁элект":2521,"ли.":2522,"льные":2523,"виа":2524,"вая":2525,"▁Сергей":2526,"рио":2527,"▁каче":2528,"▁отмеча":2529,"тур":2530,"▁ци":2531,"▁муж":2532,"▁Россий":2533,"▁реши":2534,"▁Александр":2535,"▁21":2536,"▁Дмитри":2537,"рази":2538,"▁суще":2539,"▁Украины":2540,"▁украин":2541,"▁продук":2542,"▁результате":2543,"овых":2544,"шая":2545,"тай":2546,"▁22":2547,"грани":2548,"рита":2549,"вается":2550,"лин":2551,"▁неко":2552,"▁руководи":2553,"▁президент":2554,"▁очеред":2555,"▁деятель":2556,"▁янва":2557,"▁нужно":2558,"▁распо":2559,"чных":2560,"етербур":2561,"▁данным":2562,"ых":2563,"пусти":2564,"▁гу":2565,"▁+":2566,"▁http://":2567,"не,":2568,"▁режи":2569,"▁потре":2570,"▁жизни":2571,"у,":2572,"▁успе":2573,"щих":2574,"▁of":2575,"-2":2576,"▁которой":2577,"▁плани":2578,"▁граждан":2579,"над":2580,"▁многи":2581,"▁d":2582,"ков.":2583,"▁неф":2584,"зации":2585,"▁is":2586,"парта":2587,"▁колле":2588,"▁проис":2589,"пей":2590,"воз":2591,"▁неза":2592,"▁других":2593,"тки":2594,"вшего":2595,"ров,":2596,"▁сек":2597,"▁in":2598,"▁голо":2599,"▁глава":2600,"▁сент":2601,"ружи":2602,"▁ули":2603,"скому":2604,"▁,":2605,"струк":2606,"▁Что":2607,"▁ше":2608,"▁иск":2609,"тически":2610,"вые":2611,"ститу":2612,"▁Анд":2613,"▁страны":2614,"пример":2615,"▁Для":2616,"▁актив":2617,"▁лишь":2618,"ложен":2619,"ства.":2620,"▁закон":2621,"▁декаб":2622,"ший":2623,"▁состави":2624,"us":2625,"кта":2626,"щая":2627,"кам":2628,"хов":2629,"ства,":2630,"▁нау":2631,"ке,":2632,"▁ла":2633,"▁Ру":2634,"▁Ла":2635,"овые":2636,"▁to":2637,"дить":2638,"льзу":2639,"▁назва":2640,"▁уби":2641,"▁часть":2642,"▁своих":2643,"▁президента":2644,"лось,":2645,"▁контро":2646,"тов.":2647,"пози":2648,"▁креди":2649,"▁уголов":2650,"ственных":2651,"▁служ":2652,"▁территории":2653,"▁\"Л":2654,"▁продолжа":2655,"▁трен":2656,"лон":2657,"помним,":2658,"с,":2659,"▁зако":2660,"тет":2661,"ил":2662,"един":2663,"▁\"Ро":2664,"стри":2665,"▁образова":2666,"▁запре":2667,"еха":2668,"им":2669,"сут":2670,"▁социаль":2671,"ель":2672,"рах":2673,"▁доба":2674,"▁получа":2675,"▁J":2676,"▁Ста":2677,"евра":2678,"ом":2679,"ыре":2680,"▁догово":2681,"-201":2682,"▁поддерж":2683,"▁буду":2684,"▁связа":2685,"▁окт":2686,"▁преступ":2687,"▁23":2688,"▁федера":2689,"цей":2690,"▁женщи":2691,"лимпи":2692,"▁мене":2693,"дел":2694,"▁ша":2695,"▁нам":2696,"▁зем":2697,"▁которого":2698,"лог":2699,"▁Напомним,":2700,"▁пода":2701,"▁зада":2702,"??":2703,"мя":2704,"▁предпо":2705,"▁коли":2706,"рави":2707,"▁способ":2708,"▁значи":2709,"▁деся":2710,"▁детей":2711,"▁подготов":2712,"тем":2713,"ляр":2714,"▁сообщил":2715,"▁Москвы":2716,"▁вра":2717,"▁уг":2718,"▁Федера":2719,"тных":2720,"un":2721,"▁транспо":2722,"▁осу":2723,"▁реали":2724,"▁долла":2725,"не.":2726,"▁сум":2727,"▁куль":2728,"▁No":2729,"▁апре":2730,"щем":2731,"▁Га":2732,"сследова":2733,"работа":2734,"▁фон":2735,"▁обсу":2736,"чный":2737,"мести":2738,"виси":2739,"▁филь":2740,"▁уч":2741,"я.":2742,"▁24":2743,"▁след":2744,"ового":2745,"▁счет":2746,"рую":2747,"▁Ранее":2748,"кто":2749,"дви":2750,"id":2751,"еры":2752,"▁рам":2753,"рту":2754,"▁кли":2755,"вор":2756,"▁\"З":2757,"▁Пред":2758,"жу":2759,"▁насе":2760,"▁иностран":2761,"▁ри":2762,"ку,":2763,"ерт":2764,"рам":2765,"ter":2766,"ческие":2767,"ган":2768,"ния.":2769,"▁политиче":2770,"▁свобо":2771,"ке.":2772,"чные":2773,"▁люди":2774,"▁мину":2775,"▁объек":2776,"▁повы":2777,"шим":2778,"▁составля":2779,"▁преду":2780,"ствие":2781,"▁уни":2782,"▁вклю":2783,"▁меди":2784,"▁времени":2785,"▁предприя":2786,"▁выпол":2787,"бан":2788,".0":2789,"▁должен":2790,"▁говорит":2791,"▁агент":2792,"▁пози":2793,"фа":2794,"▁именно":2795,"▁Под":2796,"щий":2797,"смот":2798,"▁февра":2799,"▁тур":2800,"▁перио":2801,"д,":2802,"▁утвер":2803,"▁провед":2804,"▁маши":2805,"нение":2806,"ВД":2807,"пада":2808,"ницу":2809,"▁сез":2810,"той":2811,"▁**":2812,"ost":2813,"▁Лу":2814,"com":2815,"страда":2816,"пример,":2817,"▁2011":2818,"▁обы":2819,"▁называ":2820,"▁года,":2821,"ствует":2822,"ено":2823,"▁дости":2824,"▁требова":2825,":00":2826,"каз":2827,"чного":2828,"▁Ле":2829,"▁случае":2830,"дя":2831,"нологи":2832,"ew":2833,"йдет":2834,"▁четыре":2835,"▁\"Ъ":2836,"ch":2837,"▁участие":2838,"▁там":2839,"▁Мар":2840,"ропо":2841,"▁почти":2842,"▁завер":2843,"МИ":2844,"▁Фран":2845,"▁ходе":2846,"▁авиа":2847,"▁пресс-служ":2848,"▁пы":2849,"▁Кры":2850,"▁подчер":2851,"▁опреде":2852,"мыш":2853,"енно":2854,"▁госпо":2855,"▁специали":2856,"▁части":2857,"овый":2858,"чены":2859,"▁мет":2860,"▁стало":2861,"▁сра":2862,"еща":2863,"шем":2864,"чить":2865,"▁кла":2866,"▁ожида":2867,"сили":2868,"▁рамках":2869,"▁появи":2870,"▁измен":2871,"▁мне":2872,"▁здесь":2873,"▁передает":2874,"▁роди":2875,"▁даль":2876,"ю.":2877,"▁ОО":2878,"дно":2879,"▁тя":2880,"▁нор":2881,"ющей":2882,"нец":2883,"чки":2884,"▁100":2885,"▁развития":2886,"▁четвер":2887,"стер":2888,"▁Су":2889,"▁собствен":2890,"ды,":2891,"мой":2892,"▁рей":2893,"▁Они":2894,"доб":2895,"▁центра":2896,"▁мнению":2897,"ссии":2898,"▁нем":2899,"кола":2900,"▁журнали":2901,".1":2902,"ческий":2903,"▁Миха":2904,"неч":2905,"▁конце":2906,"щении":2907,"тирова":2908,"▁совет":2909,"▁компания":2910,"ьез":2911,"ваться":2912,"лению":2913,"▁образо":2914,"▁одной":2915,"▁однако":2916,"▁Ха":2917,"сло":2918,"▁безопасности":2919,"роб":2920,"гля":2921,"▁потому":2922,"▁and":2923,"▁подтвер":2924,"▁провер":2925,"▁некоторы":2926,"ферен":2927,"▁ло":2928,"▁внима":2929,"ница":2930,"▁момент":2931,"▁сам":2932,"▁источ":2933,"▁наза":2934,"▁свой":2935,"чего":2936,"ницы":2937,"▁вопрос":2938,"ep":2939,"ффек":2940,"них":2941,"▁Че":2942,"▁особ":2943,"▁суб":2944,"графи":2945,"енси":2946,"▁националь":2947,"тура":2948,"▁Также":2949,"▁материа":2950,"енера":2951,"▁поку":2952,"▁игро":2953,"▁дня":2954,"шее":2955,"ссе":2956,"▁места":2957,"▁ти":2958,"▁.":2959,"▁заня":2960,"тельных":2961,"▁лег":2962,"явля":2963,"▁председа":2964,"блю":2965,"▁прем":2966,"оло":2967,"тиво":2968,"▁мира":2969,"▁гру":2970,"▁назна":2971,"▁СМИ":2972,"▁причи":2973,"жай":2974,"тельной":2975,"▁рес":2976,"▁увер":2977,"▁отказа":2978,"▁кур":2979,"▁нео":2980,"em":2981,"▁отношении":2982,"берна":2983,"▁U":2984,"▁одного":2985,"г,":2986,"▁Путин":2987,"роприя":2988,"▁зда":2989,"шки":2990,"ды.":2991,"▁стан":2992,"▁докумен":2993,"▁такой":2994,"да.":2995,"▁этих":2996,"там":2997,"▁пример":2998,"▁50":2999,"жных":3000,"мышлен":3001,"▁заседа":3002,"▁Кра":3003,"▁бое":3004,"ИА":3005,"▁стали":3006,"▁условия":3007,"рев":3008,"ина":3009,"▁возможность":3010,"oo":3011,"▁словам,":3012,"▁пострада":3013,"нных":3014,"▁компле":3015,"▁наде":3016,"▁Дж":3017,"дой":3018,"зер":3019,"▁региона":3020,"▁стороны":3021,"▁реб":3022,"ным,":3023,"▁себе":3024,"▁республи":3025,"▁прекра":3026,"▁принима":3027,"▁ника":3028,"лета":3029,"читы":3030,"ющего":3031,"▁окру":3032,"▁Гос":3033,"▁парла":3034,"▁ха":3035,"ку.":3036,"вшие":3037,"▁ог":3038,"▁тем,":3039,"▁авгу":3040,"ством":3041,"▁исклю":3042,"▁V":3043,"сан":3044,"ig":3045,"%.":3046,"▁ранее":3047,"ir":3048,"▁предлага":3049,"г.":3050,"▁надо":3051,"▁большо":3052,"мов":3053,"▁заявил,":3054,"/201":3055,"чем":3056,"вен":3057,"▁Гер":3058,"▁ведом":3059,"▁финанс":3060,"▁(00":3061,"▁руковод":3062,"▁кру":3063,"▁правительства":3064,"вал":3065,"▁специаль":3066,"▁пя":3067,"▁Теле":3068,"игра":3069,"ты.":3070,"▁Новости":3071,"скими":3072,"▁Му":3073,"▁ря":3074,"▁привле":3075,"▁услу":3076,"▁тоже":3077,"▁K":3078,"тно":3079,"ится":3080,"▁Сейчас":3081,"▁времен":3082,"рева":3083,"▁кар":3084,"ct":3085,"ены":3086,"стана":3087,"▁российских":3088,"▁ограни":3089,"▁процен":3090,"матри":3091,"рин":3092,"▁энер":3093,"зов":3094,"▁обна":3095,"▁сокра":3096,"▁канди":3097,"▁26":3098,"▁кандида":3099,"рования":3100,"жной":3101,"▁th":3102,"▁исследова":3103,"▁стран":3104,"▁Хо":3105,"▁сре":3106,"▁мероприя":3107,"▁столи":3108,"▁рублей.":3109,"▁работу":3110,"▁прог":3111,"рори":3112,"▁своего":3113,"▁ги":3114,"▁всегда":3115,"▁Каза":3116,"▁Сегодня":3117,"▁января":3118,"ню":3119,"д.":3120,"▁Ком":3121,"▁28":3122,"▁деньги":3123,"▁контра":3124,"▁трех":3125,"▁среди":3126,"рот":3127,"▁матче":3128,"обра":3129,"▁сентября":3130,"▁первый":3131,"вид":3132,"▁27":3133,"▁управления":3134,"▁допол":3135,"ла.":3136,"шло":3137,"дина":3138,"▁профе":3139,"чка":3140,"конча":3141,"нской":3142,"▁O":3143,"▁борь":3144,"▁права":3145,"▁России.":3146,"пуска":3147,"ствовать":3148,"▁находится":3149,"▁тогда":3150,"р.":3151,"▁еди":3152,"▁вне":3153,"еть":3154,"s.":3155,"▁перегово":3156,"▁иде":3157,"▁пыта":3158,"▁доста":3159,"кса":3160,"▁серьез":3161,"нача":3162,"▁Президен":3163,"▁октября":3164,"ственный":3165,"▁русс":3166,"дра":3167,"▁****":3168,"ждение":3169,"▁прод":3170,"▁инвести":3171,"op":3172,"▁основа":3173,"ян":3174,"▁теперь":3175,"ТА":3176,"▁Дмитрий":3177,"еди":3178,"ющим":3179,"▁сборной":3180,"▁поня":3181,"▁Ав":3182,"работ":3183,"▁AM":3184,"e.":3185,"хва":3186,"▁предлож":3187,"доров":3188,"▁199":3189,"▁одно":3190,"▁региональ":3191,"ссо":3192,"▁бра":3193,"▁[":3194,"▁верну":3195,"▁средств":3196,"муще":3197,"▁фото":3198,"сом":3199,"▁това":3200,"кура":3201,"▁идет":3202,"мон":3203,"▁добави":3204,"▁собра":3205,"▁декабря":3206,"лит":3207,"видет":3208,"тельные":3209,"тар":3210,"iv":3211,"▁вот":3212,"верси":3213,"вое":3214,"/1":3215,"▁Бу":3216,"▁бес":3217,"▁пря":3218,"▁Ду":3219,"▁говорится":3220,"▁течение":3221,"боль":3222,"▁противо":3223,"▁июля":3224,"▁страна":3225,"лют":3226,"еспубли":3227,"▁ближай":3228,"▁ноября":3229,"шений":3230,"▁главы":3231,"ток":3232,"цени":3233,"▁увеличи":3234,"те,":3235,"▁ге":3236,"▁законода":3237,"ности.":3238,"50":3239,"▁группы":3240,"нные":3241,"ht":3242,"▁района":3243,"част":3244,"▁районе":3245,"принима":3246,"проек":3247,"▁системы":3248,"▁намер":3249,"▁Телефон":3250,"▁прибы":3251,"▁подчеркну":3252,"ить":3253,"няя":3254,"▁закры":3255,"▁лиц":3256,"дним":3257,"▁Между":3258,"пара":3259,"АО":3260,"шла":3261,"▁России,":3262,"вых":3263,"▁стоимо":3264,"ленных":3265,"езд":3266,"нского":3267,"▁рассказал":3268,"▁апреля":3269,"▁регу":3270,"-П":3271,"▁эффек":3272,"▁организации":3273,"▁которое":3274,"▁ради":3275,"лением":3276,"▁проводи":3277,"ко,":3278,"▁июня":3279,"вобо":3280,"щие":3281,"▁Республи":3282,"▁дене":3283,"▁технологи":3284,"кет":3285,"ссия":3286,"▁посе":3287,"мости":3288,"▁понима":3289,"▁язы":3290,"▁аэ":3291,"▁реко":3292,"▁другие":3293,"▁сти":3294,"тами":3295,"▁инф":3296,"▁удалось":3297,"▁шта":3298,"▁МВД":3299,"▁суде":3300,"▁ссы":3301,"хода":3302,"телем":3303,"слав":3304,"гам":3305,"▁погиб":3306,"▁задержа":3307,"▁дума":3308,"нить":3309,"▁хозя":3310,"тельного":3311,"рию":3312,"▁Вер":3313,"ссажи":3314,"ко.":3315,"▁оборо":3316,"▁мя":3317,"▁попа":3318,"▁кварти":3319,"▁Ев":3320,"▁ны":3321,"▁недо":3322,"▁поряд":3323,"ич":3324,"нечно,":3325,"▁(00:0":3326,"▁сло":3327,"▁две":3328,"▁людей":3329,"торов":3330,"▁Минист":3331,"ти,":3332,"▁2010":3333,"ь,":3334,"▁турни":3335,"▁вместе":3336,"▁аре":3337,"ствии":3338,"▁жела":3339,"▁эту":3340,"кую":3341,"ia":3342,"сколь":3343,"▁неде":3344,"▁Госду":3345,"▁спа":3346,"льная":3347,"вез":3348,"▁февраля":3349,"мест":3350,"▁подоз":3351,"▁собира":3352,"▁он.":3353,"▁мень":3354,"ма,":3355,"▁замести":3356,"▁народ":3357,"держи":3358,"публикова":3359,"▁#1":3360,"▁треть":3361,"▁публи":3362,"▁Сан":3363,"▁Никола":3364,"▁парт":3365,"пыт":3366,"ществ":3367,"▁смер":3368,"СК":3369,"▁пун":3370,"▁таких":3371,"▁действия":3372,"▁выступа":3373,"▁деле":3374,"прово":3375,"▁пор":3376,"▁решения":3377,"▁санк":3378,"▁сразу":3379,"▁бизнес":3380,"пании":3381,"рил":3382,"мена":3383,"▁оцен":3384,"▁отметил":3385,"▁Тур":3386,"▁верси":3387,"в,":3388,"тали":3389,"%,":3390,"▁постав":3391,"▁сай":3392,"▁подоб":3393,",2":3394,"▁котором":3395,"дж":3396,"▁поэтому":3397,"▁семь":3398,"шу":3399,"фика":3400,"▁тот":3401,"ло,":3402,"▁PM":3403,"жении":3404,"рить":3405,"шую":3406,"▁Пет":3407,"▁40":3408,"▁Глав":3409,"рения":3410,"шед":3411,"нин":3412,"▁Герма":3413,"▁премьер":3414,"▁человек.":3415,"▁лидер":3416,"ений,":3417,"▁работ":3418,"▁ху":3419,"▁2009":3420,"пере":3421,"тельный":3422,"му,":3423,"фо":3424,"обре":3425,"▁собы":3426,"или":3427,"▁изда":3428,"▁гос":3429,"▁Ива":3430,"дый":3431,"30":3432,"▁ответствен":3433,"▁пользова":3434,"ние,":3435,"▁обрати":3436,"▁Бы":3437,"хран":3438,"▁праз":3439,"▁оппози":3440,"▁губерна":3441,"▁уче":3442,"ы.":3443,"▁всем":3444,"▁менее":3445,"ове":3446,"▁техни":3447,"▁спорт":3448,"обще":3449,"▁конкур":3450,"▁тяже":3451,"▁имеет":3452,"ut":3453,"тон":3454,"▁качестве":3455,"жде":3456,"стоян":3457,"бро":3458,"чера":3459,"▁(2":3460,"▁новых":3461,"▁конф":3462,"ber":3463,"▁количество":3464,"▁нашей":3465,"▁l":3466,"▁производи":3467,"▁террори":3468,"▁ини":3469,"са,":3470,"▁чинов":3471,"▁году.":3472,"▁интерес":3473,"ат":3474,"▁29":3475,"▁современ":3476,"▁начала":3477,"▁находя":3478,"▁угро":3479,"▁представитель":3480,"ябре":3481,"▁чего":3482,"▁интере":3483,"▁срав":3484,"▁разре":3485,"боро":3486,"▁человека":3487,"▁говоря":3488,"▁Ал":3489,"▁человек,":3490,"▁партии":3491,"um":3492,"ходят":3493,"ed:":3494,"ктор":3495,"▁ЕС":3496,"тера":3497,"ation":3498,"▁капита":3499,"▁возду":3500,"чат":3501,"скольку":3502,"ляет":3503,"▁музы":3504,"▁этим":3505,"▁»":3506,"▁Его":3507,"в.":3508,"▁пенси":3509,"пли":3510,"▁соста":3511,"▁\"У":3512,"▁пассажи":3513,"номо":3514,"ые":3515,"▁води":3516,"▁наблю":3517,"фици":3518,"кро":3519,"льным":3520,"▁стре":3521,"шет":3522,"дии":3523,"▁тури":3524,"▁состав":3525,"▁нового":3526,"-го":3527,"стой":3528,"емых":3529,"▁Сирии":3530,"▁сделать":3531,"руют":3532,"▁стала":3533,"▁Мак":3534,"рю":3535,"ul":3536,"гру":3537,"▁того":3538,"▁программы":3539,"▁совершен":3540,"▁анти":3541,"▁москов":3542,"▁внут":3543,"▁спор":3544,"▁медици":3545,"ну,":3546,"руется":3547,"▁Когда":3548,"▁ничего":3549,"▁сайте":3550,"est":3551,"▁возра":3552,"▁Пути":3553,"▁подписа":3554,"ровали":3555,"фак":3556,"▁хотя":3557,"жать":3558,"▁Вели":3559,"▁различ":3560,"форми":3561,"▁\"Е":3562,"ента":3563,"▁РИА":3564,"▁европей":3565,"▁проект":3566,"жного":3567,"того":3568,"овая":3569,"ры,":3570,"▁считает":3571,"▁месте":3572,"▁предложи":3573,"▁отметил,":3574,"ver":3575,"▁убий":3576,"чей":3577,"точно":3578,"щит":3579,"▁информации":3580,"▁своем":3581,"▁директор":3582,"▁городе":3583,"-0":3584,"▁помощи":3585,"нок":3586,"▁фун":3587,"▁реаль":3588,"льное":3589,"са.":3590,",3":3591,"▁анали":3592,"▁такие":3593,",6":3594,"▁марта":3595,"▁сообщили":3596,"▁матча":3597,"▁большин":3598,"▁ши":3599,"ap":3600,"веден":3601,"чил":3602,"▁выда":3603,".com":3604,"вари":3605,"▁мая":3606,"вую":3607,"▁2008":3608,"телям":3609,"▁получил":3610,"▁рассмо":3611,"▁непо":3612,"▁акти":3613,"▁конфли":3614,"▁последние":3615,"▁скоро":3616,"нал":3617,"▁генера":3618,"▁масс":3619,"/0":3620,"щую":3621,"▁российского":3622,"▁стоит":3623,"▁представля":3624,"лимпий":3625,"▁примен":3626,"▁избира":3627,"▁августа":3628,"▁ссыл":3629,",4":3630,"зии":3631,"▁указа":3632,"▁каса":3633,"▁наи":3634,"▁второй":3635,"▁мире":3636,",7":3637,"▁жа":3638,"▁диа":3639,"пыта":3640,"▁проте":3641,"▁хи":3642,"▁представ":3643,"▁поясни":3644,"▁оружи":3645,"▁род":3646,"▁член":3647,"▁жизнь":3648,"ленные":3649,"▁проблемы":3650,"▁лет.":3651,"нять":3652,"▁должна":3653,"▁правительство":3654,"▁пять":3655,"▁новый":3656,"▁процесс":3657,"▁по-":3658,"мии":3659,"▁Post":3660,"▁Алексей":3661,"▁прин":3662,"▁отра":3663,"▁нынеш":3664,"▁Андрей":3665,"▁пово":3666,"нами":3667,"нский":3668,"▁распро":3669,"▁\"Ъ\"":3670,"▁частности,":3671,"▁оцени":3672,"▁возвра":3673,"▁2017":3674,"__":3675,"ква":3676,"емон":3677,"▁опас":3678,"еме":3679,"▁тренер":3680,"▁внутрен":3681,"▁взры":3682,"ваются":3683,"▁мэ":3684,"▁Ди":3685,"▁31":3686,"▁стол":3687,"▁Москов":3688,"▁расследова":3689,"▁начале":3690,"ести":3691,"▁настоящее":3692,"▁которую":3693,"▁аэропо":3694,"▁теа":3695,"лой":3696,"os":3697,"ственные":3698,"▁мужчи":3699,"тый":3700,"▁новые":3701,"▁потом":3702,"сить":3703,"нуть":3704,"▁Европы":3705,"кви":3706,"рко":3707,".201":3708,"▁In":3709,"извест":3710,"▁одна":3711,",8":3712,"това":3713,"чета":3714,"тной":3715,"▁Сле":3716,"▁\"Ин":3717,"▁государства":3718,"▁отношения":3719,"дил":3720,"ведения":3721,"це-":3722,"▁бло":3723,"▁истории":3724,"▁дел":3725,"▁ней":3726,"▁уверен":3727,"▁выпла":3728,"▁дополнитель":3729,"▁информацию":3730,"ма.":3731,"били":3732,"-летний":3733,",1":3734,"▁и,":3735,"▁\"Ф":3736,"рос":3737,"▁сохра":3738,"▁професси":3739,"рудова":3740,"▁Иго":3741,"▁получить":3742,"ТО":3743,"▁возбу":3744,"▁полицей":3745,"ться,":3746,"вый":3747,"▁инициа":3748,"▁Президент":3749,"▁предпринима":3750,"▁требу":3751,"▁Она":3752,"eb":3753,"▁отде":3754,"юз":3755,"▁миллионов":3756,"▁конц":3757,"▁выс":3758,"▁назад":3759,"▁хорошо":3760,"▁иску":3761,"▁Поэтому":3762,"▁станет":3763,"ex":3764,"▁Ту":3765,"ципа":3766,"▁тради":3767,"▁став":3768,"ду,":3769,"▁взя":3770,"▁попу":3771,"▁начина":3772,"▁уточ":3773,"▁Кар":3774,"▁проекта":3775,"юза":3776,"▁комитета":3777,"▁струк":3778,"охра":3779,"▁написа":3780,"чества":3781,"▁прак":3782,"жные":3783,"▁чемпионата":3784,"они":3785,"▁Согла":3786,"▁команды":3787,"ясня":3788,"▁стро":3789,"▁Цен":3790,"ственно":3791,"▁пожа":3792,"▁tim":3793,"▁мир":3794,"▁Евг":3795,"нев":3796,"▁самых":3797,"▁стране":3798,"траф":3799,"▁включа":3800,"▁поме":3801,"▁трав":3802,"шению":3803,"▁осуществ":3804,"нице":3805,"▁сла":3806,"▁приобре":3807,"oc":3808,"▁весь":3809,"▁гор":3810,"▁бизне":3811,"▁Сто":3812,"▁поскольку":3813,"лений":3814,"▁кни":3815,"бов":3816,"av":3817,"ей,":3818,"дили":3819,"▁Серге":3820,"телей,":3821,"▁опубликова":3822,"▁писа":3823,"тых":3824,"▁соответству":3825,"▁видео":3826,"°C":3827,"сем":3828,"лых":3829,"лору":3830,"чески":3831,"▁вопросы":3832,"рование":3833,"ссий":3834,"м\"":3835,"стью":3836,"▁состо":3837,"▁возмо":3838,"чис":3839,"лер":3840,"▁использу":3841,"▁харак":3842,"▁неда":3843,"▁обу":3844,"▁часов":3845,"000":3846,"▁многие":3847,"▁(в":3848,"рами":3849,"▁Боль":3850,"▁кризи":3851,"▁интернет":3852,"водит":3853,"ну.":3854,"риан":3855,"с\"":3856,"age":3857,"▁содержа":3858,"▁прошлого":3859,"ль,":3860,"▁норма":3861,"▁площад":3862,"ное,":3863,"▁люде":3864,"ция,":3865,"▁законопроек":3866,"▁совмест":3867,"▁\"На":3868,"▁кино":3869,"▁дней":3870,"▁вопроса":3871,"▁Лю":3872,"▁мини":3873,"▁средства":3874,"▁вза":3875,"▁\"Э":3876,"▁тр":3877,"мар":3878,"▁Тем":3879,"телями":3880,"▁Би":3881,"спек":3882,"▁полностью":3883,"▁лучше":3884,"веро":3885,"степ":3886,"▁СК":3887,"шта":3888,"рое":3889,"дется":3890,"▁прогно":3891,"чем,":3892,"▁населения":3893,"▁сцен":3894,"ИД":3895,"www":3896,"собо":3897,"/2":3898,"▁истори":3899,"▁наши":3900,"▁началь":3901,"нии,":3902,"▁здоров":3903,"▁сами":3904,"тирует":3905,"кар":3906,"▁нов":3907,"▁постоян":3908,"▁объяви":3909,"те.":3910,"▁вас":3911,"ционных":3912,"что":3913,"▁этому":3914,"▁воору":3915,"ческая":3916,"у.":3917,"▁другой":3918,"▁живо":3919,"▁расши":3920,"▁составляет":3921,"сер":3922,"▁тон":3923,"▁пят":3924,"гази":3925,"▁получили":3926,"чении":3927,"▁выра":3928,"\":":3929,"вока":3930,"▁ска":3931,"▁например,":3932,"▁внеш":3933,"тные":3934,"сил":3935,"их":3936,"дний":3937,"ум":3938,"▁утвержда":3939,"лева":3940,"-ли":3941,"чено":3942,"▁доступ":3943,"вшей":3944,"доро":3945,"▁ребен":3946,"ниц":3947,"▁мирово":3948,"ксе":3949,"▁юри":3950,"талья":3951,"▁иностранных":3952,"▁рассказыва":3953,"ген":3954,"жный":3955,"раи":3956,"ться.":3957,"рина":3958,"▁g":3959,"вестия":3960,"▁эффектив":3961,"тельным":3962,"▁подпи":3963,"▁забо":3964,"az":3965,"▁работать":3966,"▁чита":3967,"▁Раз":3968,"▁:":3969,"льном":3970,"▁Ша":3971,"спон":3972,"поли":3973,"▁вам":3974,"▁пара":3975,"лять":3976,"надле":3977,"▁измени":3978,"тья":3979,"вел":3980,"терфак":3981,"▁Воз":3982,"▁пост":3983,"кин":3984,"▁дово":3985,"ess":3986,"▁российской":3987,"▁нико":3988,"▁Ос":3989,"oun":3990,"шать":3991,"▁неу":3992,"▁клуба":3993,"▁итогам":3994,"▁период":3995,"▁оборудова":3996,"▁сыгра":3997,"▁ава":3998,"▁праздни":3999,"диви":4000,"▁re":4001,"▁чув":4002,"▁ал":4003,"реги":4004,"▁ведь":4005,"спонден":4006,"мом":4007,"▁ним":4008,"теги":4009,"льщи":4010,"▁ссылкой":4011,"▁вообще":4012,"ровал":4013,"▁бро":4014,"мые":4015,"e,":4016,"▁Пере":4017,"▁заво":4018,"ec":4019,"▁убе":4020,"▁прошлом":4021,"ым":4022,"▁Ана":4023,"сур":4024,"даря":4025,"▁центре":4026,"▁Мед":4027,"▁фран":4028,"рее":4029,"ников,":4030,"ник,":4031,"тече":4032,"▁арен":4033,"▁встреча":4034,"лев":4035,"▁мог":4036,"вого":4037,"тах":4038,"вети":4039,"град":4040,"ционной":4041,"10":4042,"▁May":4043,"▁теку":4044,"клад":4045,"защит":4046,"▁миллиар":4047,"▁принадле":4048,"▁наблюда":4049,"▁искус":4050,"▁каждый":4051,"смен":4052,"▁году,":4053,"▁правоохра":4054,"вли":4055,"▁превы":4056,"▁кре":4057,"▁рез":4058,"нах":4059,"ставить":4060,"сия":4061,"держан":4062,"▁60":4063,"тный":4064,"▁Кита":4065,"-й":4066,"▁службы":4067,"▁люби":4068,"▁цель":4069,"▁фай":4070,"▁месяцев":4071,"▁какой":4072,",9":4073,"all":4074,"▁торгов":4075,"ле,":4076,"▁деятельности":4077,"▁долго":4078,"▁внимание":4079,"ев,":4080,"сро":4081,"▁ген":4082,"▁своим":4083,"вета":4084,"тарь":4085,"лый":4086,"▁учре":4087,"▁выступи":4088,"▁Оле":4089,"первые":4090,"▁экспо":4091,"баты":4092,"▁самолет":4093,"▁транспорт":4094,"▁Восто":4095,"▁движения":4096,"▁Глава":4097,"▁банков":4098,"нный":4099,"▁Казах":4100,"▁\"По":4101,"га,":4102,"▁представители":4103,"ей.":4104,"▁поте":4105,"дит":4106,"▁отправи":4107,"www.":4108,"▁относи":4109,"-Петербур":4110,"▁годы":4111,"▁мощ":4112,"▁помощью":4113,"▁попро":4114,"▁обвиня":4115,"ort":4116,"▁Пи":4117,"ниципа":4118,"сок":4119,"▁ситуации":4120,"сь,":4121,"дово":4122,"АСС":4123,"гре":4124,"▁Ри":4125,"▁дере":4126,"▁полож":4127,"▁освобо":4128,"ва,":4129,"вью":4130,"▁Еще":4131,"более":4132,"▁промышлен":4133,"▁пои":4134,"стров":4135,"ствуют":4136,"▁вице-":4137,"▁чер":4138,"▁меньше":4139,"тря":4140,"▁система":4141,"▁свидет":4142,"ет.":4143,"жит":4144,"кт-Петербур":4145,"▁\"Газ":4146,"▁бере":4147,"▁дав":4148,"тивных":4149,"▁X":4150,"▁встречи":4151,"▁област":4152,"пания":4153,"▁которым":4154,"бин":4155,"▁произошло":4156,"▁наших":4157,"▁пригово":4158,"▁возможности":4159,"▁практически":4160,"▁кры":4161,"▁станов":4162,"▁ряд":4163,"▁един":4164,"▁спец":4165,"▁Министер":4166,"▁пись":4167,"▁одним":4168,"▁голов":4169,"ется.":4170,"▁данные":4171,"▁пора":4172,"▁отсут":4173,"пуск":4174,"a.ru":4175,"▁всей":4176,"▁предполага":4177,"▁расположен":4178,"телей.":4179,"ником":4180,"our":4181,"▁Поли":4182,"жем":4183,"▁ООН":4184,"▁участников":4185,"▁ситуация":4186,"▁пяти":4187,"ятся":4188,"чная":4189,"треть":4190,"ле.":4191,"кану":4192,"жды":4193,"▁Гу":4194,"▁несколь":4195,"дия":4196,"▁нет.":4197,"▁пам":4198,"▁Чер":4199,"▁восстанов":4200,"ющая":4201,"▁влия":4202,"ной,":4203,"пора":4204,"ел":4205,"рец":4206,"▁\"Я":4207,"ций,":4208,"▁неме":4209,"тят":4210,"▁рост":4211,"▁рейтин":4212,"ка\"":4213,"▁зам":4214,"▁оконча":4215,"▁финанси":4216,"прочем,":4217,"▁сель":4218,"город":4219,"лки":4220,"веча":4221,"▁прокура":4222,"▁хозяй":4223,"тию":4224,"▁(\"":4225,"▁организова":4226,"▁посети":4227,"▁никто":4228,"▁шо":4229,"▁зависи":4230,"▁вариан":4231,"р,":4232,"терес":4233,"тили":4234,"if":4235,"▁учи":4236,"▁либо":4237,"▁администрации":4238,"пря":4239,"▁It":4240,"▁близ":4241,"▁Центра":4242,"▁отда":4243,"▁Совет":4244,"ционного":4245,"▁затем":4246,"-ми":4247,"▁приводит":4248,"дума":4249,"▁физи":4250,"▁сложно":4251,"▁выстав":4252,"фере":4253,"▁часто":4254,"▁край":4255,"▁полови":4256,"▁уровень":4257,"▁поне":4258,"▁on:":4259,"▁суда":4260,"естива":4261,"▁арест":4262,"пов":4263,"сен":4264,"ность,":4265,"▁объем":4266,"▁дер":4267,"▁самом":4268,"ологи":4269,"▁похо":4270,"лово":4271,"мых":4272,"тей":4273,"ним":4274,"▁пишет":4275,"▁проведения":4276,"▁стар":4277,"гры":4278,"▁заверши":4279,"прос":4280,"▁муниципа":4281,"▁приходи":4282,"▁дальней":4283,"▁конкурен":4284,"ила":4285,"еров":4286,"▁МИД":4287,"▁универси":4288,"ре,":4289,"▁неболь":4290,"нам":4291,"▁Ча":4292,"▁конца":4293,"веде":4294,"rent":4295,"▁сопер":4296,"▁Ис":4297,"щу":4298,"ев.":4299,"кими":4300,"▁следова":4301,"▁«С":4302,"лка":4303,"s,":4304,"▁выигра":4305,"ний,":4306,".R":4307,"тего":4308,"▁возгла":4309,"▁комму":4310,"т\"":4311,"▁являются":4312,"▁ау":4313,"▁поддержа":4314,"▁вид":4315,"▁предвари":4316,"▁<":4317,"▁Ло":4318,"▁Согласно":4319,"▁Rep":4320,"▁пала":4321,"▁улице":4322,"▁ап":4323,"▁наказа":4324,"нил":4325,"нему":4326,"▁останов":4327,"▁достаточно":4328,"▁вызва":4329,"чным":4330,"▁жерт":4331,"скрес":4332,"▁форма":4333,"▁штраф":4334,"ях":4335,"матиче":4336,"▁оши":4337,"▁вели":4338,"нии.":4339,"▁Так,":4340,"▁тен":4341,"уден":4342,"▁первом":4343,"▁2007":4344,"цию,":4345,"▁полиции":4346,"нала":4347,"нов,":4348,"▁какие":4349,"▁первого":4350,"▁области.":4351,"▁что,":4352,"цуз":4353,"▁интервью":4354,"▁предприятия":4355,"▁команда":4356,"▁печа":4357,"▁совета":4358,"▁Ген":4359,"▁дом":4360,"▁узна":4361,"зем":4362,"▁выше":4363,"мы,":4364,"lo":4365,