{
  "nodes": [
    {
      "op": "null",
      "name": "data",
      "inputs": []
    },
    {
      "op": "null",
      "name": "conv1_weight",
      "attrs": {
        "kernel": "(5, 5)",
        "no_bias": "False",
        "num_filter": "6",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "conv1_bias",
      "attrs": {
        "kernel": "(5, 5)",
        "no_bias": "False",
        "num_filter": "6",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "conv1",
      "attrs": {
        "kernel": "(5, 5)",
        "no_bias": "False",
        "num_filter": "6",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    },
    {
      "op": "Activation",
      "name": "relu_conv1",
      "attrs": {"act_type": "relu"},
      "inputs": [[3, 0, 0]]
    },
    {
      "op": "Pooling",
      "name": "pool1",
      "attrs": {
        "kernel": "(2, 2)",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [[4, 0, 0]]
    },
    {
      "op": "null",
      "name": "conv2_weight",
      "attrs": {
        "kernel": "(5, 5)",
        "no_bias": "False",
        "num_filter": "16",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "conv2_bias",
      "attrs": {
        "kernel": "(5, 5)",
        "no_bias": "False",
        "num_filter": "16",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": []
    },
    {
      "op": "Convolution",
      "name": "conv2",
      "attrs": {
        "kernel": "(5, 5)",
        "no_bias": "False",
        "num_filter": "16",
        "pad": "(0, 0)",
        "stride": "(1, 1)"
      },
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    },
    {
      "op": "Activation",
      "name": "relu_conv2",
      "attrs": {"act_type": "relu"},
      "inputs": [[8, 0, 0]]
    },
    {
      "op": "Pooling",
      "name": "pool2",
      "attrs": {
        "kernel": "(2, 2)",
        "pad": "(0, 0)",
        "pool_type": "max",
        "pooling_convention": "full",
        "stride": "(2, 2)"
      },
      "inputs": [[9, 0, 0]]
    },
    {
      "op": "Flatten",
      "name": "flatten_0",
      "inputs": [[10, 0, 0]]
    },
    {
      "op": "null",
      "name": "fc1_weight",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "120"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "fc1_bias",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "120"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "fc1",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "120"
      },
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    },
    {
      "op": "Activation",
      "name": "relu_fc1",
      "attrs": {"act_type": "relu"},
      "inputs": [[14, 0, 0]]
    },
    {
      "op": "null",
      "name": "fc2_weight",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "84"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "fc2_bias",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "84"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "fc2",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "84"
      },
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    },
    {
      "op": "Activation",
      "name": "relu_fc2",
      "attrs": {"act_type": "relu"},
      "inputs": [[18, 0, 0]]
    },
    {
      "op": "null",
      "name": "fc3_weight",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "10"
      },
      "inputs": []
    },
    {
      "op": "null",
      "name": "fc3_bias",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "10"
      },
      "inputs": []
    },
    {
      "op": "FullyConnected",
      "name": "fc3",
      "attrs": {
        "no_bias": "False",
        "num_hidden": "10"
      },
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    1,
    2,
    6,
    7,
    12,
    13,
    16,
    17,
    20,
    21
  ],
  "node_row_ptr": [
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23
  ],
  "heads": [[22, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10400]}
}
