<?xml version="1.0" ?>
<net name="mstcn_online" version="10">
	<layers>
		<layer id="0" name="fhis_in_3" type="Parameter" version="opset1">
			<data element_type="f32" shape="11, 64, 2048"/>
			<output>
				<port id="0" names="fhis_in_3" precision="FP32">
					<dim>11</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="fhis_in_2" type="Parameter" version="opset1">
			<data element_type="f32" shape="11, 64, 2048"/>
			<output>
				<port id="0" names="fhis_in_2" precision="FP32">
					<dim>11</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="fhis_in_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="11, 64, 2048"/>
			<output>
				<port id="0" names="fhis_in_1" precision="FP32">
					<dim>11</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 2048, 24"/>
			<output>
				<port id="0" names="input" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="fhis_in_0" type="Parameter" version="opset1">
			<data element_type="f32" shape="12, 64, 2048"/>
			<output>
				<port id="0" names="fhis_in_0" precision="FP32">
					<dim>12</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="tmp_fhis_in_3_0/Split_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="6" name="tmp_fhis_in_3_0/Split" type="Split" version="opset1">
			<data num_splits="11"/>
			<input>
				<port id="0" precision="FP32">
					<dim>11</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="tmp_fhis_in_3_0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="3" names="tmp_fhis_in_3_1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="4" names="tmp_fhis_in_3_2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="5" names="tmp_fhis_in_3_3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="6" names="tmp_fhis_in_3_4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="7" names="tmp_fhis_in_3_5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="8" names="tmp_fhis_in_3_6" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="9" names="tmp_fhis_in_3_7" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="10" names="tmp_fhis_in_3_8" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="11" names="tmp_fhis_in_3_9" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="12" names="tmp_fhis_in_3_10" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="tmp_fhis_in_0_0/Split_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="8" name="tmp_fhis_in_0_0/Split" type="Split" version="opset1">
			<data num_splits="12"/>
			<input>
				<port id="0" precision="FP32">
					<dim>12</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="tmp_fhis_in_0_0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="3" names="tmp_fhis_in_0_1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="4" names="tmp_fhis_in_0_2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="5" names="tmp_fhis_in_0_3" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="6" names="tmp_fhis_in_0_4" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="7" names="tmp_fhis_in_0_5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="8" names="tmp_fhis_in_0_6" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="9" names="tmp_fhis_in_0_7" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="10" names="tmp_fhis_in_0_8" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="11" names="tmp_fhis_in_0_9" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="12" names="tmp_fhis_in_0_10" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="13" names="tmp_fhis_in_0_11" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Slice_251/Concat1312643475" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Slice_251/Concat131121312744750" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Slice_251/Strides1312844642" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Slice_251" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="603" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Slice_227/Concat1299444753" type="Const" version="opset1">
			<data element_type="i64" offset="80" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Slice_227/Concat129801299544015" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Slice_227/Strides1299643853" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Slice_227" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="579" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Slice_203/Concat1286243679" type="Const" version="opset1">
			<data element_type="i64" offset="104" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Slice_203/Concat128481286344513" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Slice_203/Strides1286444861" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Slice_203" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="555" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Slice_179/Concat1273043838" type="Const" version="opset1">
			<data element_type="i64" offset="128" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Slice_179/Concat127161273144273" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Slice_179/Strides1273243667" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Slice_179" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="531" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Slice_155/Concat1259844351" type="Const" version="opset1">
			<data element_type="i64" offset="152" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Slice_155/Concat125841259944420" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Slice_155/Strides1260043847" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Slice_155" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="507" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Slice_131/Concat1246644855" type="Const" version="opset1">
			<data element_type="i64" offset="176" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Slice_131/Concat124521246743742" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Slice_131/Strides1246844384" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Slice_131" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="483" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Slice_107/Concat1233443907" type="Const" version="opset1">
			<data element_type="i64" offset="200" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Slice_107/Concat123201233544054" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Slice_107/Strides1233644018" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Slice_107" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="459" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Slice_83/Concat1220243544" type="Const" version="opset1">
			<data element_type="i64" offset="224" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Slice_83/Concat121881220344240" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Slice_83/Strides1220443685" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Slice_83" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="435" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Slice_59/Concat1207044771" type="Const" version="opset1">
			<data element_type="i64" offset="248" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Slice_59/Concat120561207143511" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Slice_59/Strides1207244687" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Slice_59" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="411" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Slice_35/Concat1193844696" type="Const" version="opset1">
			<data element_type="i64" offset="272" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Slice_35/Concat119241193943844" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Slice_35/Strides1194044156" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Slice_35" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="387" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Slice_11/Concat1180644693" type="Const" version="opset1">
			<data element_type="i64" offset="296" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Slice_11/Concat117921180744777" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Slice_11/Strides1180844057" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Slice_11" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="363" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="PG.conv_1x1_in.weight" type="Const" version="opset1">
			<data element_type="f32" offset="320" shape="64, 2048, 1" size="524288"/>
			<output>
				<port id="0" names="PG.conv_1x1_in.weight" precision="FP32">
					<dim>64</dim>
					<dim>2048</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>2048</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_0/Dims10616" type="Const" version="opset1">
			<data element_type="f32" offset="524608" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="352" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Concat_12" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="364" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2072</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="PG.conv_dilated_online_1.0.weight" type="Const" version="opset1">
			<data element_type="f32" offset="524864" shape="64, 64, 3" size="49152"/>
			<output>
				<port id="0" names="PG.conv_dilated_online_1.0.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1024" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_19/Dims10562" type="Const" version="opset1">
			<data element_type="f32" offset="574016" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="371" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Slice_17/Concat1185044675" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Slice_17/Concat118361185144201" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Slice_17/Strides1185244807" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Slice_17" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="369" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Concat_18" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="370" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="PG.conv_dilated_online_2.0.weight" type="Const" version="opset1">
			<data element_type="f32" offset="574272" shape="64, 64, 3" size="49152"/>
			<output>
				<port id="0" names="PG.conv_dilated_online_2.0.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_20/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_20/Dims10676" type="Const" version="opset1">
			<data element_type="f32" offset="623424" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_20" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="372" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Concat_21" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="373" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="PG.conv_fusion.0.weight" type="Const" version="opset1">
			<data element_type="f32" offset="623680" shape="64, 128, 1" size="32768"/>
			<output>
				<port id="0" names="PG.conv_fusion.0.weight" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_22/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_22/Dims10964" type="Const" version="opset1">
			<data element_type="f32" offset="656448" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="374" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Relu_23" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" names="375" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Add_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="376" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Concat_36" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="388" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1048</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="PG.conv_dilated_online_1.1.weight" type="Const" version="opset1">
			<data element_type="f32" offset="656704" shape="64, 64, 3" size="49152"/>
			<output>
				<port id="0" names="PG.conv_dilated_online_1.1.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_43/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="512" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_43/Dims11060" type="Const" version="opset1">
			<data element_type="f32" offset="705856" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="395" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Slice_41/Concat1198244639" type="Const" version="opset1">
			<data element_type="i64" offset="80" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Slice_41/Concat119681198344381" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Slice_41/Strides1198443733" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Slice_41" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="393" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Concat_42" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="394" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="PG.conv_dilated_online_2.1.weight" type="Const" version="opset1">
			<data element_type="f32" offset="706112" shape="64, 64, 3" size="49152"/>
			<output>
				<port id="0" names="PG.conv_dilated_online_2.1.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_44/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_44/Dims11006" type="Const" version="opset1">
			<data element_type="f32" offset="755264" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="396" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Concat_45" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="397" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="PG.conv_fusion.1.weight" type="Const" version="opset1">
			<data element_type="f32" offset="755520" shape="64, 128, 1" size="32768"/>
			<output>
				<port id="0" names="PG.conv_fusion.1.weight" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_46/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_46/Dims10976" type="Const" version="opset1">
			<data element_type="f32" offset="788288" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_46" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="398" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Relu_47" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" names="399" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Add_48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="400" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Concat_60" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="412" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>536</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="PG.conv_dilated_online_1.2.weight" type="Const" version="opset1">
			<data element_type="f32" offset="788544" shape="64, 64, 3" size="49152"/>
			<output>
				<port id="0" names="PG.conv_dilated_online_1.2.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_67/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="256" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_67/Dims10742" type="Const" version="opset1">
			<data element_type="f32" offset="837696" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_67" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="419" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Slice_65/Concat1211443487" type="Const" version="opset1">
			<data element_type="i64" offset="104" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Slice_65/Concat121001211543370" type="Const" version="opset1">
			<data element_type="i64" offset="32" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Slice_65/Strides1211644123" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Slice_65" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" ellipsis_mask="0, 0, 0" end_mask="1, 1, 0" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="417" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Concat_66" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="418" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="PG.conv_dilated_online_2.2.weight" type="Const" version="opset1">
			<data element_type="f32" offset="837952" shape="64, 64, 3" size="49152"/>
			<output>
				<port id="0" names="PG.conv_dilated_online_2.2.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_68/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="4" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_68/Dims10520" type="Const" version="opset1">
			<data element_type="f32" offset="887104" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_68" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="420" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Concat_69" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="421" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="PG.conv_fusion.2.weight" type="Const" version="opset1">
			<data element_type="f32" offset="887360" shape="64, 128, 1" size="32768"/>
			<output>
				<port id="0" names="PG.conv_fusion.2.weight" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_70/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_70/Dims11114" type="Const" version="opset1">
			<data element_type="f32" offset="920128" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_70" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="422" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Relu_71" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" names="423" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Add_72" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="424" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Concat_84" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" names="436" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>280</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="PG.conv_dilated_online_1.3.weight" type="Const" version="opset1">
			<data element_type="f32" offset="920384" shape="64, 64, 3" size="49152"/>
			<output>
				<port id="0" names="PG.conv_dilated_online_1.3.weight" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_91/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="128" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_91/Dims11024" type="Const" version="opset1">
			<data element_type="f32" offset="969536" shape="1, 64, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_91" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
