{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"#":6,"$":7,"%":8,"&":9,"(":10,")":11,"+":12,",":13,"-":14,".":15,"/":16,"0":17,"1":18,"2":19,"3":20,"4":21,"5":22,"6":23,"7":24,"8":25,"9":26,":":27,";":28,"=":29,"?":30,"A":31,"B":32,"C":33,"D":34,"E":35,"F":36,"G":37,"H":38,"I":39,"J":40,"K":41,"L":42,"M":43,"N":44,"O":45,"P":46,"Q":47,"R":48,"S":49,"T":50,"U":51,"V":52,"W":53,"X":54,"Y":55,"Z":56,"\\":57,"^":58,"a":59,"b":60,"c":61,"d":62,"e":63,"f":64,"g":65,"h":66,"i":67,"j":68,"k":69,"l":70,"m":71,"n":72,"o":73,"p":74,"q":75,"r":76,"s":77,"t":78,"u":79,"v":80,"w":81,"x":82,"y":83,"z":84,"{":85,"}":86,"~":87,"":88,"":89,"":90,"":91,"":92,"":93,"":94,"":95,"":96,"":97,"":98,"":99,"":100,"":101,"":102,"":103,"":104,"":105,"":106,"":107,"":108,"":109,"¡":110,"¢":111,"£":112,"¤":113,"¥":114,"¦":115,"§":116,"©":117,"«":118,"¬":119,"­":120,"®":121,"°":122,"±":123,"¶":124,"·":125,"»":126,"¿":127,"À":128,"Á":129,"Â":130,"Ã":131,"Ä":132,"Å":133,"Æ":134,"Ç":135,"È":136,"É":137,"Ê":138,"Ë":139,"Ì":140,"Í":141,"Î":142,"Ï":143,"Ð":144,"Ñ":145,"Ò":146,"Ó":147,"Ô":148,"Õ":149,"Ö":150,"×":151,"Ø":152,"Ù":153,"Ú":154,"Û":155,"Ü":156,"Ý":157,"Þ":158,"ß":159,"à":160,"á":161,"â":162,"ã":163,"ä":164,"å":165,"æ":166,"ç":167,"è":168,"é":169,"ê":170,"ë":171,"ì":172,"í":173,"î":174,"ï":175,"ð":176,"ñ":177,"ò":178,"ó":179,"ô":180,"õ":181,"ö":182,"÷":183,"ø":184,"ù":185,"ú":186,"û":187,"ü":188,"ý":189,"þ":190,"ÿ":191,"Ā":192,"ā":193,"Ă":194,"ă":195,"Ą":196,"ą":197,"Ć":198,"ć":199,"Ĉ":200,"Č":201,"č":202,"Ď":203,"ď":204,"Đ":205,"đ":206,"Ē":207,"ē":208,"ĕ":209,"Ė":210,"ė":211,"Ę":212,"ę":213,"Ě":214,"ě":215,"ĝ":216,"Ğ":217,"ğ":218,"ġ":219,"ģ":220,"Ħ":221,"ħ":222,"ĩ":223,"Ī":224,"ī":225,"į":226,"İ":227,"ı":228,"ĵ":229,"ķ":230,"Ĺ":231,"ĺ":232,"ļ":233,"Ľ":234,"ľ":235,"Ł":236,"ł":237,"Ń":238,"ń":239,"ņ":240,"Ň":241,"ň":242,"Ō":243,"ō":244,"ŏ":245,"Ő":246,"ő":247,"Œ":248,"œ":249,"Ŕ":250,"ŕ":251,"Ř":252,"ř":253,"Ś":254,"ś":255,"Ş":256,"ş":257,"Š":258,"š":259,"Ţ":260,"ţ":261,"Ť":262,"ť":263,"ū":264,"ŭ":265,"Ů":266,"ů":267,"Ű":268,"ű":269,"ų":270,"Ÿ":271,"ź":272,"Ż":273,"ż":274,"Ž":275,"ž":276,"ƒ":277,"ơ":278,"ư":279,"ǎ":280,"ǐ":281,"ǔ":282,"ț":283,"ɐ":284,"ɑ":285,"ɔ":286,"ə":287,"ɛ":288,"ɪ":289,"ɹ":290,"ɾ":291,"ʀ":292,"ʃ":293,"ʊ":294,"ʒ":295,"ʿ":296,"ˆ":297,"ˈ":298,"ˌ":299,"ː":300,"́":301,"̃":302,"̄":303,"̆":304,"̇":305,"̈":306,"̊":307,"̋":308,"̍":309,"̤":310,"̧":311,"̨":312,"̯":313,"Ά":314,"Α":315,"Β":316,"Γ":317,"Δ":318,"Ε":319,"Ζ":320,"Η":321,"Θ":322,"Ι":323,"Κ":324,"Λ":325,"Μ":326,"Ν":327,"Ο":328,"Π":329,"Ρ":330,"Σ":331,"Τ":332,"Υ":333,"Φ":334,"Χ":335,"Ω":336,"ά":337,"έ":338,"ή":339,"ί":340,"α":341,"β":342,"γ":343,"δ":344,"ε":345,"ζ":346,"η":347,"θ":348,"ι":349,"κ":350,"λ":351,"μ":352,"ν":353,"ξ":354,"ο":355,"π":356,"ρ":357,"ς":358,"σ":359,"τ":360,"υ":361,"φ":362,"χ":363,"ψ":364,"ω":365,"ϊ":366,"ϋ":367,"ό":368,"ύ":369,"ώ":370,"Ђ":371,"Ѓ":372,"Є":373,"Ѕ":374,"І":375,"Љ":376,"Њ":377,"Ћ":378,"Ќ":379,"Џ":380,"А":381,"Б":382,"В":383,"Г":384,"Д":385,"Е":386,"Ж":387,"З":388,"И":389,"Й":390,"К":391,"Л":392,"М":393,"Н":394,"О":395,"П":396,"Р":397,"С":398,"Т":399,"У":400,"Ф":401,"Х":402,"Ц":403,"Ч":404,"Ш":405,"Ь":406,"Э":407,"Ю":408,"Я":409,"а":410,"б":411,"в":412,"г":413,"д":414,"е":415,"ж":416,"з":417,"и":418,"й":419,"к":420,"л":421,"м":422,"н":423,"о":424,"п":425,"р":426,"с":427,"т":428,"у":429,"ф":430,"х":431,"ц":432,"ч":433,"ш":434,"щ":435,"ъ":436,"ы":437,"ь":438,"э":439,"ю":440,"я":441,"ё":442,"ѓ":443,"є":444,"ѕ":445,"і":446,"ї":447,"ј":448,"љ":449,"њ":450,"ћ":451,"ќ":452,"ў":453,"џ":454,"Ґ":455,"ґ":456,"ғ":457,"қ":458,"ҡ":459,"ң":460,"ү":461,"ұ":462,"һ":463,"ә":464,"ө":465,"ְ":466,"ֳ":467,"ִ":468,"ַ":469,"ָ":470,"ּ":471,"ֿ":472,"א":473,"ב":474,"ג":475,"ד":476,"ה":477,"ו":478,"ז":479,"ח":480,"ט":481,"י":482,"כ":483,"ל":484,"ם":485,"מ":486,"ן":487,"נ":488,"ס":489,"ע":490,"פ":491,"ץ":492,"צ":493,"ק":494,"ר":495,"ש":496,"ת":497,"،":498,"ء":499,"آ":500,"أ":501,"إ":502,"ئ":503,"ا":504,"ب":505,"ة":506,"ت":507,"ث":508,"ج":509,"ح":510,"خ":511,"د":512,"ذ":513,"ر":514,"ز":515,"س":516,"ش":517,"ص":518,"ض":519,"ط":520,"ع":521,"غ":522,"ـ":523,"ف":524,"ق":525,"ك":526,"ل":527,"م":528,"ن":529,"ه":530,"و":531,"ى":532,"ي":533,"ً":534,"َ":535,"ُ":536,"ِ":537,"ّ":538,"ْ":539,"پ":540,"ک":541,"ی":542,"۰":543,"۱":544,"۲":545,"۹":546,"अ":547,"क":548,"त":549,"द":550,"न":551,"प":552,"ब":553,"म":554,"य":555,"र":556,"ल":557,"श":558,"स":559,"ह":560,"ा":561,"ि":562,"ी":563,"ु":564,"े":565,"ो":566,"्":567,"ন":568,"ব":569,"র":570,"ি":571,"্":572,"்":573,"ก":574,"ข":575,"ค":576,"ง":577,"จ":578,"ช":579,"ญ":580,"ฎ":581,"ณ":582,"ด":583,"ต":584,"ถ":585,"ท":586,"ธ":587,"น":588,"บ":589,"ป":590,"พ":591,"ม":592,"ย":593,"ร":594,"ล":595,"ว":596,"ศ":597,"ษ":598,"ส":599,"ห":600,"อ":601,"ะ":602,"ั":603,"า":604,"ิ":605,"ี":606,"ึ":607,"ื":608,"ุ":609,"ู":610,"฿":611,"เ":612,"แ":613,"โ":614,"ใ":615,"ไ":616,"็":617,"่":618,"้":619,"ํ":620,"ຸ":621,"ა":622,"გ":623,"დ":624,"ე":625,"ვ":626,"ი":627,"ლ":628,"მ":629,"ნ":630,"ო":631,"რ":632,"ს":633,"შ":634,"ረ":635,"ር":636,"በ":637,"ዓ":638,"የ":639,"ይ":640,"ḍ":641,"ḥ":642,"ṃ":643,"ṛ":644,"ṣ":645,"ṭ":646,"ṳ":647,"ạ":648,"ả":649,"ậ":650,"ế":651,"ễ":652,"ệ":653,"ọ":654,"ố":655,"ồ":656,"ổ":657,"ộ":658,"ớ":659,"ở":660,"ủ":661,"ỹ":662,"ἰ":663,"ῆ":664,"​":665,"‌":666,"‎":667,"‏":668,"‐":669,"‒":670,"–":671,"—":672,"―":673,"‘":674,"’":675,"‚":676,"‛":677,"“":678,"”":679,"„":680,"‟":681,"†":682,"‡":683,"•":684,"‬":685,"‭":686,"‰":687,"′":688,"‹":689,"›":690,"※":691,"⁄":692,"₪":693,"€":694,"←":695,"↑":696,"→":697,"⇒":698,"⇢":699,"−":700,"√":701,"∞":702,"≈":703,"≤":704,"≥":705,"≪":706,"≫":707,"─":708,"╚":709,"╩":710,"▁":711,"■":712,"▪":713,"►":714,"▼":715,"◆":716,"◊":717,"○":718,"◎":719,"●":720,"★":721,"☆":722,"♀":723,"♣":724,"♥":725,"♦":726,"♪":727,"、":728,"。":729,"「":730,"」":731,"『":732,"』":733,"【":734,"】":735,"あ":736,"い":737,"う":738,"お":739,"か":740,"が":741,"き":742,"く":743,"け":744,"し":745,"す":746,"せ":747,"た":748,"ち":749,"っ":750,"つ":751,"て":752,"で":753,"と":754,"に":755,"の":756,"は":757,"ば":758,"ま":759,"め":760,"も":761,"や":762,"ら":763,"り":764,"る":765,"れ":766,"を":767,"ん":768,"゚":769,"イ":770,"オ":771,"カ":772,"コ":773,"サ":774,"ジ":775,"ス":776,"セ":777,"ッ":778,"テ":779,"ト":780,"ド":781,"ナ":782,"ニ":783,"バ":784,"ビ":785,"フ":786,"マ":787,"ユ":788,"ラ":789,"リ":790,"ル":791,"レ":792,"ワ":793,"ン":794,"・":795,"ー":796,"一":797,"三":798,"上":799,"下":800,"不":801,"东":802,"个":803,"中":804,"为":805,"乐":806,"了":807,"事":808,"二":809,"五":810,"京":811,"人":812,"仁":813,"以":814,"会":815,"伦":816,"体":817,"你":818,"修":819,"克":820,"免":821,"入":822,"八":823,"出":824,"分":825,"切":826,"剥":827,"北":828,"区":829,"匿":830,"南":831,"博":832,"原":833,"去":834,"参":835,"取":836,"口":837,"只":838,"可":839,"台":840,"司":841,"合":842,"名":843,"吗":844,"吸":845,"呼":846,"和":847,"啦":848,"国":849,"图":850,"國":851,"在":852,"场":853,"城":854,"多":855,"大":856,"天":857,"头":858,"套":859,"女":860,"娱":861,"子":862,"字":863,"学":864,"安":865,"定":866,"家":867,"宿":868,"寺":869,"寿":870,"小":871,"就":872,"山":873,"島":874,"川":875,"州":876,"市":877,"常":878,"平":879,"年":880,"広":881,"应":882,"式":883,"引":884,"当":885,"影":886,"德":887,"思":888,"愛":889,"我":890,"手":891,"持":892,"敏":893,"文":894,"新":895,"方":896,"日":897,"明":898,"是":899,"更":900,"最":901,"有":902,"木":903,"本":904,"机":905,"李":906,"来":907,"東":908,"楽":909,"正":910,"武":911,"比":912,"民":913,"水":914,"江":915,"治":916,"法":917,"海":918,"清":919,"港":920,"湾":921,"漢":922,"物":923,"王":924,"球":925,"理":926,"生":927,"用":928,"田":929,"疫":930,"的":931,"直":932,"相":933,"県":934,"知":935,"社":936,"神":937,"禅":938,"种":939,"空":940,"站":941,"简":942,"网":943,"美":944,"能":945,"腹":946,"臘":947,"自":948,"舅":949,"舖":950,"舫":951,"色":952,"花":953,"藤":954,"行":955,"表":956,"西":957,"见":958,"解":959,"語":960,"语":961,"谷":962,"赌":963,"越":964,"路":965,"过":966,"选":967,"通":968,"道":969,"遝":970,"郎":971,"都":972,"配":973,"里":974,"金":975,"鋓":976,"鋘":977,"鋜":978,"问":979,"雄":980,"青":981,"面":982,"音":983,"页":984,"顶":985,"题":986,"风":987,"食":988,"館":989,"馬":990,"黚":991,"黵":992,"국":993,"년":994,"어":995,"이":996,"한":997,"":998,"":999,"":1000,"":1001,"":1002,"﻿":1003,"�":1004,"en":1005,"er":1006,"ch":1007,"▁d":1008,"ei":1009,"un":1010,"ie":1011,"▁,":1012,"st":1013,"in":1014,"▁.":1015,"▁a":1016,"es":1017,"ich":1018,"on":1019,"▁un":1020,"▁die":1021,"ein":1022,"▁w":1023,"▁s":1024,"##":1025,"an":1026,"ung":1027,"▁S":1028,"ge":1029,"▁der":1030,"sch":1031,"▁und":1032,"te":1033,"ti":1034,"▁v":1035,"▁ein":1036,"or":1037,"ll":1038,"▁A":1039,"ten":1040,"ar":1041,"as":1042,"▁b":1043,"▁z":1044,"▁m":1045,"it":1046,"▁D":1047,"ur":1048,"▁E":1049,"▁i":1050,"▁B":1051,"gen":1052,"▁in":1053,"us":1054,"em":1055,"den":1056,"hr":1057,"al":1058,"▁n":1059,"AT":1060,"der":1061,"##AT":1062,"##AT##":1063,"▁M":1064,"▁f":1065,"▁P":1066,"ir":1067,"▁h":1068,"ter":1069,"ra":1070,"▁K":1071,"▁zu":1072,"▁F":1073,"lich":1074,"▁I":1075,"uf":1076,"▁W":1077,"et":1078,"▁G":1079,"ür":1080,"el":1081,"▁k":1082,"▁V":1083,"mm":1084,"at":1085,"▁das":1086,"eit":1087,"is":1088,"▁R":1089,"▁H":1090,"▁den":1091,"ber":1092,"▁g":1093,"ro":1094,"isch":1095,"▁von":1096,"ier":1097,"▁ge":1098,"de":1099,"icht":1100,"▁T":1101,"▁wir":1102,"▁an":1103,"ben":1104,"▁L":1105,"tion":1106,"ent":1107,"▁er":1108,"▁ist":1109,"um":1110,"re":1111,"▁##AT##":1112,"▁auf":1113,"-##AT##":1114,"▁##AT##-##AT##":1115,"▁für":1116,"ol":1117,"ach":1118,"am":1119,"uch":1120,"eh":1121,"sen":1122,"▁ver":1123,"▁mit":1124,"▁U":1125,"ig":1126,"ck":1127,"▁Z":1128,"▁Ver":1129,"se":1130,"▁des":1131,"ser":1132,"▁be":1133,"and":1134,"ell":1135,"▁l":1136,"ungen":1137,"▁N":1138,"ut":1139,"nen":1140,"▁Die":1141,"ft":1142,"▁o":1143,"eich":1144,"si":1145,"▁In":1146,"▁eine":1147,"▁so":1148,"▁Sie":1149,"▁im":1150,"▁wer":1151,"▁nicht":1152,"il":1153,"ind":1154,"op":1155,"ot":1156,"sp":1157,"ischen":1158,"über":1159,"le":1160,"▁sich":1161,"än":1162,"▁&":1163,"omm":1164,"kt":1165,"▁werden":1166,"ff":1167,"ah":1168,"▁dem":1169,"▁p":1170,"▁St":1171,"▁dass":1172,"ls":1173,"▁An":1174,"om":1175,"ation":1176,"▁aus":1177,"▁t":1178,"▁C":1179,"▁Un":1180,"▁Re":1181,"ahr":1182,"▁es":1183,"la":1184,"▁über":1185,"ann":1186,"ehr":1187,"ri":1188,"▁st":1189,"▁1":1190,"eu":1191,"▁J":1192,"▁auch":1193,"qu":1194,"ien":1195,"▁da":1196,"sten":1197,"urop":1198,"gt":1199,"etz":1200,"rei":1201,"▁Sch":1202,"be":1203,"▁um":1204,"ungs":1205,"men":1206,"och":1207,"▁ha":1208,"▁sind":1209,"lle":1210,"▁2":1211,"scha":1212,"▁(":1213,"▁vor":1214,"rä":1215,"▁wird":1216,"▁)":1217,"▁Be":1218,"ern":1219,"▁j":1220,"esch":1221,"wei":1222,"▁als":1223,"▁sch":1224,"hal":1225,"ön":1226,"▁Pro":1227,"▁bei":1228,"ver":1229,"▁wie":1230,"end":1231,"▁Er":1232,"▁Ein":1233,"iel":1234,"lie":1235,"tig":1236,"os":1237,"ort":1238,"▁O":1239,"00":1240,"▁En":1241,"enn":1242,"▁ich":1243,"▁hat":1244,"▁sein":1245,"▁oder":1246,"eil":1247,"au":1248,"▁e":1249,"schaft":1250,"▁:":1251,"ät":1252,"▁Aus":1253,"▁Europ":1254,"▁dies":1255,"quot":1256,"▁&quot":1257,"▁&quot;":1258,"▁zur":1259,"▁-":1260,"urch":1261,"zu":1262,"tern":1263,"▁Mit":1264,"tel":1265,"aus":1266,"▁haben":1267,"▁Ber":1268,"he":1269,"▁sie":1270,"▁Her":1271,"imm":1272,"lichen":1273,"stell":1274,"ing":1275,"und":1276,"▁ent":1277,"▁einer":1278,"▁ihr":1279,"sion":1280,"ische":1281,"▁kön":1282,"▁Ar":1283,"rü":1284,"ion":1285,"ab":1286,"tet":1287,"▁Wir":1288,"▁unser":1289,"ul":1290,"for":1291,"fü":1292,"ger":1293,"aten":1294,"dern":1295,"schen":1296,"cht":1297,"ick":1298,"ik":1299,"zen":1300,"eiten":1301,"▁nach":1302,"heit":1303,"▁unter":1304,"▁einen":1305,"▁Das":1306,"ed":1307,"sta":1308,"llen":1309,"keit":1310,"är":1311,"▁Komm":1312,"ang":1313,"iti":1314,"▁Fra":1315,"ru":1316,"uss":1317,"elt":1318,"▁Par":1319,"igen":1320,"ste":1321,"▁durch":1322,"▁Ich":1323,"▁wur":1324,"wer":1325,"▁können":1326,"tiv":1327,"▁Ge":1328,"liche":1329,"oh":1330,"anz":1331,"▁dar":1332,"▁Jahr":1333,"▁Kommis":1334,"▁Herr":1335,"▁Vor":1336,"ommen":1337,"rie":1338,"▁mö":1339,"▁Sp":1340,"bl":1341,"ehen":1342,"ne":1343,"ant":1344,"reich":1345,"▁zum":1346,"ap":1347,"ör":1348,"ag":1349,"▁Ent":1350,"▁Ab":1351,"▁einem":1352,"ad":1353,"beit":1354,"ieren":1355,"glich":1356,"eine":1357,"uß":1358,"chte":1359,"▁Europä":1360,"iert":1361,"pf":1362,"▁uns":1363,"▁all":1364,"▁kann":1365,"▁diese":1366,"ktion":1367,"chen":1368,"üs":1369,"est":1370,"ken":1371,"▁nur":1372,"du":1373,"bar":1374,"▁Auf":1375,"▁Ihr":1376,"ige":1377,"▁ander":1378,"oliti":1379,"▁Der":1380,"▁ab":1381,"all":1382,"ün":1383,"ist":1384,"eiter":1385,"ahl":1386,"▁Kon":1387,"ffen":1388,"▁Ho":1389,"ges":1390,"amm":1391,"▁!":1392,"räsi":1393,"geb":1394,"▁war":1395,"che":1396,"ok":1397,"bt":1398,"räsiden":1399,"▁dieser":1400,"▁Kommission":1401,"▁Es":1402,"ehmen":1403,"auf":1404,"▁neu":1405,"hen":1406,"rit":1407,"ähr":1408,"▁ber":1409,"▁re":1410,"ierung":1411,"▁Ma":1412,"fen":1413,"▁daß":1414,"og":1415,"rund":1416,"▁noch":1417,"▁sp":1418,"üt":1419,"zi":1420,"ran":1421,"lei":1422,"ers":1423,"tra":1424,"▁am":1425,"nis":1426,"ück":1427,"räsident":1428,"eren":1429,"utz":1430,"ität":1431,"▁wurde":1432,"alen":1433,"lam":1434,"▁mehr":1435,"▁soll":1436,"ic":1437,"▁200":1438,"glie":1439,"▁aber":1440,"gel":1441,"äh":1442,"oll":1443,"▁müs":1444,"▁Um":1445,"wick":1446,"▁wenn":1447,"ug":1448,"tigen":1449,"▁c":1450,"ner":1451,"age":1452,"▁man":1453,"eg":1454,"ess":1455,"stimm":1456,"▁de":1457,"form":1458,"▁/":1459,"leich":1460,"▁sehr":1461,"▁müssen":1462,"assen":1463,"ord":1464,"ze":1465,"ert":1466,"▁r":1467,"▁Mitglie":1468,"▁Präsident":1469,"ill":1470,"ht":1471,"▁zw":1472,"lament":1473,"nah":1474,"▁?":1475,"etzt":1476,"▁bis":1477,"▁sow":1478,"me":1479,"ak":1480,"lin":1481,"▁bes":1482,"fahr":1483,"ekt":1484,"▁Parlament":1485,"ammen":1486,"führ":1487,"iz":1488,"▁ges":1489,"ale":1490,"ma":1491,"usammen":1492,"ob":1493,"roß":1494,"▁3":1495,"▁diesem":1496,"▁hin":1497,"ek":1498,"▁Men":1499,"▁Union":1500,"▁weiter":1501,"tschaft":1502,"▁Reg":1503,"▁gegen":1504,"▁was":1505,"▁gen":1506,"atz":1507,"▁Arbeit":1508,"sam":1509,"▁&#":1510,"pp":1511,"wend":1512,"ass":1513,"unden":1514,"änd":1515,"▁Unter":1516,"▁Europäischen":1517,"fol":1518,"lung":1519,"hnen":1520,"▁alle":1521,"mit":1522,"acht":1523,"▁gew":1524,"onder":1525,"sche":1526,"schie":1527,"olle":1528,"▁Ü":1529,"eben":1530,"ließ":1531,"▁Mitglied":1532,"▁bet":1533,"gra":1534,"▁kon":1535,"stem":1536,"▁gem":1537,"▁De":1538,"ationen":1539,"vor":1540,"▁her":1541,"▁möchte":1542,"halten":1543,"lä":1544,"di":1545,"omp":1546,"ellen":1547,"äl":1548,"▁kl":1549,"eigen":1550,"alt":1551,"▁19":1552,"halt":1553,"▁Zeit":1554,"▁Hotel":1555,"▁Ges":1556,"ystem":1557,"▁–":1558,"ech":1559,"ichtig":1560,"art":1561,"▁Rat":1562,"rin":1563,"▁Zu":1564,"dem":1565,"▁Über":1566,"kommen":1567,"▁..":1568,"▁hier":1569,"her":1570,"ühr":1571,"▁eines":1572,"▁For":1573,"▁EU":1574,"ibt":1575,"tige":1576,"uropä":1577,"▁So":1578,"land":1579,"▁je":1580,"lan":1581,"gan":1582,"ren":1583,"▁vom":1584,"stüt":1585,"mal":1586,"▁groß":1587,"▁Frau":1588,"nung":1589,"ast":1590,"zie":1591,"inden":1592,"▁lie":1593,"▁ihre":1594,"▁Bericht":1595,"ha":1596,"▁Menschen":1597,"▁&#9":1598,"▁sowie":1599,"äch":1600,"▁europä":1601,"bes":1602,"▁zwei":1603,"▁dieses":1604,"igkeit":1605,"▁jed":1606,"▁...":1607,"teil":1608,"▁et":1609,"icher":1610,"änder":1611,"▁Bei":1612,"▁gibt":1613,"▁Mar":1614,"olitik":1615,"ster":1616,"bst":1617,"ho":1618,"▁wo":1619,"▁Im":1620,"kl":1621,"▁Land":1622,"pt":1623,"ohl":1624,"mmer":1625,"halb":1626,"blem":1627,"lau":1628,"ild":1629,"iele":1630,"ften":1631,"staaten":1632,"▁viel":1633,"▁Entwick":1634,"▁best":1635,"▁zwischen":1636,"wir":1637,"▁Nach":1638,"öglich":1639,"▁Ch":1640,"mer":1641,"ati":1642,"▁muss":1643,"▁“":1644,"amit":1645,"einen":1646,"▁unsere":1647,"los":1648,"andel":1649,"setz":1650,"▁keine":1651,"ank":1652,"ss":1653,"▁pro":1654,"▁bie":1655,"war":1656,"▁bereit":1657,"▁Ihnen":1658,"▁Or":1659,"gramm":1660,"▁ausge":1661,"▁beg":1662,"▁ange":1663,"rauch":1664,"agen":1665,"sicht":1666,"eschä":1667,"▁Recht":1668,"eute":1669,"achen":1670,"▁Mitgliedstaaten":1671,"ativ":1672,"gung":1673,"▁Haus":1674,"bei":1675,"▁4":1676,"stat":1677,"▁Grund":1678,"▁son":1679,"öff":1680,"ett":1681,"apos":1682,"▁&apos":1683,"▁&apos;":1684,"▁Produ":1685,"eht":1686,"▁the":1687,"▁anderen":1688,"pro":1689,"▁5":1690,"zeu":1691,"id":1692,"▁Ä":1693,"▁Europa":1694,"▁Zusammen":1695,"our":1696,"ternehmen":1697,"▁„":1698,"lo":1699,"eb":1700,"▁bef":1701,"rö":1702,"forder":1703,"entr":1704,"geben":1705,"ga":1706,"gend":1707,"issen":1708,"itu":1709,"ußer":1710,"keiten":1711,"ler":1712,"▁Problem":1713,"iv":1714,"iger":1715,"elbst":1716,"▁Wenn":1717,"ischer":1718,"▁immer":1719,"immer":1720,"▁ger":1721,"▁Fl":1722,"ate":1723,"weise":1724,"fe":1725,"stellen":1726,"▁;":1727,"chten":1728,"schließ":1729,"gesch":1730,"unkt":1731,"ov":1732,"▁dann":1733,"kte":1734,"inanz":1735,"▁Welt":1736,"▁Al":1737,"▁Vorsch":1738,"▁Bereich":1739,"▁Inform":1740,"len":1741,"▁Bür":1742,"eid":1743,"ständ":1744,"▁Q":1745,"▁ins":1746,"▁diesen":1747,"▁wieder":1748,"amen":1749,"▁damit":1750,"▁Kl":1751,"nahmen":1752,"ritt":1753,"▁Verb":1754,"▁einz":1755,"gie":1756,"trag":1757,"▁gesch":1758,"▁ganz":1759,"legen":1760,"▁wurden":1761,"stellt":1762,"fer":1763,"enden":1764,"ös":1765,"od":1766,"▁eigen":1767,"per":1768,"ce":1769,"ternation":1770,"ding":1771,"arbeit":1772,"▁Dies":1773,"zung":1774,"▁Diese":1775,"icherheit":1776,"zeich":1777,"innen":1778,"ard":1779,"äm":1780,"▁neue":1781,"▁Ste":1782,"▁wichtig":1783,"rün":1784,"ändern":1785,"rechen":1786,"▁Qu":1787,"▁unserer":1788,"schieden":1789,"rag":1790,"▁Geb":1791,"lag":1792,"hne":1793,"▁Ihre":1794,"we":1795,"elle":1796,"▁Th":1797,"wort":1798,"▁mein":1799,"sel":1800,"zeit":1801,"richt":1802,"▁habe":1803,"tur":1804,"ats":1805,"pl":1806,"ia":1807,"▁Gem":1808,"ßen":1809,"▁sondern":1810,"fahren":1811,"einsam":1812,"fl":1813,"olog":1814,"▁jedoch":1815,"▁Maß":1816,"▁seine":1817,"▁Europäische":1818,"stand":1819,"inder":1820,"▁Bet":1821,"▁politi":1822,"ment":1823,"erson":1824,"satz":1825,"reichen":1826,"alis":1827,"▁Sta":1828,"ke":1829,"▁20":1830,"zt":1831,"mittel":1832,"net":1833,"▁etw":1834,"ragen":1835,"ust":1836,"inn":1837,"▁wür":1838,"▁Stra":1839,"▁heute":1840,"▁en":1841,"fach":1842,"ruck":1843,"tik":1844,"▁ho":1845,"▁Unternehmen":1846,"min":1847,"lagen":1848,"▁Än":1849,"▁ob":1850,"▁gleich":1851,"▁Was":1852,"sk":1853,"erv":1854,"▁wen":1855,"für":1856,"▁and":1857,"zei":1858,"osten":1859,"▁Kolle":1860,"röß":1861,"such":1862,"uten":1863,"äre":1864,"essen":1865,"▁Änder":1866,"tro":1867,"▁bereits":1868,"▁Teil":1869,"▁Wie":1870,"licher":1871,"att":1872,"▁mich":1873,"▁Entwicklung":1874,"▁selbst":1875,"eist":1876,"kehr":1877,"okra":1878,"▁unterstüt":1879,"▁sollte":1880,"fall":1881,"▁Daten":1882,"▁wel":1883,"tionen":1884,"lage":1885,"alität":1886,"eite":1887,"ktiv":1888,"▁Frage":1889,"▁ex":1890,"ub":1891,"▁führ":1892,"▁europäischen":1893,"▁ihrer":1894,"▁neuen":1895,"ow":1896,"▁ohne":1897,"orden":1898,"chn":1899,"▁Leben":1900,"▁Wer":1901,"▁Jahren":1902,"▁verb":1903,"▁Hin":1904,"indet":1905,"▁Richt":1906,"stellung":1907,"eld":1908,"▁andere":1909,"▁%":1910,"▁Stad":1911,"mus":1912,"▁Inter":1913,"▁Te":1914,"öffent":1915,"▁internation":1916,"im":1917,"▁denn":1918,"▁Min":1919,"▁Sicherheit":1920,"ierte":1921,"▁fest":1922,"▁Se":1923,"▁Mon":1924,"ere":1925,"fern":1926,"ält":1927,"▁sollten":1928,"▁Bürger":1929,"tre":1930,"▁finden":1931,"gem":1932,"amp":1933,"▁denen":1934,"cken":1935,"▁System":1936,"▁Programm":1937,"kun":1938,"▁Bes":1939,"▁gemeinsam":1940,"▁möglich":1941,"io":1942,"atur":1943,"▁verschieden":1944,"▁for":1945,"nisse":1946,"nahme":1947,"▁Des":1948,"oren":1949,"rupp":1950,"▁Tag":1951,"ondere":1952,"▁Stadt":1953,"ährend":1954,"esse":1955,"▁bietet":1956,"zahl":1957,"▁sol":1958,"hn":1959,"ktur":1960,"tigt":1961,"leist":1962,"arb":1963,"ffe":1964,"nte":1965,"▁6":1966,"osi":1967,"luss":1968,"▁Wirtschaft":1969,"▁Mittel":1970,"unktion":1971,"▁Li":1972,"ker":1973,"ele":1974,"▁dazu":1975,"tieren":1976,"ünf":1977,"▁Part":1978,"▁liegt":1979,"▁entsp":1980,"ichte":1981,"▁Inst":1982,"isk":1983,"äng":1984,"ierten":1985,"▁machen":1986,"▁allen":1987,"kunft":1988,"▁Möglich":1989,"▁aller":1990,"▁viele":1991,"▁Person":1992,"hör":1993,"hin":1994,"▁weil":1995,"ade":1996,"ahmen":1997,"▁of":1998,"▁bek":1999,"welt":2000,"ander":2001,"äß":2002,"3;":2003,"▁&#93;":2004,"▁letz":2005,"sar":2006,"eiden":2007,"1;":2008,"▁&#91;":2009,"▁Web":2010,"under":2011,"▁darauf":2012,"▁seiner":2013,"▁ben":2014,"eise":2015,"▁jetzt":2016,"wert":2017,"ial":2018,"igung":2019,"aher":2020,"alten":2021,"aupt":2022,"▁Stand":2023,"▁Ex":2024,"wor":2025,"▁beh":2026,"zug":2027,"▁Them":2028,"▁größ":2029,"▁Gen":2030,"▁sicher":2031,"▁Man":2032,"ienst":2033,"reis":2034,"umen":2035,"iss":2036,"▁ar":2037,"▁US":2038,"▁kein":2039,"▁Ger":2040,"▁Rahmen":2041,"ice":2042,"▁einge":2043,"lungen":2044,"▁voll":2045,"▁Informationen":2046,"▁geb":2047,"ganis":2048,"▁geht":2049,"▁Maßnahmen":2050,"▁Lage":2051,"atür":2052,"▁einfach":2053,"ringen":2054,"▁wirk":2055,"▁Zimmer":2056,"▁schon":2057,"annt":2058,"ultur":2059,"▁gef":2060,"ud":2061,"kon":2062,"▁Mein":2063,"▁eben":2064,"▁Finanz":2065,"▁Gemein":2066,"lossen":2067,"▁gut":2068,"▁einige":2069,"oten":2070,"ionen":2071,"▁dafür":2072,"zial":2073,"▁Verein":2074,"▁Am":2075,"ungsant":2076,"ay":2077,"ts":2078,"klär":2079,"tiert":2080,"spiel":2081,"mar":2082,"eln":2083,"▁Jahre":2084,"▁Fall":2085,"gar":2086,"▁Aussch":2087,"esen":2088,"▁te":2089,"rän":2090,"▁Herrn":2091,"ute":2092,"▁Kommissar":2093,"▁Pl":2094,"affen":2095,"folg":2096,"hält":2097,"▁zurück":2098,"ks":2099,"otwend":2100,"bau":2101,"öl":2102,"ron":2103,"itz":2104,"heiten":2105,"grund":2106,"▁to":2107,"▁allem":2108,"▁Ziel":2109,"tischen":2110,"▁ihren":2111,"lichkeit":2112,"▁Eur":2113,"ine":2114,"äten":2115,"besser":2116,"ris":2117,"üh":2118,"▁Gew":2119,"▁deut":2120,"▁Mo":2121,"▁dir":2122,"▁meine":2123,"▁nun":2124,"ven":2125,"▁Da":2126,"gew":2127,"▁zusammen":2128,"▁bin":2129,"gang":2130,"ichten":2131,"▁Für":2132,"setzung":2133,"uer":2134,"ER":2135,"▁mir":2136,"▁Bl":2137,"ite":2138,"▁7":2139,"eicht":2140,"▁0":2141,"▁Ö":2142,"▁al":2143,"▁besonder":2144,"scheid":2145,"▁All":2146,"▁mo":2147,"▁unseren":2148,"besondere":2149,"▁8":2150,"▁besch":2151,"▁Eine":2152,"genommen":2153,"▁wollen":2154,"▁Aut":2155,"ac":2156,"punkt":2157,"iet":2158,"▁199":2159,"▁verfü":2160,"aler":2161,"führt":2162,"ohn":2163,"antwort":2164,"anden":2165,"▁Ener":2166,"▁9":2167,"▁Ha":2168,"ange":2169,"so":2170,"aren":2171,"ruktur":2172,"ogen":2173,"▁würde":2174,"▁Gesch":2175,"▁10":2176,"gleich":2177,"▁Proj":2178,"ations":2179,"eiß":2180,"spro":2181,"fte":2182,"reu":2183,"riv":2184,"w.":2185,"licht":2186,"▁seit":2187,"ichter":2188,"▁Parlaments":2189,"▁Bild":2190,"ahn":2191,"gr":2192,"▁stehen":2193,"▁Lös":2194,"▁etwas":2195,"aum":2196,"▁während":2197,"▁sagen":2198,"itte":2199,"▁Vorschlag":2200,"▁wissen":2201,"▁Länder":2202,"stimmung":2203,"▁Bar":2204,"recht":2205,"yp":2206,"▁Me":2207,"ond":2208,"sto":2209,"▁doch":2210,"▁Rechts":2211,"▁Geschä":2212,"gangen":2213,"▁Form":2214,"▁Frei":2215,"▁Dem":2216,"▁Und":2217,"ta":2218,"deut":2219,"rem":2220,"unde":2221,"ordnung":2222,"werb":2223,"ekte":2224,"▁drei":2225,"▁Unterstüt":2226,"anken":2227,"▁Unser":2228,"rache":2229,"▁bestimm":2230,"▁Durch":2231,"▁erm":2232,"▁ersten":2233,"linie":2234,"rom":2235,"▁verw":2236,"▁insbesondere":2237,"▁schn":2238,"fra":2239,"▁Komp":2240,"▁Ter":2241,"fft":2242,"▁erhalten":2243,"▁kommen":2244,"hand":2245,"▁Bo":2246,"▁außer":2247,"▁nie":2248,"▁fol":2249,"atürlich":2250,"▁komm":2251,"schaften":2252,"▁Kunden":2253,"▁Fraktion":2254,"▁Politik":2255,"räge":2256,"▁Verfü":2257,"▁Markt":2258,"▁Haushalt":2259,"▁einmal":2260,"amil":2261,"ende":2262,"erk":2263,"▁Beh":2264,"rank":2265,"▁öffent":2266,"utzen":2267,"▁Umwelt":2268,"ätz":2269,"ark":2270,"▁Ur":2271,"agt":2272,"lungs":2273,"assung":2274,"▁waren":2275,"hol":2276,"falls":2277,"▁Sti":2278,"fri":2279,"ilfe":2280,"▁verst":2281,"▁Mill":2282,"▁Unterstützung":2283,"▁beim":2284,"isten":2285,"▁Arbeits":2286,"tels":2287,"▁spe":2288,"itäten":2289,"▁Zusammenarbeit":2290,"zü":2291,"ellschaft":2292,"gabe":2293,"▁Namen":2294,"▁also":2295,"▁Mus":2296,"▁wirtschaft":2297,"▁letzten":2298,"vers":2299,"▁nation":2300,"ache":2301,"▁Art":2302,"▁The":2303,"▁Spiel":2304,"▁lassen":2305,"▁bede":2306,"▁Zug":2307,"gehen":2308,"▁Lin":2309,"▁Gemeinschaft":2310,"▁Tran":2311,"arten":2312,"▁Intern":2313,"▁Ländern":2314,"▁geben":2315,"▁Änderungsant":2316,"legt":2317,"▁Energie":2318,"hö":2319,"▁Flug":2320,"altung":2321,"▁entwick":2322,"raum":2323,"▁la":2324,"orgen":2325,"▁Deut":2326,"▁umf":2327,"▁Em":2328,"neh":2329,"▁Haupt":2330,"▁besteht":2331,"▁besser":2332,"▁sehen":2333,"ktu":2334,"ismus":2335,"ald":2336,"ign":2337,"örder":2338,"ina":2339,"führung":2340,"ost":2341,"ware":2342,"ian":2343,"uchen":2344,"tier":2345,"nten":2346,"von":2347,"▁Als":2348,"raft":2349,"druck":2350,"▁Handel":2351,"▁Fragen":2352,"▁gel":2353,"▁Euro":2354,"etzen":2355,"▁steht":2356,"xt":2357,"schied":2358,"gaben":2359,"wendung":2360,"▁gest":2361,"▁tun":2362,"▁komp":2363,"▁Ad":2364,"urz":2365,"glichen":2366,"echn":2367,"▁Dienst":2368,"ative":2369,"▁frei":2370,"uft":2371,"kten":2372,"▁Besch":2373,"▁seinen":2374,"iell":2375,"▁inter":2376,"nehmen":2377,"gri":2378,"tisch":2379,"▁Beit":2380,"▁Regierung":2381,"ichts":2382,"▁statt":2383,"▁ch":2384,"lex":2385,"zieh":2386,"▁La":2387,"rieb":2388,"ichterstat":2389,"▁wäre":2390,"▁Kollegen":2391,"▁Seite":2392,"häng":2393,"▁dabei":2394,"▁wich":2395,"ettbe":2396,"ätze":2397,"▁recht":2398,"rak":2399,"▁glau":2400,"sf":2401,"000":2402,"▁Geschäft":2403,"fiz":2404,"▁du":2405,"▁Rei":2406,"fort":2407,"▁Vertrag":2408,"▁15":2409,"▁gehör":2410,"▁Proz":2411,"bereich":2412,"▁per":2413,"andelt":2414,"▁hö":2415,"▁muß":2416,"blick":2417,"igt":2418,"eisten":2419,"markt":2420,"arte":2421,"wirtschaft":2422,"eile":2423,"staur":2424,"▁worden":2425,"▁Schw":2426,"tigung":2427,"▁Techn":2428,"▁Hand":2429,"rechte":2430,"ruch":2431,"entrum":2432,"▁we":2433,"ument":2434,"▁Bedeut":2435,"▁qu":2436,"eig":2437,"eien":2438,"▁bed":2439,"eschäf":2440,"▁Dar":2441,"▁Verfügung":2442,"ib":2443,"rech":2444,"undheit":2445,"are":2446,"▁Ant":2447,"▁große":2448,"▁welche":2449,"▁großen":2450,"dingungen":2451,"racht":2452,"▁inner":2453,"▁erst":2454,"▁le":2455,"▁Eben":2456,"▁Entscheid":2457,"▁Bedeutung":2458,"obil":2459,"▁deren":2460,"rück":2461,"▁em":2462,"▁Kinder":2463,"▁or":2464,"▁bew":2465,"▁Ergeb":2466,"▁Su":2467,"▁Regel":2468,"▁Internet":2469,"▁Ben":2470,"▁Ro":2471,"▁Hier":2472,"rüh":2473,"az":2474,"ielen":2475,"ettbewerb":2476,"▁Schutz":2477,"▁sozi":2478,"▁Möglichkeit":2479,"▁jeder":2480,"kauf":2481,"▁schw":2482,"▁El":2483,"▁blei":2484,"äd":2485,"sst":2486,"rot":2487,"feren":2488,"▁Berichterstat":2489,"tische":2490,"ater":2491,"▁Auch":2492,"▁zahl":2493,"ack":2494,"asse":2495,"▁Serv":2496,"ücks":2497,"▁Staaten":2498,"reffen":2499,"▁Fahr":2500,"ünst":2501,"▁offen":2502,"▁Aber":2503,"gestellt":2504,"▁Zahl":2505,"▁bieten":2506,"nt":2507,"▁notwend":2508,"beh":2509,"amt":2510,"▁hervor":2511,"bild":2512,"▁el":2513,"▁Vol":2514,"▁entfern":2515,"▁Thema":2516,"▁Fol":2517,"vest":2518,"▁Lebens":2519,"abil":2520,"ähl":2521,"▁##":2522,"▁18":2523,"wirk":2524,"ies":2525,"ierungs":2526,"▁Ne":2527,"▁davon":2528,"▁Gä":2529,"schutz":2530,"ium":2531,"▁Lie":2532,"org":2533,"gesetzt":2534,"▁Bed":2535,"▁At":2536,"▁Zukunft":2537,"▁darüber":2538,"ölker":2539,"ve":2540,"12":2541,"rat":2542,"▁daher":2543,"▁erforder":2544,"mo":2545,"▁entsch":2546,"iels":2547,"dust":2548,"▁schnell":2549,"staurant":2550,"rift":2551,"▁stellen":2552,"ielt":2553,"▁lang":2554,"euer":2555,"zuf":2556,"weg":2557,"▁stell":2558,"ffiz":2559,"▁Probleme":2560,"ämpf":2561,"politik":2562,"▁alles":2563,"▁brauch":2564,"unter":2565,"▁will":2566,"▁gegenüber":2567,"▁Seiten":2568,"▁is":2569,"▁eigenen":2570,"▁on":2571,"hang":2572,"▁12":2573,"tikel":2574,"zep":2575,"rieden":2576,"ufen":2577,"▁befindet":2578,"▁sowohl":2579,"▁Frauen":2580,"▁Weise":2581,"▁Gegen":2582,"rand":2583,"▁Famil":2584,"▁Beispiel":2585,"▁verl":2586,"rise":2587,"ritte":2588,"tigkeit":2589,"▁Qualität":2590,"▁weitere":2591,"▁&amp":2592,"▁&amp;":2593,"▁Weg":2594,"ennt":2595,"▁Ihrer":2596,"treten":2597,"▁näch":2598,"▁Le":2599,"igkeiten":2600,"ital":2601,"▁teil":2602,"gl":2603,"▁erreichen":2604,"ide":2605,"anischen":2606,"▁Tra":2607,"▁Wahl":2608,"▁natürlich":2609,"▁Res":2610,"▁meiner":2611,"▁politischen":2612,"▁Ende":2613,"inde":2614,"▁Co":2615,"▁unterstützen":2616,"10":2617,"▁Gl":2618,"weiter":2619,"▁wirklich":2620,"AR":2621,"▁könnte":2622,"▁besonders":2623,"inen":2624,"ister":2625,"▁hatte":2626,"▁Mehr":2627,"zeug":2628,"▁Sol":2629,"riften":2630,"▁Ausschuss":2631,"▁aufge":2632,"hof":2633,"neten":2634,"tie":2635,"ße":2636,"▁Forsch":2637,"achten":2638,"▁Berichterstatter":2639,"▁Med":2640,"geord":2641,"▁Dat":2642,"▁gesam":2643,"▁verschiedenen":2644,"▁Situ":2645,"tem":2646,"▁ihnen":2647,"ima":2648,"▁entfernt":2649,"ubl":2650,"▁Grupp":2651,"rieben":2652,"▁Deb":2653,"▁Richtlinie":2654,"▁Ph":2655,"▁Funktion":2656,"▁hoch":2657,"▁Region":2658,"ip":2659,"weisen":2660,"genden":2661,"▁innerhalb":2662,"man":2663,"weit":2664,"ider":2665,"eint":2666,"▁dort":2667,"▁vielen":2668,"bung":2669,"reise":2670,"rifft":2671,"ST":2672,"▁Au":2673,"co":2674,"▁genau":2675,"▁weit":2676,"tive":2677,"▁Wasser":2678,"reund":2679,"werk":2680,"ersön":2681,"▁aktu":2682,"▁Deutsch":2683,"ichtet":2684,"▁Di":2685,"▁Rolle":2686,"dings":2687,"▁Ob":2688,"hm":2689,"indung":2690,"▁Artikel":2691,"▁Zwei":2692,"▁möchten":2693,"▁internationalen":2694,"esent":2695,"▁zwar":2696,"system":2697,"▁Grün":2698,"▁welt":2699,"zip":2700,"laub":2701,"▁di":2702,"▁Nutz":2703,"▁We":2704,"üd":2705,"igten":2706,"aut":2707,"zeitig":2708,"▁Ihren":2709,"▁Woch":2710,"sprache":2711,"ftware":2712,"▁ern":2713,"reifen":2714,"äu":2715,"▁techn":2716,"▁Disk":2717,"▁Verbrauch":2718,"▁Uhr":2719,"▁direkt":2720,"▁Fort":2721,"erien":2722,"▁bel":2723,"▁Fa":2724,"▁Rück":2725,"▁dür":2726,"▁führen":2727,"ph":2728,"▁hinaus":2729,"▁Wettbewerb":2730,"▁reg":2731,"▁�":2732,"stra":2733,"ive":2734,"eim":2735,"▁Ko":2736,"▁Alle":2737,"stens":2738,"änger":2739,"wär":2740,"one":2741,"▁Sk":2742,"ux":2743,"▁gewähr":2744,"▁USA":2745,"cen":2746,"reicht":2747,"▁Demokra":2748,"ären":2749,"ucht":2750,"spolitik":2751,"urg":2752,"▁europäische":2753,"▁Ap":2754,"▁klar":2755,"zimmer":2756,"ktionen":2757,"▁Restaurant":2758,"▁erste":2759,"ou":2760,"▁Pf":2761,"mäß":2762,"dition":2763,"opp":2764,"cher":2765,"haus":2766,"tegie":2767,"▁Sa":2768,"ilt":2769,"▁Kam":2770,"▁Vert":2771,"sichtlich":2772,"▁Meinung":2773,"▁y":2774,"rach":2775,"▁Gesundheit":2776,"uen":2777,"res":2778,"aff":2779,"sw":2780,"▁gl":2781,"merk":2782,"▁Fir":2783,"prä":2784,"stall":2785,"voll":2786,"uter":2787,"▁einzel":2788,"atte":2789,"▁Geschäfts":2790,"▁Preis":2791,"ußen":2792,"▁ra":2793,"onen":2794,"ase":2795,"▁Kultur":2796,"▁Hilfe":2797,"dustrie":2798,"▁Gleich":2799,"nit":2800,"unehmen":2801,"ring":2802,"beiten":2803,"▁Gesetz":2804,"ome":2805,"wohl":2806,"▁Zusammenhang":2807,"els":2808,"agement":2809,"▁unserem":2810,"▁Personen":2811,"zogen":2812,"▁hät":2813,"▁Abgeord":2814,"▁Lösung":2815,"▁Situation":2816,"▁Fest":2817,"▁Wor":2818,"urs":2819,"▁beiden":2820,"ativen":2821,"OR":2822,"▁u":2823,"reiche":2824,"▁30":2825,"▁kommt":2826,"angen":2827,"▁gar":2828,"asst":2829,"▁Entschließ":2830,"▁ä":2831,"achst":2832,"ologie":2833,"▁Partner":2834,"▁anges":2835,"▁Hotels":2836,"usätz":2837,"▁Kontro":2838,"▁tra":2839,"fang":2840,"▁entsprechen":2841,"▁Gäste":2842,"läge":2843,"▁finanz":2844,"▁z.":2845,"immt":2846,"tlich":2847,"▁Y":2848,"▁Dieses":2849,"weis":2850,"ym":2851,"teilung":2852,"▁Schluss":2853,"frei":2854,"▁Natur":2855,"▁Pol":2856,"▁Projekt":2857,"prü":2858,"ieten":2859,"▁Verantwort":2860,"▁empf":2861,"bet":2862,"reit":2863,"äuf":2864,"▁bestehen":2865,"▁begrü":2866,"ächst":2867,"ferenz":2868,"fassung":2869,"ierungen":2870,"▁bz":2871,"▁Produkte":2872,"alisierung":2873,"stad":2874,"baren":2875,"▁stellt":2876,"▁Präsidentin":2877,"ity":2878,"▁Ser":2879,"▁Dienstleist":2880,"▁Op":2881,"ool":2882,"▁ro":2883,"▁Groß":2884,"▁Software":2885,"▁bringen":2886,"▁Ort":2887,"▁Con":2888,"setzen":2889,"vorsch":2890,"▁verbesser":2891,"▁Kosten":2892,"stehen":2893,"▁daran":2894,"ore":2895,"reiben":2896,"av":2897,"com":2898,"▁Met":2899,"▁Deshalb":2900,"▁bzw.":2901,"▁Deutschland":2902,"▁etwa":2903,"annten":2904,"▁stär":2905,"▁Institu":2906,"ND":2907,"oc":2908,"▁bitte":2909,"▁versuch":2910,"▁gilt":2911,"▁weniger":2912,"▁2009":2913,"achstum":2914,"forderungen":2915,"▁wahr":2916,"ählen":2917,"line":2918,"▁Ange":2919,"▁jeden":2920,"üb":2921,"arbei":2922,"▁gesagt":2923,"▁kosten":2924,"▁Terr":2925,"spl":2926,"liches":2927,"▁Kü":2928,"▁gute":2929,"▁Son":2930,"ämlich":2931,"frage":2932,"einander":2933,"leg":2934,"▁persön":2935,"yn":2936,"▁ja":2937,"▁nämlich":2938,"▁Erfahr":2939,"sor":2940,"▁erw":2941,"uld":2942,"gegen":2943,"abhäng":2944,"▁Verfahren":2945,"▁Gren":2946,"s-":2947,"▁indem":2948,"▁Mal":2949,"▁entscheiden":2950,"▁Fil":2951,"sol":2952,"▁Millionen":2953,"wendet":2954,"ritten":2955,"▁sogar":2956,"▁kurz":2957,"sver":2958,"▁nehmen":2959,"124":2960,"▁Geld":2961,"ände":2962,"lüs":2963,"stimmt":2964,"▁abge":2965,"▁gerade":2966,"eits":2967,"▁erfolg":2968,"▁Zugang":2969,"ielleicht":2970,"▁&#124":2971,"▁&#124;":2972,"▁Bus":2973,"icken":2974,"▁Europas":2975,"als":2976,"▁Weiter":2977,"▁Punkt":2978,"iesen":2979,"hunder":2980,"osition":2981,"▁verm":2982,"rotz":2983,"▁erwar":2984,"anst":2985,"▁Rates":2986,"stadt":2987,"▁Verw":2988,"▁ersch":2989,"staat":2990,"▁Tür":2991,"▁Neu":2992,"▁aut":2993,"▁ebenfalls":2994,"▁ak":2995,"▁Dank":2996,"ächlich":2997,"▁Früh":2998,"▁unver":2999,"ember":3000,"▁Unsere":3001,"▁Eigen":3002,"▁ihn":3003,"erik":3004,"gän":3005,"ennen":3006,"▁unterschied":3007,"völker":3008,"▁Service":3009,"EN":3010,"▁Kap":3011,"ünd":3012,"▁erz":3013,"▁Invest":3014,"▁Dieser":3015,"▁Entwicklungs":3016,"anzen":3017,"SC":3018,"▁hoh":3019,"▁Organis":3020,"▁meisten":3021,"▁con":3022,"▁ir":3023,"▁gemacht":3024,"zustellen":3025,"fä":3026,"▁Verhand":3027,"rachten":3028,"arbeiten":3029,"▁Ebene":3030,"▁politische":3031,"arm":3032,"▁versch":3033,"▁Angeb":3034,"rigen":3035,"▁Transp":3036,"utet":3037,"ure":3038,"▁darf":3039,"▁ihm":3040,"▁Aussprache":3041,"▁verbunden":3042,"sionen":3043,"▁seinem":3044,"▁Bau":3045,"▁Leist":3046,"▁th":3047,"ktor":3048,"ote":3049,"▁Bezug":3050,"▁Nicht":3051,"▁Du":3052,"▁Jahres":3053,"▁gehen":3054,"tragen":3055,"▁Tats":3056,"duz":3057,"▁ma":3058,"ec":3059,"▁unterstützt":3060,"▁allgem":3061,"istor":3062,"▁dessen":3063,"▁get":3064,"▁wesent":3065,"onds":3066,"vi":3067,"ans":3068,"▁Klima":3069,"isches":3070,"nete":3071,"▁Produktion":3072,"▁Initi":3073,"▁Bel":3074,"gebung":3075,"▁nah":3076,"▁Pal":3077,"verkehr":3078,"▁Abstimmung":3079,"▁Gra":3080,"▁16":3081,"prochen":3082,"zer":3083,"ka":3084,"kung":3085,"ette":3086,"itzen":3087,"▁darin":3088,"▁Sozial":3089,"site":3090,"ys":3091,"schein":3092,"▁glaube":3093,"omati":3094,"▁Rechte":3095,"▁Verkehr":3096,"fin":3097,"▁dürfen":3098,"▁gern":3099,"tin":3100,"▁Gesellschaft":3101,"burg":3102,"▁anzu":3103,"▁Netz":3104,"llt":3105,"unst":3106,"leben":3107,"▁Benutz":3108,"▁modern":3109,"nov":3110,"▁Hö":3111,"▁öffentlichen":3112,"▁einigen":3113,"▁nichts":3114,"▁Meer":3115,"▁Mär":3116,"▁schaffen":3117,"▁Abkommen":3118,"fa":3119,"li":3120,"▁eh":3121,"ähe":3122,"ets":3123,"ühren":3124,"▁brauchen":3125,"▁Verbraucher":3126,"▁Buch":3127,"ogra":3128,"eigt":3129,"▁sollen":3130,"▁Beschäf":3131,"ator":3132,"▁San":3133,"▁14":3134,"wahl":3135,"iere":3136,"nehmer":3137,"ähigkeit":3138,"▁Tour":3139,"alte":3140,"▁ihrem":3141,"▁keinen":3142,"▁spezie":3143,"▁nationalen":3144,"▁op":3145,"▁Wissen":3146,"hl":3147,"▁Ta":3148,"▁Kolleg":3149,"unkte":3150,"gor":3151,"▁handelt":3152,"bare":3153,"▁posi":3154,"tis":3155,"▁25":3156,"▁Dok":3157,"schließlich":3158,"▁zusätz":3159,"1.":3160,"▁Industrie":3161,"▁bekannt":3162,"▁Jahrhunder":3163,"eider":3164,"utzt":3165,"möglich":3166,"▁Bas":3167,"ret":3168,"ame":3169,"to":3170,"ckt":3171,"▁Strategie":3172,"auer":3173,"ziehen":3174,"unächst":3175,"omfort":3176,"zus":3177,"▁1.":3178,"▁betrifft":3179,"iges":3180,"▁Produkt":3181,".com":3182,"spiels":3183,"▁Website":3184,"▁weiterhin":3185,"▁aktiv":3186,"iff":3187,"▁Je":3188,"äter":3189,"durch":3190,"tim":3191,"▁Fortsch":3192,"▁17":3193,"▁schwer":3194,"tag":3195,"▁Frank":3196,"▁sei":3197,"red":3198,"▁umfassen":3199,"handel":3200,"▁heraus":3201,"ari":3202,"▁leben":3203,"▁Bem":3204,"▁benö":3205,"spruch":3206,"▁Fischer":3207,"ance":3208,"▁schließ":3209,"▁Instr":3210,"▁Raum":3211,"▁tä":3212,"emen":3213,"▁bedeutet":3214,"▁deshalb":3215,"rieg":3216,"zeichnet":3217,"▁wenig":3218,"▁macht":3219,"▁X":3220,"▁erklär":3221,"▁Fot":3222,"▁Besuch":3223,"▁besten":3224,"▁einger":3225,"▁Standard":3226,"▁solche":3227,"▁priv":3228,"▁Gener":3229,"liegen":3230,"drück":3231,"spielsweise":3232,"▁Absch":3233,"▁deutlich":3234,"▁Bezieh":3235,"▁Mail":3236,"mals":3237,"▁unbe":3238,"por":3239,"▁end":3240,"gelegt":3241,"▁se":3242,"▁interess":3243,"dien":3244,"stück":3245,"▁at":3246,"anten":3247,"▁wichtige":3248,"züglich":3249,"▁Gebiet":3250,"▁klein":3251,"▁Ergebnis":3252,"▁Ide":3253,"maß":3254,"geschlagen":3255,"sehen":3256,"▁aufgrund":3257,"cke":3258,"▁Comp":3259,"ichtigen":3260,"ilit":3261,"▁würden":3262,"ublik":3263,"scht":3264,"▁oft":3265,"zlich":3266,"achsen":3267,"▁Von":3268,"reiten":3269,"zept":3270,"▁findet":3271,"▁hel":3272,"▁Menschenrechte":3273,"▁Ansicht":3274,"▁schön":3275,"▁grund":3276,"▁Umsetzung":3277,"rop":3278,"▁Port":3279,"▁Feh":3280,"reg":3281,"▁Bevölker":3282,"rinzip":3283,"▁Richtung":3284,"▁Inte":3285,"▁Insel":3286,"▁Per":3287,"▁Verbesser":3288,"bel":3289,"örden":3290,"▁Demokratie":3291,"▁Gol":3292,"▁Steuer":3293,"▁Asp":3294,"▁nächsten":3295,"▁Is":3296,"▁Förder":3297,"▁lä":3298,"▁Außen":3299,"▁fr":3300,"▁Wert":3301,"▁nutzen":3302,"▁Beg":3303,"eten":3304,"▁Empf":3305,"▁Nähe":3306,"▁Kunst":3307,"▁Prozess":3308,"▁It":3309,"▁Struktur":3310,"▁Anwendung":3311,"▁Herren":3312,"haltung":3313,"▁Park":3314,"▁Ju":3315,"▁13":3316,"▁Haushalts":3317,"▁prä":3318,"▁konk":3319,"▁Musik":3320,"▁üb":3321,"umente":3322,"▁Sh":3323,"vent":3324,"▁Fern":3325,"▁Druck":3326,"ürd":3327,"ffizien":3328,"▁allerdings":3329,"erst":3330,"▁fort":3331,"jen":3332,"ue":3333,"▁Kat":3334,"▁Verantwortung":3335,"▁hoffe":3336,"alien":3337,"verständ":3338,"▁Vers":3339,"▁inte":3340,"richtung":3341,"port":3342,"▁Ziele":3343,"frist":3344,"▁Plan":3345,"bend":3346,"▁vier":3347,"▁Bedingungen":3348,"ali":3349,"▁Selbst":3350,"iten":3351,"▁zie":3352,"▁par":3353,"▁Entscheidung":3354,"▁beispielsweise":3355,"bo":3356,"lauf":3357,"▁”":3358,"▁Viel":3359,"merksam":3360,"▁Aktiv":3361,"folgt":3362,"▁gegeben":3363,"▁Tages":3364,"▁gemeinsamen":3365,"▁stimm":3366,"▁Vorschläge":3367,"▁2010":3368,"▁histor":3369,"▁notwendig":3370,"wirkungen":3371,"▁Einz":3372,"▁jewei":3373,"ül":3374,"platz":3375,"▁gehört":3376,"able":3377,"▁zentr":3378,"grupp":3379,"▁Bek":3380,"▁Uni":3381,"▁ide":3382,"▁Interesse":3383,"▁Erweiter":3384,"▁arbeiten":3385,"▁kleinen":3386,"aussch":3387,"▁Wachstum":3388,"▁inform":3389,"▁ö":3390,"▁Erfolg":3391,"▁dank":3392,"▁Grundlage":3393,"▁2008":3394,"ress":3395,"▁Ihrem":3396,"▁Einsatz":3397,"▁prof":3398,"▁Reihe":3399,"▁verwendet":3400,"▁vielleicht":3401,"▁demokra":3402,"linien":3403,"▁wohl":3404,"llig":3405,"▁enthalten":3406,"▁Wieder":3407,"▁us":3408,"▁Wort":3409,"ategor":3410,"▁sprechen":3411,"▁ermöglich":3412,"▁Text":3413,"▁Angelegen":3414,"▁Den":3415,"resse":3416,"▁Daher":3417,"gern":3418,"▁sozialen":3419,"▁50":3420,"det":3421,"▁Pri":3422,"▁Version":3423,"▁bevor":3424,"ock":3425,"greifen":3426,"▁Außer":3427,"▁Br":3428,"▁Möglichkeiten":3429,"▁Geschichte":3430,"▁jen":3431,"pflicht":3432,"▁Frieden":3433,"▁erreicht":3434,"ehm":3435,"sph":3436,"▁ne":3437,"eitung":3438,"arf":3439,"▁werde":3440,"▁glob":3441,"laden":3442,"llung":3443,"▁halten":3444,"▁Prä":3445,"▁berücks":3446,"fik":3447,"arbeitung":3448,"a.":3449,"▁Debatte":3450,"assi":3451,"▁Heraus":3452,"par":3453,"▁Erklär":3454,"▁Vort":3455,"teilt":3456,"AN":3457,"▁erfü":3458,"aden":3459,"▁Kön":3460,"▁Institutionen":3461,"▁kompl":3462,"ätzen":3463,"▁Schul":3464,"ekten":3465,"struktur":3466,"▁übern":3467,"▁Öff":3468,"▁Damen":3469,"r.":3470,"geln":3471,"▁Blick":3472,"▁Bil":3473,"elegen":3474,"stellungen":3475,"scher":3476,"▁Luft":3477,"▁heiß":3478,"stimmungen":3479,"▁Forschung":3480,"▁’":3481,"fung":3482,"▁bleiben":3483,"▁Russ":3484,"zeigt":3485,"▁100":3486,"eta":3487,"reten":3488,"▁Einw":3489,"▁Hoch":3490,"▁Zentrum":3491,"▁höch":3492,"arbeiter":3493,"ement":3494,"läss":3495,"▁verschiedene":3496,"▁vorgeschlagen":3497,"lassen":3498,"▁App":3499,"ehn":3500,"bildung":3501,"▁ru":3502,"▁Minuten":3503,"▁weiß":3504,"▁funktion":3505,"abilität":3506,"folgen":3507,"terial":3508,"▁Sport":3509,"▁Mitglieder":3510,"▁Gi":3511,"▁schwier":3512,"▁Kraft":3513,"▁verfügt":3514,"▁Platz":3515,"▁On":3516,"▁fünf":3517,"ith":3518,"▁könnten":3519,"▁km":3520,"▁China":3521,"▁gemeinsame":3522,"inge":3523,"▁Diskus":3524,"mitteln":3525,"▁Hinblick":3526,"atten":3527,"gesehen":3528,"▁Dienstleistungen":3529,"▁ermöglicht":3530,"äum":3531,"▁Spe":3532,"▁Nation":3533,"statt":3534,"stattet":3535,"▁schrift":3536,"teg":3537,"▁Kommun":3538,"▁weltweit":3539,"▁Änderungsantrag":3540,"▁Arbeitspl":3541,"▁Pak":3542,"▁24":3543,"str":3544,"ungsver":3545,"▁New":3546,"annte":3547,"▁Priv":3548,"stitu":3549,"up":3550,"ante":3551,"produ":3552,"istischen":3553,"▁Fre":3554,"usst":3555,"STAR":3556,"wegen":3557,"elten":3558,"▁Mode":3559,"▁Investi":3560,"▁lange":3561,"▁Auswirkungen":3562,"ott":3563,"▁gelten":3564,"▁tran":3565,"▁vollständ":3566,"▁tats":3567,"▁zeigt":3568,"sbe":3569,"▁##STAR":3570,"▁##STAR##":3571,"tiven":3572,"▁hatten":3573,"▁Dial":3574,"▁Cl":3575,"▁Voraus":3576,"▁bisher":3577,"▁erforderlich":3578,"▁Regionen":3579,"▁äußer":3580,"bank":3581,"▁Ausdruck":3582,"▁2007":3583,"jenigen":3584,"▁danken":3585,"▁Verhandlungen":3586,"▁führt":3587,"▁bem":3588,"▁Tatsache":3589,"ektor":3590,"▁Schritt":3591,"langen":3592,"verb":3593,"▁Seit":3594,"ünschen":3595,"▁Süd":3596,"ösen":3597,"▁Gar":3598,"ählt":3599,"ession":3600,"▁Interessen":3601,"divi":3602,"▁gesamten":3603,"▁Familien":3604,"rimin":3605,"▁Wohn":3606,"▁Wind":3607,"▁Pla":3608,"nitt":3609,"▁wirtschaftlichen":3610,"▁angeb":3611,"echsel":3612,"dividu":3613,"▁Kolleginnen":3614,"▁einzelnen":3615,"dung":3616,"▁Doch":3617,"▁darum":3618,"▁Binnen":3619,"ßt":3620,"▁fast":3621,"▁ebenso":3622,"▁Liste":3623,"▁Abgeordneten":3624,"uni":3625,"des":3626,"ont":3627,"▁Nie":3628,"▁2000":3629,"▁Landes":3630,"▁entwickelt":3631,"▁gleichzeitig":3632,"isierung":3633,"▁später":3634,"öglichen":3635,"▁Werk":3636,"▁denke":3637,"▁Antwort":3638,"▁Gruppe":3639,"ober":3640,"▁Prof":3641,"auber":3642,"▁Außerdem":3643,"▁angenommen":3644,"ollen":3645,"ämpfung":3646,"ight":3647,"barkeit":3648,"▁Währ":3649,"räsidenten":3650,"▁Änderungsanträge":3651,"anische":3652,"▁Fä":3653,"geschlossen":3654,"▁Einzel":3655,"ino":3656,"ORE":3657,"▁disk":3658,"▁Stimm":3659,"▁Staats":3660,"▁star":3661,"▁verein":3662,"ändert":3663,"▁Verl":3664,"urf":3665,"▁Türk":3666,"ens":3667,"▁jedem":3668,"▁Univers":3669,"omb":3670,"▁Webs":3671,"reisen":3672,"bahn":3673,"▁Erw":3674,"▁Bereichen":3675,"▁einzu":3676,"▁Führ":3677,"▁Betrieb":3678,"▁internationale":3679,"arbeitet":3680,"ings":3681,"▁befinden":3682,"B.":3683,"trauen":3684,"inter":3685,"▁Gelegen":3686,"▁Ris":3687,"▁Zum":3688,"▁Denn":3689,"▁liegen":3690,"ießen":3691,"ländern":3692,"ingen":3693,"▁hätte":3694,"NDER":3695,"arität":3696,"▁konnte":3697,"abel":3698,"▁res":3699,"▁Bevölkerung":3700,"▁setzen":3701,"▁erwäh":3702,"ügen":3703,"fon":3704,"▁War":3705,"iellen":3706,"▁neben":3707,"▁Beziehungen":3708,"ly":3709,"▁Vide":3710,"IN":3711,"aly":3712,"▁Stu":3713,"▁Erweiterung":3714,"fel":3715,"own":3716,"steller":3717,"▁weiteren":3718,"▁Internation":3719,"ches":3720,"▁fa":3721,"ordin":3722,"edig":3723,"programm":3724,"griff":3725,"▁Angebot":3726,"wischen":3727,"▁bedeuten":3728,"▁Russland":3729,"met":3730,"▁Vereinigten":3731,"renz":3732,"▁Verbindung":3733,"▁erhö":3734,"zentrum":3735,"▁heißt":3736,"▁00":3737,"▁Nord":3738,"▁Themen":3739,"▁Best":3740,"ose":3741,"▁z.B.":3742,"▁Dialog":3743,"▁folgen":3744,"▁Terror":3745,"folge":3746,"▁eff":3747,"▁richtig":3748,"andeln":3749,"▁Fuß":3750,"▁jede":3751,"▁hinter":3752,"▁Team":3753,"▁Schlussel":3754,"ienen":3755,"ommer":3756,"andlung":3757,"▁helfen":3758,"▁Verordnung":3759,"▁Beitrag":3760,"▁erhe":3761,"▁Aufgabe":3762,"▁ur":3763,"richtungen":3764,"▁vö":3765,"sitz":3766,"etten":3767,"▁kleine":3768,"ichtigt":3769,"▁vers":3770,"▁rund":3771,"▁Char":3772,"alter":3773,"▁UN":3774,"▁Eng":3775,"▁Türkei":3776,"▁Verpflicht":3777,"UNDER":3778,"inner":3779,"jahr":3780,"▁gegenwär":3781,"▁Reise":3782,"▁Kop":3783,"denken":3784,"iken":3785,"▁Förderung":3786,"tember":3787,"ix":3788,"▁meinen":3789,"▁beit":3790,"▁Kampf":3791,"▁wichtigen":3792,"▁gestellt":3793,"▁Geh":3794,"▁Prot":3795,"ca":3796,"▁unseres":3797,"▁Kontrolle":3798,"enthalt":3799,"▁Krise":3800,"▁prak":3801,"affung":3802,"plan":3803,"isse":3804,"UNDERSC":3805,"halte":3806,"flä":3807,"▁##UNDERSC":3808,"ORE##":3809,"▁##UNDERSCORE##":3810,"▁Mitarbeiter":3811,"ums":3812,"anzös":3813,"dr":3814,"▁+":3815,"▁gestimmt":3816,"▁Ru":3817,"formen":3818,"▁rel":3819,"teilen":3820,"orn":3821,"▁Beitritt":3822,"▁Chr":3823,"haft":3824,"länder":3825,"anien":3826,"▁Arch":3827,"ult":3828,"eichen":3829,"gangenen":3830,"asser":3831,"▁jedes":3832,"worten":3833,"▁auszu":3834,"tens":3835,"ution":3836,"20":3837,"fragen":3838,"echs":3839,"▁Entschließung":3840,"äus":3841,"▁gab":3842,"zunehmen":3843,"▁freu":3844,"▁bekommen":3845,"▁automati":3846,"rachen":3847,"▁Volk":3848,"▁bleibt":3849,"zess":3850,"▁Behörden":3851,"enten":3852,"▁organis":3853,"▁wegen":3854,"▁Strand":3855,"eller":3856,"▁bas":3857,"▁Nutzung":3858,"hafen":3859,"▁Ausschusses":3860,"▁Bahn":3861,"▁Kar":3862,"▁Ka":3863,"echt":3864,"▁region":3865,"▁Benutzer":3866,"▁gro":3867,"▁nahe":3868,"▁Rom":3869,"abon":3870,"ilitär":3871,"▁Staat":3872,"▁angem":3873,"▁Damit":3874,"▁gra":3875,"▁spezi":3876,"▁wunder":3877,"▁Kir":3878,"▁Lösungen":3879,"ehlen":3880,"▁durchge":3881,"th":3882,"rägt":3883,"▁Information":3884,"stoff":3885,"▁gerne":3886,"pflich":3887,"▁Design":3888,"▁Augen":3889,"zentr":3890,"▁Urlaub":3891,"▁unabhäng":3892,"grün":3893,"▁Liss":3894,"▁Bef":3895,"igar":3896,"▁Stunden":3897,"fahrt":3898,"▁Bitte":3899,"▁erf":3900,"▁verantwort":3901,"öst":3902,"▁Sicherheits":3903,"▁Lissabon":3904,"▁stra":3905,"▁Wochen":3906,"ry":3907,"▁Macht":3908,"▁Veranst":3909,"▁wichtigsten":3910,"▁gelegen":3911,"ördern":3912,"CH":3913,"▁Auswahl":3914,"▁Hol":3915,"▁2006":3916,"▁akzep":3917,"orm":3918,"▁lok":3919,"onnen":3920,"▁kultur":3921,"▁Rep":3922,"▁mehrere":3923,"fäl":3924,"▁Jan":3925,"gn":3926,"gration":3927,"▁Frankreich":3928,"ssystem":3929,"vention":3930,"stru":3931,"zeugen":3932,"jähr":3933,"terne":3934,"ennung":3935,"▁abzu":3936,"▁2.":3937,"spräsident":3938,"▁vorh":3939,"▁Forder":3940,"▁Notwend":3941,"obei":3942,"nissen":3943,"roffen":3944,"gliche":3945,"ielle":3946,"▁Verbesserung":3947,"gesamt":3948,"tiger":3949,"▁enthält":3950,"▁ganze":3951,"▁amerik":3952,"▁ganzen":3953,"▁Berlin":3954,"▁Zur":3955,"nehm":3956,"▁Juni":3957,"▁hinsichtlich":3958,"▁Kern":3959,"▁nachhal":3960,"▁Binnenmarkt":3961,"öhn":3962,"▁Tex":3963,"▁wobei":3964,"▁ermöglichen":3965,"ilf":3966,"▁sag":3967,"▁ausgew":3968,"▁Fischerei":3969,"▁Gast":3970,"schließend":3971,"▁Anst":3972,"▁Aktion":3973,"▁Air":3974,"▁Such":3975,"stag":3976,"ivil":3977,"▁geeig":3978,"▁bil":3979,"▁Fach":3980,"sa":3981,"▁Anfang":3982,"▁stark":3983,"rechend":3984,"inne":3985,"aufen":3986,"▁Konferenz":3987,"▁Vis":3988,"▁überw":3989,"▁zeigen":3990,"feld":3991,"sy":3992,"▁Schwei":3993,"▁erlau":3994,"tete":3995,"▁Gelegenheit":3996,"▁Gu":3997,"▁belie":3998,"▁Amer":3999,"▁Dir":4000,"geh":4001,"▁derzeit":4002,"erweise":4003,"▁trotz":4004,"wertungen":4005,"▁Aufenthalt":4006,"▁Nov":4007,"ringt":4008,"▁tradition":4009,"▁Ferien":4010,"▁Sal":4011,"▁Reform":4012,"▁ruh":4013,"▁herr":4014,"▁Kor":4015,"takt":4016,"bringen":4017,"▁Nacht":4018,"künf":4019,"pen":4020,"▁irgend":4021,"▁Far":4022,"wurf":4023,"▁Rad":4024,"▁garan":4025,"▁Schaffung":4026,"leistet":4027,"▁Gewalt":4028,"standen":4029,"▁mus":4030,"serv":4031,"nern":4032,"▁Liefer":4033,"deu":4034,"oper":4035,"änden":4036,"kennen":4037,"▁Ergebnisse":4038,"▁heu":4039,"▁Ober":4040,"▁spielen":4041,"▁11":4042,"▁Darüber":4043,"vorschriften":4044,"ausch":4045,"akter":4046,"ingt":4047,"ützen":4048,"stelle":4049,".000":4050,"▁völlig":4051,"▁Fehler":4052,"▁Verwendung":4053,"sterreich":4054,"▁Vertre":4055,"▁Integration":4056,"ürf":4057,"▁erk":4058,"▁He":4059,"splan":4060,"▁Bal":4061,"▁with":4062,"▁Jugend":4063,"▁Herzen":4064,"▁Tage":4065,"▁Woche":4066,"▁integr":4067,"▁individu":4068,"▁verbessern":4069,"▁Anzahl":4070,"▁Ak":4071,"▁Landwirtschaft":4072,"▁Krieg":4073,"▁Pra":4074,"▁Prior":4075,"▁Wein":4076,"mut":4077,"ct":4078,"ments":4079,"▁Italien":4080,"ness":4081,"ätigkeit":4082,"▁198":4083,"▁verwenden":4084,"tliche":4085,"▁guten":4086,"▁lässt":4087,"▁Sit":4088,"▁eigene":4089,"ona":4090,"sprechen":4091,"▁geschlossen":4092,"führen":4093,"▁verfügen":4094,"örper":4095,"klus":4096,"▁su":4097,"wand":4098,"▁Notwendigkeit":4099,"fordert":4100,"▁großer":4101,"ähn":4102,"▁Zeitpunkt":4103,"▁Schl":4104,"sphäre":4105,"▁Ti":4106,"ON":4107,"▁gefähr":4108,"▁soziale":4109,"sei":4110,"▁häuf":4111,"▁verfüg":4112,"cc":4113,"za":4114,"▁König":4115,"▁Minister":4116,"▁Lauf":4117,"here":4118,"ernen":4119,"▁Familie":4120,"▁meinem":4121,"ikation":4122,"▁disku":4123,"▁Zwe":4124,"griffen":4125,"verständlich":4126,"gren":4127,"▁Les":4128,"▁Änderungen":4129,"▁zunächst":4130,"ana":4131,"▁künf":4132,"▁Gipf":4133,"reibung":4134,"ourcen":4135,"eister":4136,"▁gesamte":4137,"▁gehören":4138,"ins":4139,"sprogramm":4140,"▁pl":4141,"▁Volks":4142,"▁fördern":4143,"▁Stud":4144,"▁Erfahrung":4145,"aar":4146,"schinen":4147,"▁Män":4148,"▁Überein":4149,"▁Beschäftigung":4150,"▁hotel":4151,"einer":4152,"▁Hinter":4153,"▁gleichen":4154,"▁vorhanden":4155,"▁Mai":4156,"mäßig":4157,"▁ständ":4158,"▁angemessen":4159,"ichtige":4160,"techn":4161,"sent":4162,"▁Wahr":4163,"▁Nieder":4164,"▁Neben":4165,"▁Umgebung":4166,"▁tatsächlich":4167,"▁sorgen":4168,"leisten":4169,"▁Kn":4170,"öffnet":4171,"▁schriftlich":4172,"ediglich":4173,"ales":4174,"eilen":4175,"▁eindeu":4176,"troll":4177,"▁Mehrheit":4178,"stre":4179,"▁23":4180,"▁Sep":4181,"minister":4182,"▁Dab":4183,"▁absol":4184,"zeugt":4185,"▁Einführung":4186,"▁veröffent":4187,"stitution":4188,"▁wider":4189,"▁Regierungen":4190,"▁Während":4191,"part":4192,"▁Online":4193,"▁verstär":4194,"bedingungen":4195,"▁Stellung":4196,"▁40":4197,"gef":4198,"▁geführt":4199,"▁Konfl":4200,"erseits":4201,"▁Sc":4202,"maßnahmen":4203,"okoll":4204,"▁Dabei":4205,"ood":4206,"▁Imm":4207,