<?xml version="1.0" ?>
<net name="icv-pedestrian-detection-mobilenet-ssd-v2.0" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,384,672" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_1103419631" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_mul_1103419631"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data/scale/Fused_Mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_1103620264" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="4" size="12"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1103620264"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data/mean/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="16" size="3456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv1/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_1103911044" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3472" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1103911044"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv1/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="relu1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2_1/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3600" size="1152"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_1/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2_1/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_1/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_1104711052" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4752" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1104711052"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_1/dw/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_1/dw">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="relu2_1/dw" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu2_1/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_1/dw">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2_1/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="56, 32, 1, 1" offset="4880" size="7168"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_1/sep/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>56</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv2_1/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_1/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_1105511060" type="Const" version="opset1">
			<data element_type="f32" shape="1, 56, 1, 1" offset="12048" size="224"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1105511060"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_1/sep/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_1/sep">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="relu2_1/sep" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu2_1/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_1/sep">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv2_2/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="56, 1, 1, 3, 3" offset="12272" size="2016"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_2/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv2_2/dw" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_2/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="data_add_1106311068" type="Const" version="opset1">
			<data element_type="f32" shape="1, 56, 1, 1" offset="14288" size="224"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1106311068"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv2_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_2/dw/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_2/dw">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="relu2_2/dw" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu2_2/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_2/dw">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2_2/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="112, 56, 1, 1" offset="14512" size="25088"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_2/sep/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>112</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2_2/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_2/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>56</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_1107111076" type="Const" version="opset1">
			<data element_type="f32" shape="1, 112, 1, 1" offset="39600" size="448"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1107111076"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv2_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2_2/sep/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_2/sep">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="relu2_2/sep" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu2_2/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_2/sep">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv3_1/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="112, 1, 1, 3, 3" offset="40048" size="4032"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_1/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv3_1/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_1/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_add_1107911084" type="Const" version="opset1">
			<data element_type="f32" shape="1, 112, 1, 1" offset="44080" size="448"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1107911084"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv3_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_1/dw/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_1/dw">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="relu3_1/dw" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu3_1/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_1/dw">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv3_1/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 112, 1, 1" offset="44528" size="43008"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_1/sep/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv3_1/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_1/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="data_add_1108711092" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="87536" size="384"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1108711092"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv3_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_1/sep/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_1/sep">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="relu3_1/sep" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu3_1/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_1/sep">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv3_2/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="87920" size="3456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_2/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv3_2/dw" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_2/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="data_add_1109511100" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="91376" size="384"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1109511100"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv3_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_2/dw/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_2/dw">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="relu3_2/dw" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu3_2/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_2/dw">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv3_2/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="232, 96, 1, 1" offset="91760" size="89088"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_2/sep/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>232</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv3_2/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_2/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>232</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="data_add_1110311108" type="Const" version="opset1">
			<data element_type="f32" shape="1, 232, 1, 1" offset="180848" size="928"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1110311108"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv3_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv3_2/sep/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_2/sep">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="relu3_2/sep" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu3_2/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_2/sep">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv4_1/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="232, 1, 1, 3, 3" offset="181776" size="8352"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_1/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>232</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv4_1/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_1/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>232</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="data_add_1111111116" type="Const" version="opset1">
			<data element_type="f32" shape="1, 232, 1, 1" offset="190128" size="928"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1111111116"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv4_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_1/dw/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4_1/dw">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="relu4_1/dw" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu4_1/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4_1/dw">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv4_1/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="208, 232, 1, 1" offset="191056" size="193024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_1/sep/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>208</dim>
					<dim>232</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv4_1/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_1/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>208</dim>
					<dim>232</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="data_add_1111911124" type="Const" version="opset1">
			<data element_type="f32" shape="1, 208, 1, 1" offset="384080" size="832"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1111911124"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv4_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_1/sep/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4_1/sep">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="relu4_1/sep" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu4_1/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4_1/sep">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv4_2/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="208, 1, 1, 3, 3" offset="384912" size="7488"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_2/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv4_2/dw" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_2/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="data_add_1112711132" type="Const" version="opset1">
			<data element_type="f32" shape="1, 208, 1, 1" offset="392400" size="832"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1112711132"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv4_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_2/dw/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4_2/dw">
					<dim>1</dim>
					<dim>208</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="relu4_2/dw" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu4_2/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4_2/dw">
					<dim>1</dim>
					<dim>208</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv4_2/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="352, 208, 1, 1" offset="393232" size="292864"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_2/sep/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>352</dim>
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv4_2/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_2/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>208</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>352</dim>
					<dim>208</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_1113511140" type="Const" version="opset1">
			<data element_type="f32" shape="1, 352, 1, 1" offset="686096" size="1408"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1113511140"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv4_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv4_2/sep/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4_2/sep">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="relu4_2/sep" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu4_2/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4_2/sep">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv5_1/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="352, 1, 1, 3, 3" offset="687504" size="12672"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_1/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>352</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv5_1/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_1/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>352</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_1114311148" type="Const" version="opset1">
			<data element_type="f32" shape="1, 352, 1, 1" offset="700176" size="1408"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1114311148"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv5_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_1/dw/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_1/dw">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="relu5_1/dw" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu5_1/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_1/dw">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv5_1/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="320, 352, 1, 1" offset="701584" size="450560"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_1/sep/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>320</dim>
					<dim>352</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv5_1/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_1/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>352</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>352</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_add_1115111156" type="Const" version="opset1">
			<data element_type="f32" shape="1, 320, 1, 1" offset="1152144" size="1280"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1115111156"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv5_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_1/sep/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_1/sep">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="relu5_1/sep" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu5_1/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_1/sep">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv5_2/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="320, 1, 1, 3, 3" offset="1153424" size="11520"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_2/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv5_2/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_2/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="data_add_1115911164" type="Const" version="opset1">
			<data element_type="f32" shape="1, 320, 1, 1" offset="1164944" size="1280"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1115911164"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv5_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_2/dw/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_2/dw">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="relu5_2/dw" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu5_2/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_2/dw">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv5_2/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="296, 320, 1, 1" offset="1166224" size="378880"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_2/sep/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>296</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv5_2/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_2/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>296</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>296</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="data_add_1116711172" type="Const" version="opset1">
			<data element_type="f32" shape="1, 296, 1, 1" offset="1545104" size="1184"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_1116711172"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>296</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv5_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_2/sep/bn/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>296</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>296</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_2/sep">
					<dim>1</dim>
					<dim>296</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="relu5_2/sep" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu5_2/sep"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>296</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_2/sep">
					<dim>1</dim>
					<dim>296</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="conv5_3/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="296, 1, 1, 3, 3" offset="1546288" size="10656"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_3/dw/bn/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>296</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv5_3/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv5_3/dw"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>296</dim>
					<dim>24</dim>
