name: "RMNet_SSD"

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 1024
      dim: 1024
    }
  }
}

###################################################
############### Data normalization ################
###################################################

layer {
  name: "data_bn"
  type: "BatchNorm"
  bottom: "data"
  top: "data_bn"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
}
layer {
  name: "data_scale"
  type: "Scale"
  bottom: "data_bn"
  top: "data_bn"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 1.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv0"
  type: "Convolution"
  bottom: "data_bn"
  top: "conv0"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 3
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
      variance_norm: FAN_OUT
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv0_bn"
  type: "BatchNorm"
  bottom: "conv0"
  top: "conv0"
}
layer {
  name: "conv0_scale"
  type: "Scale"
  bottom: "conv0"
  top: "conv0"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 1.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv0_relu"
  type: "ReLU"
  bottom: "conv0"
  top: "conv0"
}


###################################################
##################### Backbone ####################
###################################################

layer {
  name: "init_block1/dim_inc/conv"
  type: "Convolution"
  bottom: "conv0"
  top: "init_block1/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "init_block1/dim_inc/bn"
  type: "BatchNorm"
  bottom: "init_block1/dim_inc/conv"
  top: "init_block1/dim_inc/conv"
}
layer {
  name: "init_block1/dim_inc/scale"
  type: "Scale"
  bottom: "init_block1/dim_inc/conv"
  top: "init_block1/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "init_block1/dim_inc/fn"
  type: "ReLU"
  bottom: "init_block1/dim_inc/conv"
  top: "init_block1/dim_inc/conv"
}
layer {
  name: "bottleneck1_1/dim_red/conv"
  type: "Convolution"
  bottom: "init_block1/dim_inc/conv"
  top: "bottleneck1_1/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_1/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_1/dim_red/conv"
  top: "bottleneck1_1/dim_red/conv"
}
layer {
  name: "bottleneck1_1/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck1_1/dim_red/conv"
  top: "bottleneck1_1/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_1/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck1_1/dim_red/conv"
  top: "bottleneck1_1/dim_red/conv"
}
layer {
  name: "bottleneck1_1/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck1_1/dim_red/conv"
  top: "bottleneck1_1/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 8
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_1/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_1/inner/dw1/conv"
  top: "bottleneck1_1/inner/dw1/conv"
}
layer {
  name: "bottleneck1_1/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck1_1/inner/dw1/conv"
  top: "bottleneck1_1/inner/dw1/conv"
  param {lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_1/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck1_1/inner/dw1/conv"
  top: "bottleneck1_1/inner/dw1/conv"
}
layer {
  name: "bottleneck1_1/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck1_1/inner/dw1/conv"
  top: "bottleneck1_1/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_1/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_1/dim_inc/conv"
  top: "bottleneck1_1/dim_inc/conv"
}
layer {
  name: "bottleneck1_1/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck1_1/dim_inc/conv"
  top: "bottleneck1_1/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_1/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck1_1/dim_inc/conv"
  top: "bottleneck1_1/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck1_1/add"
  type: "Eltwise"
  bottom: "init_block1/dim_inc/conv"
  bottom: "bottleneck1_1/dim_inc/conv"
  top: "bottleneck1_1/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck1_1/fn"
  type: "ELU"
  bottom: "bottleneck1_1/add"
  top: "bottleneck1_1/add"
}
layer {
  name: "bottleneck1_2/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck1_1/add"
  top: "bottleneck1_2/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_2/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_2/dim_red/conv"
  top: "bottleneck1_2/dim_red/conv"
}
layer {
  name: "bottleneck1_2/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck1_2/dim_red/conv"
  top: "bottleneck1_2/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_2/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck1_2/dim_red/conv"
  top: "bottleneck1_2/dim_red/conv"
}
layer {
  name: "bottleneck1_2/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck1_2/dim_red/conv"
  top: "bottleneck1_2/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 8
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_2/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_2/inner/dw1/conv"
  top: "bottleneck1_2/inner/dw1/conv"
}
layer {
  name: "bottleneck1_2/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck1_2/inner/dw1/conv"
  top: "bottleneck1_2/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_2/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck1_2/inner/dw1/conv"
  top: "bottleneck1_2/inner/dw1/conv"
}
layer {
  name: "bottleneck1_2/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck1_2/inner/dw1/conv"
  top: "bottleneck1_2/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_2/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_2/dim_inc/conv"
  top: "bottleneck1_2/dim_inc/conv"
}
layer {
  name: "bottleneck1_2/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck1_2/dim_inc/conv"
  top: "bottleneck1_2/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_2/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck1_2/dim_inc/conv"
  top: "bottleneck1_2/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck1_2/add"
  type: "Eltwise"
  bottom: "bottleneck1_1/add"
  bottom: "bottleneck1_2/dim_inc/conv"
  top: "bottleneck1_2/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck1_2/fn"
  type: "ELU"
  bottom: "bottleneck1_2/add"
  top: "bottleneck1_2/add"
}
layer {
  name: "bottleneck1_3/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck1_2/add"
  top: "bottleneck1_3/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_3/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_3/dim_red/conv"
  top: "bottleneck1_3/dim_red/conv"
}
layer {
  name: "bottleneck1_3/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck1_3/dim_red/conv"
  top: "bottleneck1_3/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_3/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck1_3/dim_red/conv"
  top: "bottleneck1_3/dim_red/conv"
}
layer {
  name: "bottleneck1_3/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck1_3/dim_red/conv"
  top: "bottleneck1_3/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 8
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_3/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_3/inner/dw1/conv"
  top: "bottleneck1_3/inner/dw1/conv"
}
layer {
  name: "bottleneck1_3/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck1_3/inner/dw1/conv"
  top: "bottleneck1_3/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_3/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck1_3/inner/dw1/conv"
  top: "bottleneck1_3/inner/dw1/conv"
}
layer {
  name: "bottleneck1_3/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck1_3/inner/dw1/conv"
  top: "bottleneck1_3/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_3/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_3/dim_inc/conv"
  top: "bottleneck1_3/dim_inc/conv"
}
layer {
  name: "bottleneck1_3/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck1_3/dim_inc/conv"
  top: "bottleneck1_3/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_3/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck1_3/dim_inc/conv"
  top: "bottleneck1_3/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck1_3/add"
  type: "Eltwise"
  bottom: "bottleneck1_2/add"
  bottom: "bottleneck1_3/dim_inc/conv"
  top: "bottleneck1_3/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck1_3/fn"
  type: "ELU"
  bottom: "bottleneck1_3/add"
  top: "bottleneck1_3/add"
}
layer {
  name: "bottleneck1_4/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck1_3/add"
  top: "bottleneck1_4/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_4/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_4/dim_red/conv"
  top: "bottleneck1_4/dim_red/conv"
}
layer {
  name: "bottleneck1_4/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck1_4/dim_red/conv"
  top: "bottleneck1_4/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_4/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck1_4/dim_red/conv"
  top: "bottleneck1_4/dim_red/conv"
}
layer {
  name: "bottleneck1_4/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck1_4/dim_red/conv"
  top: "bottleneck1_4/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 8
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_4/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_4/inner/dw1/conv"
  top: "bottleneck1_4/inner/dw1/conv"
}
layer {
  name: "bottleneck1_4/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck1_4/inner/dw1/conv"
  top: "bottleneck1_4/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_4/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck1_4/inner/dw1/conv"
  top: "bottleneck1_4/inner/dw1/conv"
}
layer {
  name: "bottleneck1_4/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck1_4/inner/dw1/conv"
  top: "bottleneck1_4/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck1_4/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck1_4/dim_inc/conv"
  top: "bottleneck1_4/dim_inc/conv"
}
layer {
  name: "bottleneck1_4/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck1_4/dim_inc/conv"
  top: "bottleneck1_4/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck1_4/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck1_4/dim_inc/conv"
  top: "bottleneck1_4/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck1_4/add"
  type: "Eltwise"
  bottom: "bottleneck1_3/add"
  bottom: "bottleneck1_4/dim_inc/conv"
  top: "bottleneck1_4/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck1_4/fn"
  type: "ELU"
  bottom: "bottleneck1_4/add"
  top: "bottleneck1_4/add"
}
layer {
  name: "bottleneck2_0/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck1_4/add"
  top: "bottleneck2_0/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_0/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_0/dim_red/conv"
  top: "bottleneck2_0/dim_red/conv"
}
layer {
  name: "bottleneck2_0/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_0/dim_red/conv"
  top: "bottleneck2_0/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_0/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_0/dim_red/conv"
  top: "bottleneck2_0/dim_red/conv"
}
layer {
  name: "bottleneck2_0/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_0/dim_red/conv"
  top: "bottleneck2_0/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_0/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_0/inner/dw1/conv"
  top: "bottleneck2_0/inner/dw1/conv"
}
layer {
  name: "bottleneck2_0/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_0/inner/dw1/conv"
  top: "bottleneck2_0/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_0/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_0/inner/dw1/conv"
  top: "bottleneck2_0/inner/dw1/conv"
}
layer {
  name: "bottleneck2_0/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_0/inner/dw1/conv"
  top: "bottleneck2_0/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_0/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_0/dim_inc/conv"
  top: "bottleneck2_0/dim_inc/conv"
}
layer {
  name: "bottleneck2_0/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_0/dim_inc/conv"
  top: "bottleneck2_0/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_0/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_0/dim_inc/conv"
  top: "bottleneck2_0/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_0/skip/pooling"
  type: "Pooling"
  bottom: "bottleneck1_4/add"
  top: "bottleneck2_0/skip/pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "bottleneck2_0/skip/conv"
  type: "Convolution"
  bottom: "bottleneck2_0/skip/pooling"
  top: "bottleneck2_0/skip/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_0/skip/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_0/skip/conv"
  top: "bottleneck2_0/skip/conv"
}
layer {
  name: "bottleneck2_0/skip/scale"
  type: "Scale"
  bottom: "bottleneck2_0/skip/conv"
  top: "bottleneck2_0/skip/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_0/add"
  type: "Eltwise"
  bottom: "bottleneck2_0/skip/conv"
  bottom: "bottleneck2_0/dim_inc/conv"
  top: "bottleneck2_0/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_0/fn"
  type: "ELU"
  bottom: "bottleneck2_0/add"
  top: "bottleneck2_0/add"
}
layer {
  name: "bottleneck2_1/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_0/add"
  top: "bottleneck2_1/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_1/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_1/dim_red/conv"
  top: "bottleneck2_1/dim_red/conv"
}
layer {
  name: "bottleneck2_1/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_1/dim_red/conv"
  top: "bottleneck2_1/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_1/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_1/dim_red/conv"
  top: "bottleneck2_1/dim_red/conv"
}
layer {
  name: "bottleneck2_1/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_1/dim_red/conv"
  top: "bottleneck2_1/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_1/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_1/inner/dw1/conv"
  top: "bottleneck2_1/inner/dw1/conv"
}
layer {
  name: "bottleneck2_1/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_1/inner/dw1/conv"
  top: "bottleneck2_1/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_1/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_1/inner/dw1/conv"
  top: "bottleneck2_1/inner/dw1/conv"
}
layer {
  name: "bottleneck2_1/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_1/inner/dw1/conv"
  top: "bottleneck2_1/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_1/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_1/dim_inc/conv"
  top: "bottleneck2_1/dim_inc/conv"
}
layer {
  name: "bottleneck2_1/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_1/dim_inc/conv"
  top: "bottleneck2_1/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_1/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_1/dim_inc/conv"
  top: "bottleneck2_1/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_1/add"
  type: "Eltwise"
  bottom: "bottleneck2_0/add"
  bottom: "bottleneck2_1/dim_inc/conv"
  top: "bottleneck2_1/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_1/fn"
  type: "ELU"
  bottom: "bottleneck2_1/add"
  top: "bottleneck2_1/add"
}
layer {
  name: "bottleneck2_2/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_1/add"
  top: "bottleneck2_2/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_2/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_2/dim_red/conv"
  top: "bottleneck2_2/dim_red/conv"
}
layer {
  name: "bottleneck2_2/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_2/dim_red/conv"
  top: "bottleneck2_2/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_2/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_2/dim_red/conv"
  top: "bottleneck2_2/dim_red/conv"
}
layer {
  name: "bottleneck2_2/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_2/dim_red/conv"
  top: "bottleneck2_2/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_2/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_2/inner/dw1/conv"
  top: "bottleneck2_2/inner/dw1/conv"
}
layer {
  name: "bottleneck2_2/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_2/inner/dw1/conv"
  top: "bottleneck2_2/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_2/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_2/inner/dw1/conv"
  top: "bottleneck2_2/inner/dw1/conv"
}
layer {
  name: "bottleneck2_2/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_2/inner/dw1/conv"
  top: "bottleneck2_2/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_2/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_2/dim_inc/conv"
  top: "bottleneck2_2/dim_inc/conv"
}
layer {
  name: "bottleneck2_2/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_2/dim_inc/conv"
  top: "bottleneck2_2/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_2/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_2/dim_inc/conv"
  top: "bottleneck2_2/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_2/add"
  type: "Eltwise"
  bottom: "bottleneck2_1/add"
  bottom: "bottleneck2_2/dim_inc/conv"
  top: "bottleneck2_2/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_2/fn"
  type: "ELU"
  bottom: "bottleneck2_2/add"
  top: "bottleneck2_2/add"
}
layer {
  name: "bottleneck2_3/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_2/add"
  top: "bottleneck2_3/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_3/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_3/dim_red/conv"
  top: "bottleneck2_3/dim_red/conv"
}
layer {
  name: "bottleneck2_3/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_3/dim_red/conv"
  top: "bottleneck2_3/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_3/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_3/dim_red/conv"
  top: "bottleneck2_3/dim_red/conv"
}
layer {
  name: "bottleneck2_3/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_3/dim_red/conv"
  top: "bottleneck2_3/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_3/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_3/inner/dw1/conv"
  top: "bottleneck2_3/inner/dw1/conv"
}
layer {
  name: "bottleneck2_3/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_3/inner/dw1/conv"
  top: "bottleneck2_3/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_3/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_3/inner/dw1/conv"
  top: "bottleneck2_3/inner/dw1/conv"
}
layer {
  name: "bottleneck2_3/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_3/inner/dw1/conv"
  top: "bottleneck2_3/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_3/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_3/dim_inc/conv"
  top: "bottleneck2_3/dim_inc/conv"
}
layer {
  name: "bottleneck2_3/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_3/dim_inc/conv"
  top: "bottleneck2_3/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_3/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_3/dim_inc/conv"
  top: "bottleneck2_3/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_3/add"
  type: "Eltwise"
  bottom: "bottleneck2_2/add"
  bottom: "bottleneck2_3/dim_inc/conv"
  top: "bottleneck2_3/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_3/fn"
  type: "ELU"
  bottom: "bottleneck2_3/add"
  top: "bottleneck2_3/add"
}
layer {
  name: "bottleneck2_4/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_3/add"
  top: "bottleneck2_4/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_4/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_4/dim_red/conv"
  top: "bottleneck2_4/dim_red/conv"
}
layer {
  name: "bottleneck2_4/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_4/dim_red/conv"
  top: "bottleneck2_4/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_4/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_4/dim_red/conv"
  top: "bottleneck2_4/dim_red/conv"
}
layer {
  name: "bottleneck2_4/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_4/dim_red/conv"
  top: "bottleneck2_4/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_4/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_4/inner/dw1/conv"
  top: "bottleneck2_4/inner/dw1/conv"
}
layer {
  name: "bottleneck2_4/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_4/inner/dw1/conv"
  top: "bottleneck2_4/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_4/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_4/inner/dw1/conv"
  top: "bottleneck2_4/inner/dw1/conv"
}
layer {
  name: "bottleneck2_4/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_4/inner/dw1/conv"
  top: "bottleneck2_4/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_4/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_4/dim_inc/conv"
  top: "bottleneck2_4/dim_inc/conv"
}
layer {
  name: "bottleneck2_4/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_4/dim_inc/conv"
  top: "bottleneck2_4/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_4/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_4/dim_inc/conv"
  top: "bottleneck2_4/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_4/add"
  type: "Eltwise"
  bottom: "bottleneck2_3/add"
  bottom: "bottleneck2_4/dim_inc/conv"
  top: "bottleneck2_4/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_4/fn"
  type: "ELU"
  bottom: "bottleneck2_4/add"
  top: "bottleneck2_4/add"
}
layer {
  name: "bottleneck2_5/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_4/add"
  top: "bottleneck2_5/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_5/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_5/dim_red/conv"
  top: "bottleneck2_5/dim_red/conv"
}
layer {
  name: "bottleneck2_5/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_5/dim_red/conv"
  top: "bottleneck2_5/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_5/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_5/dim_red/conv"
  top: "bottleneck2_5/dim_red/conv"
}
layer {
  name: "bottleneck2_5/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_5/dim_red/conv"
  top: "bottleneck2_5/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_5/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_5/inner/dw1/conv"
  top: "bottleneck2_5/inner/dw1/conv"
}
layer {
  name: "bottleneck2_5/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_5/inner/dw1/conv"
  top: "bottleneck2_5/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_5/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_5/inner/dw1/conv"
  top: "bottleneck2_5/inner/dw1/conv"
}
layer {
  name: "bottleneck2_5/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_5/inner/dw1/conv"
  top: "bottleneck2_5/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_5/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_5/dim_inc/conv"
  top: "bottleneck2_5/dim_inc/conv"
}
layer {
  name: "bottleneck2_5/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_5/dim_inc/conv"
  top: "bottleneck2_5/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_5/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_5/dim_inc/conv"
  top: "bottleneck2_5/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_5/add"
  type: "Eltwise"
  bottom: "bottleneck2_4/add"
  bottom: "bottleneck2_5/dim_inc/conv"
  top: "bottleneck2_5/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_5/fn"
  type: "ELU"
  bottom: "bottleneck2_5/add"
  top: "bottleneck2_5/add"
}
layer {
  name: "bottleneck2_6/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_5/add"
  top: "bottleneck2_6/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_6/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_6/dim_red/conv"
  top: "bottleneck2_6/dim_red/conv"
}
layer {
  name: "bottleneck2_6/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_6/dim_red/conv"
  top: "bottleneck2_6/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_6/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_6/dim_red/conv"
  top: "bottleneck2_6/dim_red/conv"
}
layer {
  name: "bottleneck2_6/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_6/dim_red/conv"
  top: "bottleneck2_6/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_6/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_6/inner/dw1/conv"
  top: "bottleneck2_6/inner/dw1/conv"
}
layer {
  name: "bottleneck2_6/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_6/inner/dw1/conv"
  top: "bottleneck2_6/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_6/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_6/inner/dw1/conv"
  top: "bottleneck2_6/inner/dw1/conv"
}
layer {
  name: "bottleneck2_6/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_6/inner/dw1/conv"
  top: "bottleneck2_6/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_6/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_6/dim_inc/conv"
  top: "bottleneck2_6/dim_inc/conv"
}
layer {
  name: "bottleneck2_6/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_6/dim_inc/conv"
  top: "bottleneck2_6/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_6/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_6/dim_inc/conv"
  top: "bottleneck2_6/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_6/add"
  type: "Eltwise"
  bottom: "bottleneck2_5/add"
  bottom: "bottleneck2_6/dim_inc/conv"
  top: "bottleneck2_6/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_6/fn"
  type: "ELU"
  bottom: "bottleneck2_6/add"
  top: "bottleneck2_6/add"
}
layer {
  name: "bottleneck2_7/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_6/add"
  top: "bottleneck2_7/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_7/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_7/dim_red/conv"
  top: "bottleneck2_7/dim_red/conv"
}
layer {
  name: "bottleneck2_7/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_7/dim_red/conv"
  top: "bottleneck2_7/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_7/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_7/dim_red/conv"
  top: "bottleneck2_7/dim_red/conv"
}
layer {
  name: "bottleneck2_7/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_7/dim_red/conv"
  top: "bottleneck2_7/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_7/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_7/inner/dw1/conv"
  top: "bottleneck2_7/inner/dw1/conv"
}
layer {
  name: "bottleneck2_7/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_7/inner/dw1/conv"
  top: "bottleneck2_7/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_7/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_7/inner/dw1/conv"
  top: "bottleneck2_7/inner/dw1/conv"
}
layer {
  name: "bottleneck2_7/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_7/inner/dw1/conv"
  top: "bottleneck2_7/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_7/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_7/dim_inc/conv"
  top: "bottleneck2_7/dim_inc/conv"
}
layer {
  name: "bottleneck2_7/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_7/dim_inc/conv"
  top: "bottleneck2_7/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_7/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_7/dim_inc/conv"
  top: "bottleneck2_7/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_7/add"
  type: "Eltwise"
  bottom: "bottleneck2_6/add"
  bottom: "bottleneck2_7/dim_inc/conv"
  top: "bottleneck2_7/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_7/fn"
  type: "ELU"
  bottom: "bottleneck2_7/add"
  top: "bottleneck2_7/add"
}
layer {
  name: "bottleneck2_8/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_7/add"
  top: "bottleneck2_8/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_8/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_8/dim_red/conv"
  top: "bottleneck2_8/dim_red/conv"
}
layer {
  name: "bottleneck2_8/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck2_8/dim_red/conv"
  top: "bottleneck2_8/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_8/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck2_8/dim_red/conv"
  top: "bottleneck2_8/dim_red/conv"
}
layer {
  name: "bottleneck2_8/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck2_8/dim_red/conv"
  top: "bottleneck2_8/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_8/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_8/inner/dw1/conv"
  top: "bottleneck2_8/inner/dw1/conv"
}
layer {
  name: "bottleneck2_8/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck2_8/inner/dw1/conv"
  top: "bottleneck2_8/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_8/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck2_8/inner/dw1/conv"
  top: "bottleneck2_8/inner/dw1/conv"
}
layer {
  name: "bottleneck2_8/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck2_8/inner/dw1/conv"
  top: "bottleneck2_8/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck2_8/dim_inc/bn"
  type: "BatchNorm"
  bottom: "bottleneck2_8/dim_inc/conv"
  top: "bottleneck2_8/dim_inc/conv"
}
layer {
  name: "bottleneck2_8/dim_inc/scale"
  type: "Scale"
  bottom: "bottleneck2_8/dim_inc/conv"
  top: "bottleneck2_8/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck2_8/dim_inc/dropout"
  type: "Dropout"
  bottom: "bottleneck2_8/dim_inc/conv"
  top: "bottleneck2_8/dim_inc/conv"
  dropout_param {
    dropout_ratio: 0.10000000149
  }
}
layer {
  name: "bottleneck2_8/add"
  type: "Eltwise"
  bottom: "bottleneck2_7/add"
  bottom: "bottleneck2_8/dim_inc/conv"
  top: "bottleneck2_8/add"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "bottleneck2_8/fn"
  type: "ELU"
  bottom: "bottleneck2_8/add"
  top: "bottleneck2_8/add"
}
layer {
  name: "bottleneck3_0/dim_red/conv"
  type: "Convolution"
  bottom: "bottleneck2_8/add"
  top: "bottleneck3_0/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck3_0/dim_red/bn"
  type: "BatchNorm"
  bottom: "bottleneck3_0/dim_red/conv"
  top: "bottleneck3_0/dim_red/conv"
}
layer {
  name: "bottleneck3_0/dim_red/scale"
  type: "Scale"
  bottom: "bottleneck3_0/dim_red/conv"
  top: "bottleneck3_0/dim_red/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck3_0/dim_red/fn"
  type: "ELU"
  bottom: "bottleneck3_0/dim_red/conv"
  top: "bottleneck3_0/dim_red/conv"
}
layer {
  name: "bottleneck3_0/inner/dw1/conv"
  type: "Convolution"
  bottom: "bottleneck3_0/dim_red/conv"
  top: "bottleneck3_0/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck3_0/inner/dw1/bn"
  type: "BatchNorm"
  bottom: "bottleneck3_0/inner/dw1/conv"
  top: "bottleneck3_0/inner/dw1/conv"
}
layer {
  name: "bottleneck3_0/inner/dw1/scale"
  type: "Scale"
  bottom: "bottleneck3_0/inner/dw1/conv"
  top: "bottleneck3_0/inner/dw1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  scale_param {
    axis: 1
    filler {
      value: 1.0
    }
    bias_term: true
    bias_filler {
      value: 0.0
    }
  }
}
layer {
  name: "bottleneck3_0/inner/dw1/fn"
  type: "ELU"
  bottom: "bottleneck3_0/inner/dw1/conv"
  top: "bottleneck3_0/inner/dw1/conv"
}
layer {
  name: "bottleneck3_0/dim_inc/conv"
  type: "Convolution"
  bottom: "bottleneck3_0/inner/dw1/conv"
  top: "bottleneck3_0/dim_inc/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "bottleneck3_0/dim_inc/bn"
