{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"#":6,"$":7,"%":8,"&":9,"(":10,")":11,"+":12,",":13,"-":14,".":15,"/":16,"0":17,"1":18,"2":19,"3":20,"4":21,"5":22,"6":23,"7":24,"8":25,"9":26,":":27,";":28,"=":29,"?":30,"A":31,"B":32,"C":33,"D":34,"E":35,"F":36,"G":37,"H":38,"I":39,"J":40,"K":41,"L":42,"M":43,"N":44,"O":45,"P":46,"Q":47,"R":48,"S":49,"T":50,"U":51,"V":52,"W":53,"X":54,"Y":55,"Z":56,"\\":57,"^":58,"a":59,"b":60,"c":61,"d":62,"e":63,"f":64,"g":65,"h":66,"i":67,"j":68,"k":69,"l":70,"m":71,"n":72,"o":73,"p":74,"q":75,"r":76,"s":77,"t":78,"u":79,"v":80,"w":81,"x":82,"y":83,"z":84,"{":85,"}":86,"~":87,"":88,"":89,"":90,"":91,"":92,"":93,"":94,"":95,"":96,"":97,"":98,"":99,"":100,"":101,"":102,"":103,"":104,"":105,"":106,"":107,"":108,"¡":109,"¢":110,"£":111,"¤":112,"¥":113,"¦":114,"§":115,"©":116,"«":117,"¬":118,"­":119,"®":120,"°":121,"±":122,"¶":123,"·":124,"»":125,"¿":126,"À":127,"Á":128,"Â":129,"Ã":130,"Ä":131,"Å":132,"Æ":133,"Ç":134,"È":135,"É":136,"Ê":137,"Ë":138,"Ì":139,"Í":140,"Î":141,"Ï":142,"Ð":143,"Ñ":144,"Ò":145,"Ó":146,"Ô":147,"Õ":148,"Ö":149,"×":150,"Ø":151,"Ù":152,"Ú":153,"Û":154,"Ü":155,"Ý":156,"Þ":157,"ß":158,"à":159,"á":160,"â":161,"ã":162,"ä":163,"å":164,"æ":165,"ç":166,"è":167,"é":168,"ê":169,"ë":170,"ì":171,"í":172,"î":173,"ï":174,"ð":175,"ñ":176,"ò":177,"ó":178,"ô":179,"õ":180,"ö":181,"÷":182,"ø":183,"ù":184,"ú":185,"û":186,"ü":187,"ý":188,"þ":189,"ÿ":190,"Ā":191,"ā":192,"ă":193,"Ą":194,"ą":195,"Ć":196,"ć":197,"Ĉ":198,"ĉ":199,"Č":200,"č":201,"Ď":202,"ď":203,"Đ":204,"đ":205,"ē":206,"ĕ":207,"ė":208,"Ę":209,"ę":210,"Ě":211,"ě":212,"ĝ":213,"Ğ":214,"ğ":215,"ġ":216,"ģ":217,"ĩ":218,"Ī":219,"ī":220,"į":221,"İ":222,"ı":223,"ķ":224,"ļ":225,"Ľ":226,"ľ":227,"Ł":228,"ł":229,"Ń":230,"ń":231,"ņ":232,"Ň":233,"ň":234,"ō":235,"ŏ":236,"Ő":237,"ő":238,"Œ":239,"œ":240,"ŕ":241,"Ř":242,"ř":243,"Ś":244,"ś":245,"Ş":246,"ş":247,"Š":248,"š":249,"Ţ":250,"ţ":251,"ť":252,"Ū":253,"ū":254,"ŭ":255,"Ů":256,"ů":257,"ű":258,"ų":259,"Ÿ":260,"ź":261,"Ż":262,"ż":263,"Ž":264,"ž":265,"ƒ":266,"ơ":267,"ư":268,"ǎ":269,"ǐ":270,"ǔ":271,"ș":272,"ț":273,"ɐ":274,"ɑ":275,"ɒ":276,"ɔ":277,"ə":278,"ɛ":279,"ɨ":280,"ɪ":281,"ɫ":282,"ɾ":283,"ʃ":284,"ʒ":285,"ʻ":286,"ʼ":287,"ˆ":288,"ˈ":289,"ˌ":290,"ː":291,"́":292,"̃":293,"̄":294,"̈":295,"̊":296,"̋":297,"̍":298,"̤":299,"̧":300,"̨":301,"Ά":302,"Α":303,"Β":304,"Γ":305,"Δ":306,"Ε":307,"Ζ":308,"Η":309,"Θ":310,"Ι":311,"Κ":312,"Λ":313,"Μ":314,"Ν":315,"Ο":316,"Π":317,"Ρ":318,"Σ":319,"Τ":320,"Υ":321,"Φ":322,"Χ":323,"Ω":324,"ά":325,"έ":326,"ή":327,"ί":328,"α":329,"β":330,"γ":331,"δ":332,"ε":333,"ζ":334,"η":335,"θ":336,"ι":337,"κ":338,"λ":339,"μ":340,"ν":341,"ξ":342,"ο":343,"π":344,"ρ":345,"ς":346,"σ":347,"τ":348,"υ":349,"φ":350,"χ":351,"ψ":352,"ω":353,"ϊ":354,"ό":355,"ύ":356,"ώ":357,"Ђ":358,"Ѓ":359,"І":360,"Љ":361,"Њ":362,"Ћ":363,"Ќ":364,"Ў":365,"Џ":366,"А":367,"Б":368,"В":369,"Г":370,"Д":371,"Е":372,"Ж":373,"З":374,"И":375,"К":376,"Л":377,"М":378,"Н":379,"О":380,"П":381,"Р":382,"С":383,"Т":384,"У":385,"Ф":386,"Х":387,"Ц":388,"Ч":389,"Ш":390,"Э":391,"Ю":392,"Я":393,"а":394,"б":395,"в":396,"г":397,"д":398,"е":399,"ж":400,"з":401,"и":402,"й":403,"к":404,"л":405,"м":406,"н":407,"о":408,"п":409,"р":410,"с":411,"т":412,"у":413,"ф":414,"х":415,"ц":416,"ч":417,"ш":418,"щ":419,"ъ":420,"ы":421,"ь":422,"э":423,"ю":424,"я":425,"ё":426,"ѓ":427,"є":428,"ѕ":429,"і":430,"ї":431,"ј":432,"њ":433,"ќ":434,"ў":435,"ґ":436,"ғ":437,"қ":438,"ҡ":439,"ң":440,"ү":441,"ұ":442,"һ":443,"ә":444,"ө":445,"ְ":446,"ִ":447,"ַ":448,"ָ":449,"ֹ":450,"ּ":451,"ֿ":452,"א":453,"ב":454,"ג":455,"ד":456,"ה":457,"ו":458,"ז":459,"ח":460,"ט":461,"י":462,"כ":463,"ל":464,"ם":465,"מ":466,"ן":467,"נ":468,"ס":469,"ע":470,"פ":471,"צ":472,"ק":473,"ר":474,"ש":475,"ת":476,"،":477,"ء":478,"آ":479,"أ":480,"إ":481,"ا":482,"ب":483,"ة":484,"ت":485,"ث":486,"ج":487,"ح":488,"خ":489,"د":490,"ذ":491,"ر":492,"ز":493,"س":494,"ش":495,"ص":496,"ض":497,"ط":498,"ع":499,"غ":500,"ف":501,"ق":502,"ك":503,"ل":504,"م":505,"ن":506,"ه":507,"و":508,"ى":509,"ي":510,"ً":511,"َ":512,"ُ":513,"ِ":514,"ّ":515,"ْ":516,"پ":517,"ک":518,"گ":519,"ی":520,"۞":521,"۰":522,"۱":523,"۲":524,"۴":525,"۹":526,"क":527,"त":528,"न":529,"प":530,"म":531,"र":532,"ल":533,"ह":534,"ा":535,"ि":536,"्":537,"্":538,"்":539,"്":540,"ก":541,"ข":542,"ค":543,"ง":544,"จ":545,"ช":546,"ญ":547,"ณ":548,"ด":549,"ต":550,"ถ":551,"ท":552,"ธ":553,"น":554,"บ":555,"ป":556,"ผ":557,"พ":558,"ภ":559,"ม":560,"ย":561,"ร":562,"ล":563,"ว":564,"ศ":565,"ส":566,"ห":567,"อ":568,"ะ":569,"ั":570,"า":571,"ิ":572,"ี":573,"ึ":574,"ื":575,"ุ":576,"ู":577,"เ":578,"แ":579,"โ":580,"ใ":581,"ไ":582,"็":583,"่":584,"้":585,"์":586,"ํ":587,"ຸ":588,"་":589,"ა":590,"ბ":591,"გ":592,"დ":593,"ე":594,"ვ":595,"თ":596,"ი":597,"ლ":598,"მ":599,"ნ":600,"ო":601,"რ":602,"ს":603,"ტ":604,"უ":605,"შ":606,"ხ":607,"ም":608,"ረ":609,"በ":610,"ተ":611,"ዓ":612,"የ":613,"ይ":614,"ḥ":615,"ṭ":616,"ṳ":617,"ạ":618,"ả":619,"ế":620,"ề":621,"ễ":622,"ệ":623,"ị":624,"ố":625,"ồ":626,"ổ":627,"ộ":628,"ớ":629,"ờ":630,"ữ":631,"ỹ":632,"​":633,"‌":634,"‎":635,"‏":636,"‐":637,"–":638,"—":639,"―":640,"‘":641,"’":642,"‚":643,"‛":644,"“":645,"”":646,"„":647,"†":648,"‡":649,"•":650,"‰":651,"′":652,"‹":653,"›":654,"※":655,"⁄":656,"₤":657,"€":658,"←":659,"↑":660,"→":661,"⇒":662,"⇢":663,"−":664,"√":665,"∞":666,"≈":667,"≤":668,"≥":669,"─":670,"│":671,"┌":672,"┐":673,"╚":674,"╩":675,"▁":676,"▒":677,"■":678,"▪":679,"►":680,"◆":681,"◊":682,"○":683,"◎":684,"●":685,"★":686,"☆":687,"♀":688,"♣":689,"♥":690,"♦":691,"♪":692,"✿":693,"、":694,"。":695,"《":696,"》":697,"『":698,"』":699,"【":700,"】":701,"あ":702,"い":703,"う":704,"お":705,"か":706,"が":707,"き":708,"く":709,"こ":710,"さ":711,"し":712,"じ":713,"す":714,"た":715,"ち":716,"っ":717,"つ":718,"て":719,"で":720,"と":721,"な":722,"に":723,"の":724,"は":725,"ひ":726,"ま":727,"み":728,"も":729,"よ":730,"ら":731,"り":732,"る":733,"れ":734,"わ":735,"を":736,"ん":737,"ア":738,"イ":739,"オ":740,"カ":741,"キ":742,"ク":743,"コ":744,"シ":745,"ジ":746,"ス":747,"チ":748,"ッ":749,"テ":750,"ト":751,"ド":752,"ナ":753,"ハ":754,"バ":755,"フ":756,"マ":757,"メ":758,"ャ":759,"ラ":760,"ル":761,"レ":762,"ワ":763,"ン":764,"・":765,"ー":766,"一":767,"三":768,"上":769,"下":770,"不":771,"东":772,"中":773,"为":774,"乐":775,"了":776,"事":777,"二":778,"五":779,"亜":780,"交":781,"京":782,"人":783,"仁":784,"以":785,"会":786,"体":787,"你":788,"信":789,"修":790,"元":791,"克":792,"免":793,"入":794,"八":795,"公":796,"内":797,"円":798,"出":799,"分":800,"切":801,"利":802,"前":803,"剥":804,"加":805,"動":806,"北":807,"区":808,"匿":809,"十":810,"华":811,"南":812,"博":813,"原":814,"参":815,"发":816,"取":817,"口":818,"可":819,"台":820,"司":821,"合":822,"吉":823,"名":824,"后":825,"吧":826,"和":827,"啦":828,"四":829,"回":830,"园":831,"国":832,"图":833,"國":834,"圓":835,"在":836,"场":837,"城":838,"士":839,"多":840,"大":841,"天":842,"套":843,"女":844,"娱":845,"子":846,"字":847,"安":848,"定":849,"家":850,"寺":851,"寿":852,"小":853,"居":854,"屋":855,"山":856,"島":857,"州":858,"市":859,"帝":860,"常":861,"平":862,"年":863,"広":864,"庆":865,"店":866,"廣":867,"建":868,"式":869,"当":870,"徐":871,"得":872,"心":873,"思":874,"情":875,"成":876,"手":877,"援":878,"敏":879,"文":880,"新":881,"方":882,"日":883,"明":884,"易":885,"是":886,"更":887,"書":888,"月":889,"有":890,"木":891,"本":892,"机":893,"李":894,"村":895,"来":896,"東":897,"板":898,"林":899,"梁":900,"楽":901,"正":902,"武":903,"比":904,"民":905,"氣":906,"水":907,"江":908,"浦":909,"海":910,"深":911,"清":912,"湖":913,"湯":914,"漢":915,"灣":916,"物":917,"特":918,"王":919,"珠":920,"球":921,"生":922,"用":923,"田":924,"白":925,"的":926,"皇":927,"直":928,"相":929,"県":930,"知":931,"石":932,"社":933,"神":934,"科":935,"空":936,"站":937,"简":938,"米":939,"線":940,"网":941,"羅":942,"美":943,"義":944,"能":945,"腹":946,"臺":947,"舞":948,"色":949,"花":950,"茶":951,"華":952,"行":953,"街":954,"西":955,"見":956,"解":957,"言":958,"記":959,"話":960,"語":961,"语":962,"赌":963,"路":964,"車":965,"载":966,"过":967,"这":968,"道":969,"都":970,"酒":971,"里":972,"重":973,"金":974,"長":975,"门":976,"降":977,"陳":978,"雄":979,"電":980,"青":981,"面":982,"音":983,"頂":984,"風":985,"食":986,"香":987,"馬":988,"駅":989,"马":990,"高":991,"黄":992,"국":993,"년":994,"로":995,"서":996,"어":997,"한":998,"":999,"":1000,"":1001,"":1002,"﻿":1003,"�":1004,"▁t":1005,"▁a":1006,"he":1007,"in":1008,"re":1009,"▁the":1010,"on":1011,"er":1012,"▁o":1013,"at":1014,"▁,":1015,"▁s":1016,"en":1017,"▁w":1018,"is":1019,"▁c":1020,"▁.":1021,"it":1022,"nd":1023,"or":1024,"es":1025,"▁p":1026,"▁f":1027,"▁of":1028,"▁b":1029,"an":1030,"▁in":1031,"ion":1032,"al":1033,"##":1034,"ou":1035,"▁to":1036,"ed":1037,"▁and":1038,"ar":1039,"ing":1040,"▁m":1041,"ic":1042,"ro":1043,"▁d":1044,"▁th":1045,"ent":1046,"le":1047,"▁h":1048,"as":1049,"▁re":1050,"om":1051,"▁n":1052,"il":1053,"st":1054,"AT":1055,"ve":1056,"ct":1057,"##AT":1058,"##AT##":1059,"▁e":1060,"▁is":1061,"ot":1062,"▁T":1063,"▁be":1064,"▁I":1065,"▁l":1066,"ly":1067,"ation":1068,"▁for":1069,"ur":1070,"▁on":1071,"os":1072,"▁that":1073,"ut":1074,"▁g":1075,"▁C":1076,"et":1077,"id":1078,"ce":1079,"im":1080,"ment":1081,"ol":1082,"us":1083,"▁S":1084,"▁pro":1085,"ra":1086,"▁y":1087,"el":1088,"▁A":1089,"▁M":1090,"ith":1091,"ver":1092,"▁con":1093,"pe":1094,"▁&":1095,"▁E":1096,"ig":1097,"▁The":1098,"▁with":1099,"▁al":1100,"ch":1101,"▁P":1102,"ow":1103,"▁wh":1104,"ul":1105,"▁st":1106,"qu":1107,"▁##AT##":1108,"-##AT##":1109,"▁##AT##-##AT##":1110,"▁are":1111,"▁it":1112,"ort":1113,"ay":1114,"▁as":1115,"▁we":1116,"▁you":1117,"ir":1118,"ap":1119,"res":1120,"▁de":1121,"ad":1122,"ill":1123,"▁an":1124,"un":1125,"▁com":1126,"ers":1127,"ld":1128,"am":1129,"ies":1130,"ate":1131,"▁this":1132,"▁ha":1133,"ter":1134,"▁W":1135,"▁su":1136,"ble":1137,"ity":1138,"ess":1139,"if":1140,"▁ex":1141,"ge":1142,"her":1143,"▁or":1144,"▁v":1145,"▁B":1146,"port":1147,"▁not":1148,"op":1149,"em":1150,"▁ne":1151,"est":1152,"ive":1153,"ke":1154,"▁by":1155,"ant":1156,"▁have":1157,"▁at":1158,"ich":1159,"ore":1160,"ist":1161,"ain":1162,"apos":1163,"apos;":1164,"▁&apos;":1165,"ust":1166,"▁F":1167,"nt":1168,"se":1169,"art":1170,"ould":1171,"▁r":1172,"uro":1173,"rom":1174,"oc":1175,"igh":1176,"▁se":1177,"od":1178,"▁will":1179,"▁sh":1180,"iv":1181,"▁which":1182,"▁Euro":1183,"▁1":1184,"▁H":1185,"ial":1186,"ac":1187,"▁en":1188,"▁Europe":1189,"▁from":1190,"▁G":1191,"ia":1192,"um":1193,"ect":1194,"▁2":1195,"▁us":1196,"▁D":1197,"ure":1198,"▁(":1199,"▁R":1200,"▁can":1201,"▁)":1202,"▁he":1203,"ions":1204,"▁has":1205,"▁all":1206,"▁im":1207,"our":1208,"omm":1209,"ard":1210,"and":1211,"▁le":1212,"▁L":1213,"ight":1214,"sion":1215,"▁u":1216,"pl":1217,"end":1218,"ri":1219,"00":1220,"▁U":1221,"▁wor":1222,"▁was":1223,"▁our":1224,"te":1225,"▁res":1226,"▁O":1227,"▁ch":1228,"▁In":1229,"ie":1230,"▁Comm":1231,"▁European":1232,"all":1233,"ber":1234,"▁comp":1235,"▁Th":1236,"th":1237,"▁N":1238,"so":1239,"ud":1240,"ff":1241,"ther":1242,"▁ad":1243,"rou":1244,"ical":1245,"ak":1246,"ated":1247,"cc":1248,"ount":1249,"quot":1250,"ast":1251,"▁cont":1252,"▁:":1253,"able":1254,"▁also":1255,"ous":1256,"very":1257,"ost":1258,"▁ag":1259,"du":1260,"▁&quot":1261,"▁&quot;":1262,"▁part":1263,"▁me":1264,"ab":1265,"▁pl":1266,"▁-":1267,"ire":1268,"ations":1269,"ans":1270,"ide":1271,"age":1272,"ult":1273,"▁ap":1274,"out":1275,"▁do":1276,"ome":1277,"ag":1278,"▁your":1279,"pt":1280,"▁un":1281,"▁its":1282,"ission":1283,"vel":1284,"▁We":1285,"▁&apos;s":1286,"are":1287,"▁ab":1288,"ice":1289,"▁St":1290,"ree":1291,"ell":1292,"per":1293,"▁whe":1294,"act":1295,"ake":1296,"ip":1297,"▁but":1298,"ance":1299,"▁there":1300,"orm":1301,"▁go":1302,"ine":1303,"▁It":1304,"og":1305,"▁j":1306,"▁Commission":1307,"▁Mr":1308,"▁qu":1309,"gh":1310,"ments":1311,"ary":1312,"▁reg":1313,"ue":1314,"▁inc":1315,"▁would":1316,"ident":1317,"▁k":1318,"▁more":1319,"ction":1320,"ong":1321,"ates":1322,"ition":1323,"▁tr":1324,"▁their":1325,"iz":1326,"▁dis":1327,"▁man":1328,"▁so":1329,"▁cl":1330,"▁int":1331,"▁been":1332,"▁pol":1333,"ose":1334,"tern":1335,"ere":1336,"ind":1337,"ime":1338,"▁am":1339,"reat":1340,"ear":1341,"▁one":1342,"▁This":1343,"con":1344,"▁li":1345,"form":1346,"erv":1347,"▁Un":1348,"ark":1349,"ail":1350,"▁should":1351,"pport":1352,"ally":1353,"▁acc":1354,"ru":1355,"▁up":1356,"▁ro":1357,"▁other":1358,"erm":1359,"ish":1360,"▁work":1361,"▁tra":1362,"▁new":1363,"ign":1364,"▁off":1365,"▁count":1366,"▁comm":1367,"▁’":1368,"si":1369,"▁Pres":1370,"ry":1371,"ase":1372,"▁out":1373,"▁spe":1374,"ite":1375,"ok":1376,"ace":1377,"ub":1378,"ach":1379,"pos":1380,"▁must":1381,"ence":1382,"▁pr":1383,"cial":1384,"▁pre":1385,"▁V":1386,"▁who":1387,"ress":1388,"ational":1389,"ack":1390,"▁te":1391,"▁like":1392,"▁J":1393,"ities":1394,"ord":1395,"▁pos":1396,"otel":1397,"▁co":1398,"▁very":1399,"▁need":1400,"ens":1401,"▁they":1402,"▁pe":1403,"one":1404,"arl":1405,"▁year":1406,"nc":1407,"▁President":1408,"▁ind":1409,"▁K":1410,"▁produ":1411,"▁ev":1412,"int":1413,"▁200":1414,"▁time":1415,"▁only":1416,"ame":1417,"▁cons":1418,"▁ar":1419,"▁bec":1420,"▁/":1421,"ject":1422,"aus":1423,"▁about":1424,"▁than":1425,"▁und":1426,"ember":1427,"▁any":1428,"▁per":1429,"ious":1430,"pro":1431,"▁prov":1432,"▁right":1433,"velop":1434,"ise":1435,"▁no":1436,"▁?":1437,"av":1438,"cess":1439,"▁po":1440,"arlia":1441,"▁bet":1442,"ll":1443,"▁these":1444,"▁rel":1445,"ep":1446,"fore":1447,"▁rec":1448,"ple":1449,"arliament":1450,"▁sy":1451,"ram":1452,"▁import":1453,"▁sp":1454,"▁3":1455,"ution":1456,"▁report":1457,"ass":1458,"ility":1459,"▁ra":1460,"▁develop":1461,"ors":1462,"ks":1463,"enc":1464,"▁if":1465,"ople":1466,"▁Union":1467,"wn":1468,"▁&#":1469,"irst":1470,"▁act":1471,"ob":1472,"now":1473,"▁them":1474,"ern":1475,"ian":1476,"▁serv":1477,"▁Y":1478,"ries":1479,"▁trans":1480,"▁fe":1481,"ures":1482,"fere":1483,"▁em":1484,"▁over":1485,"stem":1486,"▁Parliament":1487,"oy":1488,"ause":1489,"ings":1490,"▁inst":1491,"lic":1492,"▁conc":1493,"ert":1494,"▁dec":1495,"lud":1496,"ang":1497,"ular":1498,"▁eff":1499,"▁EU":1500,"ile":1501,"get":1502,"▁people":1503,"▁into":1504,"we":1505,"ays":1506,"▁sub":1507,"▁19":1508,"ific":1509,"▁des":1510,"pect":1511,"▁well":1512,"red":1513,"▁my":1514,"iew":1515,"ov":1516,"ook":1517,"▁support":1518,"▁some":1519,"▁use":1520,"ual":1521,"ounc":1522,"▁were":1523,"▁what":1524,"▁Ch":1525,"▁such":1526,"▁sa":1527,"ful":1528,"▁States":1529,"▁op":1530,"ft":1531,"▁system":1532,"ade":1533,"▁add":1534,"▁ob":1535,"xt":1536,"und":1537,"▁Member":1538,"▁dif":1539,"conom":1540,"ices":1541,"ced":1542,"▁sc":1543,"▁mark":1544,"lect":1545,"ric":1546,"▁under":1547,"▁first":1548,"▁inform":1549,"ient":1550,"▁countries":1551,"resent":1552,"▁fin":1553,"▁when":1554,"der":1555,"▁most":1556,"▁inv":1557,"▁!":1558,"▁;":1559,"▁loc":1560,"..":1561,"ouncil":1562,"▁&#9":1563,"ating":1564,"▁partic":1565,"ild":1566,"▁his":1567,"rit":1568,"ater":1569,"irect":1570,"▁know":1571,"ative":1572,"▁Council":1573,"rough":1574,"▁polic":1575,"▁cent":1576,"▁now":1577,"sible":1578,"▁important":1579,"ound":1580,"ory":1581,"▁again":1582,"▁just":1583,"▁how":1584,"▁make":1585,"ever":1586,"▁tw":1587,"low":1588,"▁includ":1589,"▁prog":1590,"▁hotel":1591,"▁gu":1592,"hen":1593,"ange":1594,"ween":1595,"▁econom":1596,"▁–":1597,"▁ent":1598,"▁inte":1599,"▁many":1600,"▁bas":1601,"▁att":1602,"▁between":1603,"ink":1604,"hed":1605,"ren":1606,"▁propos":1607,"ces":1608,"▁requ":1609,"▁ass":1610,"▁intern":1611,"cept":1612,"ough":1613,"▁...":1614,"▁dem":1615,"roup":1616,"▁market":1617,"ove":1618,"▁because":1619,"▁take":1620,"ted":1621,"fter":1622,"ied":1623,"▁sit":1624,"▁world":1625,"▁As":1626,"pon":1627,"▁mod":1628,"▁la":1629,"▁form":1630,"▁col":1631,"ural":1632,"▁room":1633,"any":1634,"ention":1635,"ublic":1636,"▁soc":1637,"▁rem":1638,"▁where":1639,"ards":1640,"▁ext":1641,"▁4":1642,"▁made":1643,"ality":1644,"▁leg":1645,"▁disc":1646,"▁ac":1647,"▁information":1648,"ph":1649,"▁two":1650,"▁cle":1651,"▁high":1652,"▁point":1653,"▁great":1654,"ives":1655,"oth":1656,"▁see":1657,"▁good":1658,"▁years":1659,"▁every":1660,"uring":1661,"chn":1662,"▁av":1663,"▁5":1664,"▁If":1665,"▁pers":1666,"▁way":1667,"▁product":1668,"▁even":1669,"round":1670,"▁iss":1671,"▁through":1672,"▁Con":1673,"olog":1674,"ract":1675,"▁bu":1676,"als":1677,"rib":1678,"▁sol":1679,"▁those":1680,"▁direct":1681,"ener":1682,"▁set":1683,"▁had":1684,"ax":1685,"▁want":1686,"▁min":1687,"ood":1688,"▁polit":1689,"blem":1690,"ues":1691,"arm":1692,"▁On":1693,"own":1694,"gy":1695,"▁agree":1696,"▁policy":1697,"▁own":1698,"vern":1699,"▁tak":1700,"▁aut":1701,"abl":1702,"▁being":1703,"▁problem":1704,"▁may":1705,"ieve":1706,"day":1707,"ited":1708,"arge":1709,"row":1710,"ism":1711,"ages":1712,"ew":1713,"ick":1714,"ib":1715,"vers":1716,"▁There":1717,"▁str":1718,"▁appro":1719,"▁fact":1720,"▁long":1721,"▁prot":1722,"▁view":1723,"▁particular":1724,"▁num":1725,"unity":1726,"▁ke":1727,"urn":1728,"amp":1729,"▁bel":1730,"gan":1731,"ck":1732,"uch":1733,"▁process":1734,"lp":1735,"▁vot":1736,"elf":1737,"ting":1738,"rest":1739,"emb":1740,"land":1741,"▁trad":1742,"▁sm":1743,"▁respon":1744,"▁program":1745,"▁You":1746,"air":1747,"▁cur":1748,"▁order":1749,"▁differe":1750,"▁quest":1751,"read":1752,"▁area":1753,"▁cour":1754,"▁bus":1755,"▁main":1756,"▁car":1757,"▁here":1758,"▁end":1759,"▁rest":1760,"▁cre":1761,"▁find":1762,"▁mon":1763,"ision":1764,"ines":1765,"▁call":1766,"ince":1767,"▁Se":1768,"▁Re":1769,"▁For":1770,"▁Am":1771,"▁techn":1772,"▁def":1773,"me":1774,"▁ful":1775,"▁after":1776,"▁political":1777,"▁comple":1778,"uman":1779,"▁situ":1780,"▁ref":1781,"▁place":1782,"▁deb":1783,"▁term":1784,"ork":1785,"▁ph":1786,"ower":1787,"iet":1788,"▁person":1789,"▁exp":1790,"▁inter":1791,"▁concern":1792,"▁possible":1793,"▁public":1794,"▁help":1795,"ruct":1796,"▁conf":1797,"▁20":1798,"▁same":1799,"▁provid":1800,"ency":1801,"▁Wh":1802,"ouse":1803,"iness":1804,"ning":1805,"▁fl":1806,"▁appl":1807,"▁exper":1808,"rat":1809,"▁economic":1810,"▁effect":1811,"▁access":1812,"rent":1813,"▁protect":1814,"ved":1815,"▁clear":1816,"▁country":1817,"▁“":1818,"ath":1819,"▁contin":1820,"▁ser":1821,"▁say":1822,"▁sim":1823,"▁incre":1824,"iron":1825,"▁development":1826,"▁De":1827,"▁rep":1828,"ents":1829,"▁does":1830,"▁could":1831,"▁interest":1832,"▁aw":1833,"ily":1834,"▁level":1835,"uss":1836,"▁then":1837,"ten":1838,"▁within":1839,"ised":1840,"▁rights":1841,"itte":1842,"hes":1843,"▁result":1844,"▁stand":1845,"▁del":1846,"▁sec":1847,"▁exam":1848,"▁%":1849,"▁free":1850,"▁avail":1851,"ertain":1852,"▁present":1853,"▁against":1854,"▁therefore":1855,"▁both":1856,"arch":1857,"▁used":1858,"ner":1859,"io":1860,"ts":1861,"▁equ":1862,"▁val":1863,"ron":1864,"▁How":1865,"▁dist":1866,"▁much":1867,"▁fol":1868,"▁Pro":1869,"ason":1870,"▁met":1871,"▁est":1872,"▁get":1873,"▁gener":1874,"▁det":1875,"ute":1876,"▁Al":1877,"itions":1878,"ustom":1879,"viron":1880,"utions":1881,"▁dat":1882,"▁play":1883,"▁gl":1884,"hip":1885,"iven":1886,"ploy":1887,"▁fund":1888,"▁social":1889,"▁Germ":1890,"▁mak":1891,"▁finan":1892,"not":1893,"▁vis":1894,"▁human":1895,"ply":1896,"ically":1897,"▁different":1898,"▁”":1899,"▁mat":1900,"▁cr":1901,"▁group":1902,"ict":1903,"▁fam":1904,"▁sign":1905,"▁Hotel":1906,"▁without":1907,"▁sur":1908,"▁lead":1909,"▁meas":1910,"ittee":1911,"▁spec":1912,"ran":1913,"aj":1914,"eration":1915,"vironment":1916,"uc":1917,"▁number":1918,"old":1919,"▁think":1920,"▁ens":1921,"▁last":1922,"▁international":1923,"▁var":1924,"its":1925,"cond":1926,"▁allow":1927,"▁govern":1928,"▁services":1929,"▁bl":1930,"▁real":1931,"▁cond":1932,"▁organ":1933,"ration":1934,"▁oper":1935,"▁still":1936,"embers":1937,"▁available":1938,"▁cap":1939,"▁hand":1940,"ng":1941,"▁require":1942,"ene":1943,"▁back":1944,"ists":1945,"▁6":1946,"▁adv":1947,"les":1948,"sib":1949,"ics":1950,"urther":1951,"▁const":1952,"▁special":1953,"▁fut":1954,"▁open":1955,"ready":1956,"▁business":1957,"alk":1958,"▁look":1959,"▁compet":1960,"hing":1961,"▁custom":1962,"▁current":1963,"▁offer":1964,"ty":1965,"els":1966,"nce":1967,"▁believe":1968,"▁follow":1969,"▁project":1970,"▁already":1971,"▁before":1972,"ulation":1973,"1;":1974,"▁&#91;":1975,"ug":1976,"▁future":1977,"ional":1978,"▁start":1979,"3;":1980,"▁&#93;":1981,"▁small":1982,"ants":1983,"ope":1984,"▁air":1985,"▁down":1986,"▁national":1987,"▁That":1988,"pr":1989,"▁course":1990,"▁prev":1991,"▁today":1992,"led":1993,"▁products":1994,"ience":1995,"▁cor":1996,"▁state":1997,"ral":1998,"plement":1999,"alth":2000,"▁ins":2001,"▁med":2002,"▁able":2003,"▁environment":2004,"▁He":2005,"ness":2006,"omet":2007,"▁indust":2008,"▁too":2009,"▁design":2010,"▁All":2011,"▁quality":2012,"itiz":2013,"▁prom":2014,"▁Ar":2015,"ital":2016,"▁ide":2017,"ving":2018,"▁service":2019,"ier":2020,"▁cannot":2021,"ication":2022,"▁data":2023,"hor":2024,"▁certain":2025,"▁case":2026,"▁day":2027,"tle":2028,"urity":2029,"▁lif":2030,"▁art":2031,"ss":2032,"▁rev":2033,"▁che":2034,"eld":2035,"ately":2036,"▁Commissioner":2037,"▁contro":2038,"▁regard":2039,"ished":2040,"▁offers":2041,"▁question":2042,"▁fac":2043,"ank":2044,"com":2045,"ves":2046,"▁put":2047,"▁law":2048,"▁br":2049,"▁impro":2050,"ajor":2051,"lease":2052,"▁since":2053,"▁pur":2054,"▁But":2055,"▁meet":2056,"▁bo":2057,"fort":2058,"ix":2059,"▁eas":2060,"udget":2061,"▁At":2062,"app":2063,"▁inf":2064,"▁best":2065,"iving":2066,"ually":2067,"less":2068,"▁financial":2069,"▁citiz":2070,"arg":2071,"▁reason":2072,"▁during":2073,"inc":2074,"▁debate":2075,"▁nat":2076,"▁ach":2077,"▁ter":2078,"▁said":2079,"ccess":2080,"▁199":2081,"ock":2082,"▁issue":2083,"▁7":2084,"▁city":2085,"ered":2086,"▁proposal":2087,"▁means":2088,"▁respect":2089,"▁her":2090,"ird":2091,"▁saf":2092,"ains":2093,"▁10":2094,"▁cost":2095,"▁web":2096,"▁example":2097,"ather":2098,"▁0":2099,"▁beh":2100,"▁ask":2101,"▁prof":2102,"ars":2103,"▁large":2104,"▁ed":2105,"▁implement":2106,"ination":2107,"▁major":2108,"▁list":2109,"▁8":2110,"▁However":2111,"ining":2112,"▁dra":2113,"▁show":2114,"▁including":2115,"▁sect":2116,"▁found":2117,"▁elect":2118,"▁situation":2119,"que":2120,"▁necess":2121,"▁coop":2122,"▁9":2123,"ider":2124,"▁Our":2125,"ined":2126,"isation":2127,"ified":2128,"ivid":2129,"▁common":2130,"▁amend":2131,"▁And":2132,"▁ener":2133,"▁resol":2134,"▁es":2135,"▁With":2136,"ys":2137,"ina":2138,"iss":2139,"▁child":2140,"▁few":2141,"▁based":2142,"▁each":2143,"ways":2144,"▁fun":2145,"▁adop":2146,"ential":2147,"▁object":2148,"ability":2149,"ized":2150,"▁citizens":2151,"▁redu":2152,"ne":2153,"reed":2154,"▁Sp":2155,"▁sup":2156,"▁hist":2157,"lus":2158,"▁activ":2159,"mit":2160,"▁instit":2161,"pare":2162,"▁imp":2163,"imes":2164,"ilities":2165,"▁ret":2166,"▁Committee":2167,"▁rooms":2168,"men":2169,"▁democ":2170,"ware":2171,"▁cult":2172,"▁read":2173,"▁three":2174,"illion":2175,"▁measures":2176,"▁represent":2177,"▁invest":2178,"▁author":2179,"▁areas":2180,"▁employ":2181,"▁power":2182,"ivers":2183,"▁Intern":2184,"▁give":2185,"come":2186,"▁ensure":2187,"▁success":2188,"▁energy":2189,"▁next":2190,"▁opt":2191,"▁build":2192,"▁account":2193,"▁rece":2194,"ased":2195,"▁ty":2196,"▁further":2197,"ology":2198,"▁budget":2199,"▁grow":2200,"▁neg":2201,"ven":2202,"▁provide":2203,"ield":2204,"▁taken":2205,"ward":2206,"▁US":2207,"▁establ":2208,"▁agreement":2209,"▁dep":2210,"▁An":2211,"other":2212,"▁To":2213,"itional":2214,"ently":2215,"▁Is":2216,"▁Z":2217,"omen":2218,"▁stay":2219,"alf":2220,"itive":2221,"▁far":2222,"▁second":2223,"ann":2224,"▁pay":2225,"ium":2226,"ec":2227,"▁pass":2228,"joy":2229,"line":2230,"fic":2231,"eur":2232,"▁expl":2233,"aut":2234,"▁company":2235,"▁key":2236,"ising":2237,"ik":2238,"▁opport":2239,"ible":2240,"▁accept":2241,"▁come":2242,"▁problems":2243,"▁shall":2244,"▁necessary":2245,"▁fore":2246,"isl":2247,"▁somet":2248,"▁position":2249,"ases":2250,"▁change":2251,"ross":2252,"ests":2253,"nect":2254,"▁security":2255,"ules":2256,"oint":2257,"▁hope":2258,"az":2259,"aur":2260,"▁priv":2261,"▁princ":2262,"▁stud":2263,"reak":2264,"utes":2265,"▁health":2266,"▁given":2267,"▁why":2268,"▁init":2269,"▁pract":2270,"▁Le":2271,"▁however":2272,"tain":2273,"▁pres":2274,"stand":2275,"▁cooperation":2276,"▁old":2277,"obal":2278,"▁fil":2279,"▁ele":2280,"▁dr":2281,"▁invol":2282,"▁vote":2283,"ER":2284,"pecial":2285,"ond":2286,"raph":2287,"▁life":2288,"▁protection":2289,"here":2290,"▁wel":2291,"▁imm":2292,"▁while":2293,"riend":2294,"▁aff":2295,"▁did":2296,"▁complete":2297,"▁control":2298,"cell":2299,"▁tour":2300,"sibility":2301,"▁needs":2302,"▁pop":2303,"▁always":2304,"▁commun":2305,"▁close":2306,"▁legisl":2307,"▁sk":2308,"iety":2309,"▁name":2310,"▁exc":2311,"▁They":2312,"▁located":2313,"eng":2314,"▁individ":2315,"▁comb":2316,"eric":2317,"ante":2318,"▁strate":2319,"▁deal":2320,"▁happ":2321,"ize":2322,"agement":2323,"000":2324,"▁short":2325,"▁action":2326,"oad":2327,"▁ver":2328,"▁better":2329,"▁full":2330,"ave":2331,"▁&amp":2332,"▁&amp;":2333,"▁consum":2334,"cy":2335,"▁using":2336,"inal":2337,"ling":2338,"ference":2339,"▁fav":2340,"▁mus":2341,"▁What":2342,"ret":2343,"▁Group":2344,"wards":2345,"▁United":2346,"ek":2347,"▁less":2348,"▁visit":2349,"urg":2350,"▁consider":2351,"▁unt":2352,"cing":2353,"▁integ":2354,"▁cho":2355,"▁connect":2356,"▁lit":2357,"▁par":2358,"irm":2359,"rad":2360,"ury":2361,"▁15":2362,"▁net":2363,"▁working":2364,"▁production":2365,"▁Americ":2366,"▁So":2367,"ners":2368,"▁transport":2369,"▁pri":2370,"▁around":2371,"▁When":2372,"▁legal":2373,"au":2374,"▁crit":2375,"▁enjoy":2376,"▁Ex":2377,"▁specific":2378,"ung":2379,"▁chang":2380,"par":2381,"▁Mrs":2382,"▁word":2383,"ources":2384,"▁whether":2385,"ify":2386,"▁el":2387,"▁terms":2388,"▁particularly":2389,"▁Community":2390,"▁rapport":2391,"▁care":2392,"▁toget":2393,"▁together":2394,"sel":2395,"▁Ind":2396,"▁trade":2397,"▁become":2398,"▁step":2399,"ons":2400,"ins":2401,"▁subject":2402,"ises":2403,"▁rapporteur":2404,"por":2405,"▁making":2406,"▁Q":2407,"ficult":2408,"▁House":2409,"▁she":2410,"▁sing":2411,"iod":2412,"▁run":2413,"▁difficult":2414,"ale":2415,"▁These":2416,"▁field":2417,"▁modern":2418,"▁rese":2419,"▁individual":2420,"▁another":2421,"oura":2422,"gg":2423,"ands":2424,"▁global":2425,"▁Mad":2426,"aff":2427,"ets":2428,"▁contrib":2429,"anies":2430,"▁friend":2431,"▁whole":2432,"▁children":2433,"ims":2434,"▁proper":2435,"over":2436,"▁issues":2437,"▁12":2438,"▁bene":2439,"▁water":2440,"▁promot":2441,"▁plan":2442,"▁non":2443,"pecially":2444,"ights":2445,"orth":2446,"up":2447,"▁lim":2448,"▁exist":2449,"arante":2450,"▁centre":2451,"▁conditions":2452,"▁text":2453,"▁beg":2454,"olid":2455,"▁local":2456,"iation":2457,"▁address":2458,"▁sector":2459,"▁systems":2460,"ftware":2461,"▁third":2462,"▁equip":2463,"ense":2464,"iver":2465,"ocu":2466,"▁speak":2467,"fer":2468,"▁accord":2469,"▁various":2470,"▁role":2471,"inist":2472,"mental":2473,"▁industry":2474,"AR":2475,"▁commit":2476,"▁companies":2477,"▁guarante":2478,"▁tax":2479,"selves":2480,"▁experience":2481,"angu":2482,"▁women":2483,"▁month":2484,"▁basis":2485,"ively":2486,"▁##":2487,"▁writ":2488,"▁book":2489,"12":2490,"▁matter":2491,"ux":2492,"▁appe":2493,"▁near":2494,"▁occ":2495,"▁pack":2496,"▁Ad":2497,"▁18":2498,"▁especially":2499,"▁perform":2500,"reaty":2501,"▁gent":2502,"fact":2503,"▁sum":2504,"▁called":2505,"▁site":2506,"▁members":2507,"▁effort":2508,"reen":2509,"▁Cent":2510,"▁orig":2511,"▁done":2512,"▁ris":2513,"nov":2514,"▁Sw":2515,"▁break":2516,"▁discuss":2517,"imate":2518,"▁proced":2519,"▁research":2520,"▁fram":2521,"▁beaut":2522,"▁though":2523,"▁bed":2524,"▁negot":2525,"isions":2526,"▁move":2527,"▁German":2528,"▁really":2529,"▁gentle":2530,"▁Be":2531,"▁bro":2532,"▁create":2533,"thing":2534,"▁region":2535,"10":2536,"aterial":2537,"▁pat":2538,"▁top":2539,"ived":2540,"▁docu":2541,"▁Ag":2542,"▁wish":2543,"▁prior":2544,"▁period":2545,"ilit":2546,"▁feat":2547,"ique":2548,"▁strong":2549,"▁improve":2550,"▁press":2551,"ences":2552,"▁war":2553,"▁arr":2554,"▁z":2555,"rodu":2556,"▁food":2557,"▁No":2558,"▁turn":2559,"oney":2560,"ances":2561,"▁sever":2562,"icient":2563,"▁decision":2564,"▁government":2565,"ety":2566,"ption":2567,"ah":2568,"ool":2569,"ours":2570,"▁million":2571,"▁Go":2572,"ended":2573,"adies":2574,"▁among":2575,"▁Pl":2576,"▁Sh":2577,"▁comfort":2578,"▁thank":2579,"ization":2580,"▁something":2581,"▁struct":2582,"▁resolution":2583,"▁ann":2584,"▁job":2585,"▁page":2586,"▁itself":2587,"▁ple":2588,"▁eng":2589,"▁several":2590,"▁single":2591,"▁langu":2592,"ogn":2593,"▁restaur":2594,"ications":2595,"▁general":2596,"tic":2597,"▁excell":2598,"co":2599,"ending":2600,"atic":2601,"▁line":2602,"▁programme":2603,"asing":2604,"▁initi":2605,"▁continue":2606,"▁home":2607,"▁personal":2608,"▁lab":2609,"▁gentlemen":2610,"▁Germany":2611,"OR":2612,"▁webs":2613,"▁netw":2614,"▁material":2615,"▁mult":2616,"▁Fin":2617,"▁contact":2618,"▁let":2619,"▁introdu":2620,"▁going":2621,"ories":2622,"▁dou":2623,"▁enc":2624,"ishing":2625,"▁serious":2626,"▁management":2627,"▁town":2628,"isis":2629,"▁often":2630,"ither":2631,"▁detail":2632,"ped":2633,"ably":2634,"▁peace":2635,"room":2636,"▁opin":2637,"▁directive":2638,"iple":2639,"▁relations":2640,"▁adm":2641,"▁Bar":2642,"▁sl":2643,"outh":2644,"▁gr":2645,"ody":2646,"ST":2647,"pri":2648,"ework":2649,"▁least":2650,"▁ve":2651,"▁rules":2652,"▁following":2653,"▁mot":2654,"▁kind":2655,"ification":2656,"ricult":2657,"▁understand":2658,"▁benef":2659,"▁En":2660,"ipl":2661,"rand":2662,"▁crisis":2663,"ror":2664,"▁Pol":2665,"▁forward":2666,"▁range":2667,"ried":2668,"▁away":2669,"▁family":2670,"▁particip":2671,"side":2672,"leg":2673,"▁reform":2674,"▁class":2675,"▁negoti":2676,"▁towards":2677,"lev":2678,"ash":2679,"ared":2680,"▁hard":2681,"▁bar":2682,"▁mention":2683,"▁progress":2684,"▁Com":2685,"▁once":2686,"▁welcome":2687,"ering":2688,"▁ess":2689,"▁express":2690,"▁char":2691,"▁Tur":2692,"▁feel":2693,"though":2694,"▁bal":2695,"▁recogn":2696,"▁tot":2697,"▁software":2698,"▁Madam":2699,"▁money":2700,"▁et":2701,"▁review":2702,"▁things":2703,"▁customers":2704,"▁apart":2705,"▁institutions":2706,"rict":2707,"▁Cl":2708,"▁30":2709,"▁excellent":2710,"▁aid":2711,"▁until":2712,"▁price":2713,"ister":2714,"▁expect":2715,"▁sw":2716,"▁Treaty":2717,"▁location":2718,"▁&apos;t":2719,"▁Af":2720,"▁colle":2721,"▁keep":2722,"▁known":2723,"▁post":2724,"▁favour":2725,"▁little":2726,"▁days":2727,"▁Mon":2728,"▁Ap":2729,"▁install":2730,"▁approach":2731,"▁Mar":2732,"iol":2733,"airs":2734,"▁staff":2735,"ze":2736,"▁begin":2737,"▁extre":2738,"▁increase":2739,"▁opportunity":2740,"aps":2741,"▁bring":2742,"idency":2743,"▁function":2744,"▁him":2745,"▁profess":2746,"▁Members":2747,"▁achieve":2748,"sequ":2749,"oor":2750,"way":2751,"▁private":2752,"▁activities":2753,"atives":2754,"fect":2755,"▁Ital":2756,"▁clos":2757,"ator":2758,"▁suff":2759,"▁2009":2760,"▁rather":2761,"by":2762,"iful":2763,"ping":2764,"vention":2765,"istic":2766,"▁partners":2767,"eed":2768,"▁Pr":2769,"most":2770,"gt":2771,"▁resources":2772,"▁mean":2773,"▁New":2774,"ters":2775,"osp":2776,"▁app":2777,"ides":2778,"▁try":2779,"ians":2780,"▁quite":2781,"▁growth":2782,"▁tre":2783,"▁treat":2784,"▁wide":2785,"▁provided":2786,"▁fully":2787,"reedom":2788,"▁dev":2789,"▁State":2790,"▁foc":2791,"itor":2792,"text":2793,"▁might":2794,"▁seem":2795,"▁Gu":2796,"▁big":2797,"na":2798,"racy":2799,"ery":2800,"▁tas":2801,"▁walk":2802,"▁technology":2803,"▁ladies":2804,"▁four":2805,"▁request":2806,"▁port":2807,"▁Sc":2808,"mb":2809,"▁signific":2810,"af":2811,"▁light":2812,"▁yet":2813,"▁hig":2814,"▁proposals":2815,"▁aim":2816,"▁value":2817,"▁amendments":2818,"▁travel":2819,"mber":2820,"▁stat":2821,"aces":2822,"▁Fr":2823,"erg":2824,"▁include":2825,"▁Te":2826,"▁bord":2827,"▁left":2828,"▁educ":2829,"▁Wor":2830,"ront":2831,"▁phot":2832,"▁heart":2833,"▁having":2834,"▁After":2835,"ule":2836,"▁solution":2837,"▁safety":2838,"fast":2839,"▁Or":2840,"▁framework":2841,"▁along":2842,"▁taking":2843,"ratic":2844,"▁stren":2845,"▁remain":2846,"▁regul":2847,"▁event":2848,"▁instru":2849,"▁Ro":2850,"pose":2851,"idence":2852,"▁sat":2853,"irc":2854,"▁costs":2855,"fully":2856,"▁above":2857,"▁adopted":2858,"icial":2859,"▁abs":2860,"▁times":2861,"▁ear":2862,"▁Pal":2863,"▁content":2864,"▁essential":2865,"▁addition":2866,"▁creat":2867,"▁recomm":2868,"124":2869,"▁viol":2870,"▁men":2871,"ND":2872,"▁test":2873,"▁week":2874,"▁past":2875,"▁i":2876,"▁histor":2877,"▁makes":2878,"▁extreme":2879,"uge":2880,"▁&#124":2881,"▁&#124;":2882,"aster":2883,"▁opinion":2884,"▁shop":2885,"▁behalf":2886,"▁agricult":2887,"▁economy":2888,"sw":2889,"▁tool":2890,"▁beautiful":2891,"▁entire":2892,"ames":2893,"▁building":2894,"▁fail":2895,"▁legislation":2896,"▁head":2897,"ival":2898,"▁focus":2899,"SC":2900,"▁dest":2901,"rated":2902,"▁chall":2903,"iting":2904,"▁charact":2905,"▁application":2906,"ilt":2907,"lish":2908,"▁effective":2909,"▁projects":2910,"▁others":2911,"▁results":2912,"ites":2913,"▁easy":2914,"▁context":2915,"▁points":2916,"imum":2917,"▁Sch":2918,"ivil":2919,"▁website":2920,"▁provides":2921,"▁freedom":2922,"▁sure":2923,"epend":2924,"▁never":2925,"hod":2926,"▁return":2927,"orn":2928,"▁minutes":2929,"▁Med":2930,"▁concerned":2931,"▁responsibility":2932,"ension":2933,"▁attention":2934,"▁compl":2935,"▁Eng":2936,"▁prec":2937,"lin":2938,"▁One":2939,"▁perfect":2940,".com":2941,"stit":2942,"stain":2943,"▁er":2944,"▁autom":2945,"lex":2946,"▁simply":2947,"▁tar":2948,"▁team":2949,"▁park":2950,"oot":2951,"▁appropri":2952,"▁due":2953,"▁policies":2954,"amental":2955,"▁importance":2956,"▁China":2957,"▁questions":2958,"▁11":2959,"ledge":2960,"ode":2961,"ufact":2962,"▁groups":2963,"▁house":2964,"▁farm":2965,"▁ident":2966,"▁reach":2967,"gu":2968,"▁prevent":2969,"ows":2970,"▁sty":2971,"▁young":2972,"▁X":2973,"▁lot":2974,"isc":2975,"▁enter":2976,"▁environmental":2977,"▁Min":2978,"load":2979,"▁society":2980,"▁bath":2981,"▁tem":2982,"▁Rom":2983,"mes":2984,"rate":2985,"bon":2986,"ior":2987,"▁continu":2988,"▁greater":2989,"▁strategy":2990,"▁host":2991,"▁innov":2992,"▁Res":2993,"▁World":2994,"word":2995,"▁win":2996,"mer":2997,"▁road":2998,"ceed":2999,"▁anal":3000,"▁perm":3001,"ncy":3002,"▁natural":3003,"▁version":3004,"▁increasing":3005,"▁typ":3006,"▁mount":3007,"▁holid":3008,"▁check":3009,"▁sch":3010,"▁principle":3011,"▁standards":3012,"▁Des":3013,"man":3014,"▁achie":3015,"▁talk":3016,"▁cred":3017,"▁25":3018,"edi":3019,"▁sea":3020,"▁amount":3021,"▁manufact":3022,"ured":3023,"▁euro":3024,"idd":3025,"▁Part":3026,"of":3027,"▁14":3028,"▁mach":3029,"▁risk":3030,"▁16":3031,"▁pot":3032,"▁answ":3033,"▁words":3034,"▁method":3035,"ler":3036,"▁Reg":3037,"▁required":3038,"▁training":3039,"▁significant":3040,"▁Internet":3041,"lig":3042,"▁clearly":3043,"▁EUR":3044,"▁via":3045,"▁sal":3046,"duct":3047,"▁lear":3048,"▁meeting":3049,"▁authorities":3050,"▁won":3051,"▁Can":3052,"▁super":3053,"▁technical":3054,"▁Aust":3055,"▁quick":3056,"▁works":3057,"ological":3058,"ators":3059,"▁network":3060,"ruction":3061,"▁demand":3062,"▁cou":3063,"▁My":3064,"▁link":3065,"ike":3066,"▁Off":3067,"rop":3068,"▁user":3069,"ided":3070,"ograph":3071,"▁assist":3072,"▁music":3073,"use":3074,"▁side":3075,"▁administ":3076,"▁century":3077,"▁stop":3078,"to":3079,"▁aware":3080,"ats":3081,"▁Bl":3082,"iversity":3083,"▁recent":3084,"▁pages":3085,"for":3086,"▁central":3087,"▁share":3088,"▁La":3089,"▁according":3090,"▁aspect":3091,"arity":3092,"rist":3093,"▁larg":3094,"▁sugg":3095,"▁cultural":3096,"▁standard":3097,"▁capital":3098,"▁ban":3099,"ateg":3100,"▁internal":3101,"hib":3102,"rect":3103,"▁dial":3104,"▁gra":3105,"▁solutions":3106,"▁safe":3107,"▁independ":3108,"▁distrib":3109,"▁directly":3110,"ients":3111,"▁employment":3112,"une":3113,"▁log":3114,"▁positive":3115,"▁responsible":3116,"▁proposed":3117,"▁months":3118,"▁longer":3119,"▁infl":3120,"ensive":3121,"▁circ":3122,"ring":3123,"▁fight":3124,"▁currently":3125,"▁arch":3126,"▁nature":3127,"▁desc":3128,"che":3129,"▁requirements":3130,"▁affect":3131,"▁2010":3132,"▁Man":3133,"▁mom":3134,"▁interests":3135,"ean":3136,"ports":3137,"oss":3138,"▁history":3139,"▁regions":3140,"▁subs":3141,"▁sustain":3142,"▁events":3143,"▁2008":3144,"▁enough":3145,"▁guests":3146,"▁relax":3147,"▁record":3148,"▁apply":3149,"▁civil":3150,"▁involved":3151,"▁lat":3152,"▁Russ":3153,"ead":3154,"▁character":3155,"▁Please":3156,"▁developed":3157,"▁needed":3158,"▁voted":3159,"▁themselves":3160,"▁don":3161,"▁vol":3162,"▁total":3163,"▁democracy":3164,"▁fundamental":3165,"arian":3166,"▁parties":3167,"▁regulation":3168,"▁Afric":3169,"ored":3170,"▁competition":3171,"▁17":3172,"▁online":3173,"▁implementation":3174,"▁refer":3175,"▁happen":3176,"▁dam":3177,"▁night":3178,"▁mar":3179,"▁select":3180,"▁vill":3181,"▁related":3182,"▁guarantee":3183,"anced":3184,"▁mov":3185,"▁dom":3186,"go":3187,"▁force":3188,"erous":3189,"▁efforts":3190,"▁13":3191,"▁please":3192,"▁foreign":3193,"uly":3194,"▁From":3195,"ogue":3196,"▁categ":3197,"ached":3198,"ien":3199,"▁pub":3200,"▁upon":3201,"▁Qu":3202,"▁item":3203,"▁contain":3204,"▁24":3205,"▁low":3206,"▁language":3207,"▁Russia":3208,"▁extremely":3209,"▁live":3210,"ca":3211,"▁Serv":3212,"▁changes":3213,"▁First":3214,"▁facilities":3215,"▁ago":3216,"amb":3217,"iter":3218,"▁gen":3219,"▁stre":3220,"lear":3221,"acy":3222,"▁comput":3223,"▁mob":3224,"▁date":3225,"aged":3226,"▁caus":3227,"▁contract":3228,"▁document":3229,"▁Air":3230,"▁anim":3231,"▁hold":3232,"▁views":3233,"ria":3234,"▁constit":3235,"▁etc":3236,"▁reserv":3237,"rench":3238,"▁soon":3239,"▁target":3240,"▁camp":3241,"▁negotiations":3242,"▁establish":3243,"▁cases":3244,"▁harm":3245,"▁previous":3246,"▁Port":3247,"ming":3248,"ton":3249,"▁unique":3250,"▁comes":3251,"▁cut":3252,"▁International":3253,"▁oppos":3254,"▁either":3255,"▁Govern":3256,"ired":3257,"▁prepare":3258,"▁50":3259,"key":3260,"atory":3261,"▁submit":3262,"ires":3263,"ibility":3264,"▁terror":3265,"▁breakfast":3266,"ommod":3267,"▁democratic":3268,"▁mess":3269,"▁maintain":3270,"▁developing":3271,"▁markets":3272,"▁More":3273,"▁Ber":3274,"▁broad":3275,"▁May":3276,"▁sound":3277,"▁subst":3278,"▁draw":3279,"▁pool":3280,"▁Presidency":3281,"▁created":3282,"▁states":3283,"▁100":3284,"▁regional":3285,"▁mind":3286,"▁wind":3287,"ression":3288,"▁final":3289,"ged":3290,"▁Tr":3291,"▁situated":3292,"▁education":3293,"ony":3294,"▁der":3295,"▁2007":3296,"▁cong":3297,"▁cat":3298,"▁Not":3299,"▁surround":3300,"aced":3301,"▁suggest":3302,"▁milit":3303,"▁true":3304,"▁type":3305,"▁clean":3306,"▁ground":3307,"▁Sy":3308,"▁additional":3309,"aper":3310,"▁attract":3311,"▁later":3312,"self":3313,"▁Bel":3314,"utional":3315,"▁everything":3316,"▁By":3317,"▁prices":3318,"▁living":3319,"▁climate":3320,"▁pict":3321,"▁recommend":3322,"▁Direct":3323,"▁beach":3324,"ti":3325,"rim":3326,"▁ship":3327,"rip":3328,"▁jo":3329,"▁emph":3330,"gthen":3331,"▁almost":3332,"▁French":3333,"▁immedi":3334,"▁Su":3335,"▁thus":3336,"▁actually":3337,"▁transpare":3338,"▁receive":3339,"▁‘":3340,"▁looking":3341,"haps":3342,"▁fair":3343,"isher":3344,"▁famous":3345,"oid":3346,"▁Brit":3347,"▁file":3348,"▁seen":3349,"ulate":3350,"▁enl":3351,"▁land":3352,"▁idea":3353,"▁rate":3354,"▁knowledge":3355,"▁encoura":3356,"▁held":3357,"▁included":3358,"▁strengthen":3359,"▁appropriate":3360,"abled":3361,"de":3362,"▁accommod":3363,"▁news":3364,"ots":3365,"▁Par":3366,"ctions":3367,"▁funds":3368,"▁restaurant":3369,"▁official":3370,"ception":3371,"▁Do":3372,"▁cal":3373,"▁designed":3374,"▁procedure":3375,"▁five":3376,"▁moment":3377,"▁send":3378,"▁oblig":3379,"ource":3380,"▁mass":3381,"▁station":3382,"▁school":3383,"▁determ":3384,"be":3385,"▁mail":3386,"▁Rep":3387,"▁consult":3388,"empt":3389,"▁workers":3390,"▁assoc":3391,"▁Soc":3392,"▁France":3393,"▁majority":3394,"yc":3395,"rial":3396,"▁lack":3397,"eria":3398,"▁thing":3399,"▁2000":3400,"STAR":3401,"▁Me":3402,"▁conv":3403,"▁island":3404,"▁impact":3405,"▁comfortable":3406,"▁mor":3407,"ches":3408,"▁outside":3409,"▁professional":3410,"ison":3411,"▁customer":3412,"▁ideal":3413,"ms":3414,"▁communication":3415,"▁features":3416,"▁exch":3417,"▁emphas":3418,"▁collect":3419,"▁##STAR":3420,"▁##STAR##":3421,"inks":3422,"▁throughout":3423,"ino":3424,"▁Cour":3425,"▁hon":3426,"ai":3427,"▁users":3428,"icated":3429,"▁cop":3430,"▁takes":3431,"▁Ph":3432,"ilar":3433,"▁Br":3434,"▁doing":3435,"▁exclus":3436,"▁colleag":3437,"▁mentioned":3438,"onst":3439,"▁certainly":3440,"▁download":3441,"▁draft":3442,"▁rad":3443,"▁parts":3444,"▁Cont":3445,"▁ce":3446,"▁space":3447,"ternal":3448,"▁transl":3449,"▁hours":3450,"▁potential":3451,"▁obs":3452,"IN":3453,"▁Christ":3454,"▁mag":3455,"ORE":3456,"▁traditional":3457,"▁Lis":3458,"▁Fund":3459,"▁across":3460,"▁existing":3461,"▁early":3462,"let":3463,"▁correct":3464,"▁consequ":3465,"▁displ":3466,"▁commer":3467,"▁extra":3468,"▁ever":3469,"▁friendly":3470,"▁concept":3471,"▁joint":3472,"bo":3473,"▁American":3474,"aring":3475,"▁concerns":3476,"ables":3477,"ici":3478,"▁adopt":3479,"▁investment":3480,"▁programmes":3481,"▁Room":3482,"▁vide":3483,"▁built":3484,"inary":3485,"▁EC":3486,"▁amb":3487,"▁Turkey":3488,"▁cross":3489,"▁guest":3490,"▁performance":3491,"▁Co":3492,"▁leading":3493,"▁took":3494,"rast":3495,"erc":3496,"atically":3497,"▁connection":3498,"▁although":3499,"▁coord":3500,"▁complex":3501,"fortun":3502,"▁monitor":3503,"ON":3504,"▁party":3505,"▁concerning":3506,"▁member":3507,"▁Let":3508,"▁writing":3509,"▁reasons":3510,"▁decisions":3511,"▁completely":3512,"▁threat":3513,"▁Government":3514,"▁established":3515,"den":3516,"▁committee":3517,"▁flex":3518,"AN":3519,"▁game":3520,"▁conflic":3521,"▁demonst":3522,"▁model":3523,"▁community":3524,"▁card":3525,"ster":3526,"▁assess":3527,"chan":3528,"▁km":3529,"▁military":3530,"▁Aff":3531,"▁cla":3532,"iable":3533,"▁nothing":3534,"▁Bo":3535,"▁TV":3536,"▁+":3537,"ef":3538,"nces":3539,"▁decl":3540,"▁population":3541,"bour":3542,"UND":3543,"▁agreements":3544,"▁practice":3545,"▁Jan":3546,"▁sent":3547,"▁allows":3548,"▁repl":3549,"▁includes":3550,"▁UN":3551,"▁Since":3552,"▁basic":3553,"▁original":3554,"▁culture":3555,"▁initiative":3556,"▁media":3557,"ones":3558,"▁equipped":3559,"▁body":3560,"▁holiday":3561,"▁separ":3562,"▁fall":3563,"▁becom":3564,"▁wr":3565,"▁depend":3566,"▁speed":3567,"▁upd":3568,"▁Col":3569,"▁fre":3570,"▁advant":3571,"▁tell":3572,"▁objectives":3573,"▁conclus":3574,"▁2006":3575,"▁solid":3576,"▁front":3577,"vert":3578,"cel":3579,"eb":3580,"▁values":3581,"▁half":3582,"iab":3583,",000":3584,"▁star":3585,"▁Lisbon":3586,"▁Ass":3587,"itable":3588,"uted":3589,"▁received":3590,"▁00":3591,"▁Office":3592,"▁jobs":3593,"▁firm":3594,"rag":3595,"▁satis":3596,"ature":3597,"urs":3598,"rael":3599,"oph":3600,"erve":3601,"▁ten":3602,"▁package":3603,"▁South":3604,"unities":3605,"UNDER":3606,"▁applications":3607,"▁Sec":3608,"▁choice":3609,"▁sens":3610,"▁agricultural":3611,"▁confirm":3612,"▁Israel":3613,"▁equipment":3614,"▁files":3615,"▁Court":3616,"▁capac":3617,"▁liber":3618,"▁Just":3619,"▁regarding":3620,"▁Here":3621,"▁benefit":3622,"aches":3623,"▁strateg":3624,"▁##UNDER":3625,"SCORE":3626,"▁##UNDERSCORE":3627,"▁##UNDERSCORE##":3628,"▁English":3629,"▁objective":3630,"▁jud":3631,"▁keyword":3632,"pite":3633,"▁condition":3634,"▁publ":3635,"rary":3636,"▁America":3637,"▁198":3638,"▁Ne":3639,"▁search":3640,"▁doub":3641,"▁efficient":3642,"▁purch":3643,"iddle":3644,"▁reports":3645,"ley":3646,"▁Artic":3647,"▁wat":3648,"▁quickly":3649,"iance":3650,"▁image":3651,"yn":3652,"aging":3653,"▁self":3654,"▁suppl":3655,"anish":3656,"▁impos":3657,"▁aud":3658,"enda":3659,"urb":3660,"▁goods":3661,"vious":3662,"▁Now":3663,"▁style":3664,"ush":3665,"▁print":3666,"▁transfer":3667,"▁dire":3668,"▁simple":3669,"estern":3670,"▁defin":3671,"▁industrial":3672,"▁wa":3673,"▁click":3674,"ee":3675,"▁treatment":3676,"▁below":3677,"▁engine":3678,"▁Fl":3679,"ott":3680,"▁achieved":3681,"▁face":3682,"▁mechan":3683,"▁influ":3684,"uclear":3685,"▁contains":3686,"▁computer":3687,"▁experi":3688,"iveness":3689,"▁sense":3690,"ills":3691,"▁attack":3692,"▁gard":3693,"▁regist":3694,"▁congrat":3695,"more":3696,"amic":3697,"▁huge":3698,"iples":3699,"▁indeed":3700,"▁pleas":3701,"▁rail":3702,"ned":3703,"▁sun":3704,"ying":3705,"▁qual":3706,"▁Affairs":3707,"▁Gree":3708,"▁urg":3709,"sian":3710,"▁Finally":3711,"olute":3712,"▁seems":3713,"▁Amend":3714,"▁internet":3715,"▁cru":3716,"▁oil":3717,"▁popular":3718,"yl":3719,"▁di":3720,"20":3721,"▁vict":3722,"▁carry":3723,"▁Im":3724,"▁successful":3725,"▁dialogue":3726,"raft":3727,"▁leaders":3728,"▁active":3729,"▁recently":3730,"▁cover":3731,"▁beginning":3732,"▁Comp":3733,"ees":3734,"▁dig":3735,"▁stage":3736,"▁answer":3737,"▁June":3738,"just":3739,"ude":3740,"▁presented":3741,"▁highly":3742,"hic":3743,"▁analys":3744,"▁commercial":3745,"aving":3746,"▁comprom":3747,"▁age":3748,"▁scient":3749,"lection":3750,"▁border":3751,"▁series":3752,"▁seek":3753,"▁integration":3754,"▁Gener":3755,"fortunately":3756,"▁Some":3757,"▁warm":3758,"▁everyone":3759,"▁center":3760,"▁levels":3761,"▁consumers":3762,"aid":3763,"heless":3764,"▁famil":3765,"▁carried":3766,"▁Berlin":3767,"▁�":3768,"ges":3769,"olf":3770,"▁bank":3771,"▁cam":3772,"▁increased":3773,"mosp":3774,"▁East":3775,"▁il":3776,"rap":3777,"ched":3778,"▁amendment":3779,"ript":3780,"▁agreed":3781,"▁reviews":3782,"ta":3783,"▁attempt":3784,"▁governments":3785,"▁Pe":3786,"▁origin":3787,"▁Further":3788,"▁office":3789,"▁enlarge":3790,"face":3791,"▁principles":3792,"▁traff":3793,"▁absolute":3794,"▁whose":3795,"▁atmosp":3796,"▁floor":3797,"▁six":3798,"▁supply":3799,"▁Therefore":3800,"▁former":3801,"▁dang":3802,".5":3803,"▁added":3804,"▁choose":3805,"▁furn":3806,"eral":3807,"▁commitment":3808,"resh":3809,"▁Fran":3810,"▁direction":3811,"icro":3812,"▁ste":3813,"▁vir":3814,"▁higher":3815,"▁challeng":3816,"ij":3817,"itect":3818,"▁subsid":3819,"▁perhaps":3820,"▁ord":3821,"▁den":3822,"iles":3823,"▁shows":3824,"alu":3825,"▁shown":3826,"▁Second":3827,"▁nuclear":3828,"orrow":3829,"▁matters":3830,"hens":3831,"▁vehic":3832,"▁asked":3833,"▁reflect":3834,"▁Article":3835,"▁pain":3836,"▁ren":3837,"▁cohe":3838,"▁thanks":3839,"▁tele":3840,"▁relev":3841,"era":3842,"▁avoid":3843,"▁foot":3844,"▁DE":3845,"idered":3846,"▁double":3847,"▁effects":3848,"▁aspects":3849,"▁Dem":3850,"▁max":3851,"▁enable":3852,"▁promote":3853,"iber":3854,"▁stress":3855,"▁consist":3856,"▁23":3857,"▁note":3858,"▁hy":3859,"▁obtain":3860,"▁considered":3861,"▁exchange":3862,"▁size":3863,"race":3864,"▁Ser":3865,"rought":3866,"▁similar":3867,"▁table":3868,"▁latest":3869,"▁altern":3870,"igration":3871,"wise":3872,"▁prepared":3873,"▁opportunities":3874,"itz":3875,"ously":3876,"▁2005":3877,"ania":3878,"▁®":3879,"unch":3880,"▁Social":3881,"▁possibility":3882,"EN":3883,"▁setting":3884,"▁coll":3885,"▁ill":3886,"urch":3887,"uary":3888,"▁behind":3889,"▁Web":3890,"▁materials":3891,"illed":3892,"▁lo":3893,"▁came":3894,"▁reached":3895,"▁Spain":3896,"▁pressure":3897,"▁prim":3898,"▁pan":3899,"▁external":3900,"▁creation":3901,"▁response":3902,"ployment":3903,"▁exhib":3904,"issions":3905,"▁Acc":3906,"ground":3907,"▁40":3908,"▁norm":3909,".0":3910,"rec":3911,"▁Em":3912,"rid":3913,"hest":3914,"▁ut":3915,"▁sustainable":3916,"▁rates":3917,"▁artic":3918,"▁capacity":3919,"▁providing":3920,"ma":3921,"▁lay":3922,"▁wonder":3923,"▁submitted":3924,"▁easily":3925,"▁death":3926,"▁reduce":3927,"▁reject":3928,"encies":3929,"▁decided":3930,"▁Sept":3931,"▁Ab":3932,"ana":3933,"▁red":3934,"arily":3935,"oh":3936,"▁coming":3937,"▁emb":3938,"▁21":3939,"apan":3940,"▁hotels":3941,"▁enlargement":3942,"▁emerg":3943,"▁fit":3944,"▁summer":3945,"▁Val":3946,"nter":3947,"▁ge":3948,"▁precise":3949,"▁atmosphere":3950,"▁priority":3951,"ona":3952,"▁Republic":3953,"▁gives":3954,"la":3955,"inated":3956,"rade":3957,"▁accommodation":3958,"▁actions":3959,"▁love":3960,"▁nice":3961,"▁Central":3962,"▁charg":3963,"cember":3964,"▁details":3965,"OM":3966,"▁Net":3967,"▁Italy":3968,"▁closed":3969,"▁round":3970,"ussion":3971,"▁regular":3972,"▁Wind":3973,"▁Of":3974,"▁San":3975,"▁remains":3976,"▁neigh":3977,"sibilities":3978,"ologies":3979,"▁operation":3980,"▁consumer":3981,"▁funding":3982,"▁board":3983,"▁September":3984,"▁display":3985,"▁December":3986,"chen":3987,"iers":3988,"▁cause":3989,"ira":3990,"▁supported":3991,"▁balance":3992,"omp":3993,"▁2004":3994,"▁Africa":3995,"▁deg":3996,"▁pow":3997,"▁grant":3998,"▁Japan":3999,"▁manufacture":4000,"▁independent":4001,"▁places":4002,"▁Oct":4003,"light":4004,"antly":4005,"ane":4006,"iterran":4007,"▁purpose":4008,"▁$":4009,"istics":4010,"▁sites":4011,"▁bathroom":4012,"ening":4013,"▁billion":4014,"▁fig":4015,"▁architect":4016,"▁leave":4017,"▁Convention":4018,"▁assistance":4019,"▁describ":4020,"▁video":4021,"▁property":4022,"▁conduct":4023,"equ":4024,"▁limited":4025,"iated":4026,"▁Bank":4027,"val":4028,"astic":4029,"▁movement":4030,"etary":4031,"▁conclud":4032,"▁appear":4033,"ores":4034,"▁forms":4035,"▁Tod":4036,"ober":4037,"▁charge":4038,"▁regulations":4039,"ume":4040,"▁prepar":4041,"iterranean":4042,"▁adap":4043,"▁creating":4044,"ift":4045,"▁categories":4046,"gen":4047,"▁rule":4048,"ese":4049,"▁March":4050,"arth":4051,"▁pleased":4052,"▁relevant":4053,"▁brought":4054,"▁produced":4055,"▁flow":4056,"pid":4057,"▁Tra":4058,"▁fa":4059,"▁Che":4060,"▁Per":4061,"▁largest":4062,"▁green":4063,"▁credit":4064,"▁organis":4065,"▁spir":4066,"▁fisher":4067,"▁territ":4068,"ief":4069,"▁January":4070,"▁lic":4071,"oll":4072,"▁construction":4073,"▁acqu":4074,"ream":4075,"▁else":4076,"▁compre":4077,"▁II":4078,"▁exec":4079,"iciency":4080,"▁discussion":4081,"▁Book":4082,"ote":4083,"▁measure":4084,"where":4085,"▁variety":4086,"50":4087,"ging":4088,"▁message":4089,"▁conference":4090,"▁Develop":4091,"▁Trans":4092,"imately":4093,"▁deep":4094,"▁except":4095,"iture":4096,"▁thous":4097,"uff":4098,"▁instead":4099,"▁source":4100,"aries":4101,"▁Cons":4102,"dom":4103,"▁October":4104,"▁friends":4105,"▁fishing":4106,"ES":4107,"▁became":4108,"▁Mediterranean":4109,"▁Italian":4110,"▁stability":4111,"▁Car":4112,"▁pros":4113,"▁El":4114,"▁repe":4115,"▁train":4116,"▁obvious":4117,"▁interesting":4118,"raq":4119,"ronic":4120,"▁regards":4121,"▁ways":4122,"burg":4123,"▁2003":4124,"IT":4125,"▁wood":4126,"▁relationship":4127,"▁parliament":4128,"▁started":4129,"▁guid":4130,"umb":4131,"▁National":4132,"▁dut":4133,"▁Minister":4134,"▁procedures":4135,"prise":4136,"▁British":4137,"▁compromise":4138,"▁produce":4139,"▁medium":4140,"lands":4141,"▁Service":4142,"▁task":4143,"▁steps":4144,".2":4145,"▁Today":4146,"▁compon":4147,"▁hous":4148,"▁bit":4149,"ties":4150,"▁depart":4151,"▁allowed":4152,"▁activity":4153,"▁study":4154,"▁option":4155,"gar":4156,"▁contribution":4157,"▁prob":4158,"▁base":4159,"aily":4160,"elling":4161,"▁Park":4162,"▁Every":4163,".1":4164,"▁Sl":4165,"org":4166,"▁North":4167,"▁partner":4168,"▁jour":4169,"▁status":4170,"rol":4171,"▁provisions":4172,"▁optim":4173,"▁exact":4174,"▁22":4175,"▁Ge":4176,"▁instruments":4177,"▁written":4178,"▁damage":4179,"porary":4180,"▁giving":4181,"yond":4182,"▁relation":4183,"▁purs":4184,"▁coast":4185,