<?xml version="1.0" ?>
<net batch="1" name="pytorch" version="4">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul1_/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="L0000_Conv2d-back_bone_seq.conv1_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24" size="3456"/>
				<biases offset="3480" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="L0001_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="L0002_Conv2d-back_bone_seq.conv2_1_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3608" size="1152"/>
				<biases offset="4760" size="128"/>
			</blobs>
		</layer>
		<layer id="5" name="L0003_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="L0004_Conv2d-back_bone_seq.conv2_1_sep_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="56" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4888" size="7168"/>
				<biases offset="12056" size="224"/>
			</blobs>
		</layer>
		<layer id="7" name="L0005_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="L0006_Conv2d-back_bone_seq.conv2_2_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="56" kernel="3,3" output="56" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12280" size="2016"/>
				<biases offset="14296" size="224"/>
			</blobs>
		</layer>
		<layer id="9" name="Copy_L0008_ActivationBin-back_bone_seq.conv2_2_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="10" name="Copy_L0008_ActivationBin-back_bone_seq.conv2_2_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1058_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="11" name="702_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="12" name="704_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="13" name="L0008_ActivationBin-back_bone_seq.conv2_2_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="L0009_Conv2d-back_bone_seq.conv2_2_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="56" kernel="1,1" mode="xnor-popcount" output="112" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14528" size="784"/>
			</blobs>
		</layer>
		<layer id="15" name="L0009_Conv2d-back_bone_seq.conv2_2_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15312" size="448"/>
				<biases offset="15760" size="448"/>
			</blobs>
		</layer>
		<layer id="16" name="L0010_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="L0011_Conv2d-back_bone_seq.conv3_1_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="112" kernel="3,3" output="112" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16208" size="4032"/>
				<biases offset="20240" size="448"/>
			</blobs>
		</layer>
		<layer id="18" name="Copy_L0013_ActivationBin-back_bone_seq.conv3_1_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="Copy_L0013_ActivationBin-back_bone_seq.conv3_1_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1046_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="20" name="678_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="21" name="680_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="22" name="L0013_ActivationBin-back_bone_seq.conv3_1_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="L0014_Conv2d-back_bone_seq.conv3_1_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="112" kernel="1,1" mode="xnor-popcount" output="112" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="20688" size="1568"/>
			</blobs>
		</layer>
		<layer id="24" name="L0014_Conv2d-back_bone_seq.conv3_1_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="22256" size="448"/>
				<biases offset="22704" size="448"/>
			</blobs>
		</layer>
		<layer id="25" name="L0015_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="L0016_Conv2d-back_bone_seq.conv3_2_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="112" kernel="3,3" output="112" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="23152" size="4032"/>
				<biases offset="27184" size="448"/>
			</blobs>
		</layer>
		<layer id="27" name="Copy_L0018_ActivationBin-back_bone_seq.conv3_2_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="28" name="Copy_L0018_ActivationBin-back_bone_seq.conv3_2_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1054_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="29" name="646_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="30" name="648_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="31" name="L0018_ActivationBin-back_bone_seq.conv3_2_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="L0019_Conv2d-back_bone_seq.conv3_2_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="112" kernel="1,1" mode="xnor-popcount" output="208" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="27632" size="2912"/>
			</blobs>
		</layer>
		<layer id="33" name="L0019_Conv2d-back_bone_seq.conv3_2_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30544" size="832"/>
				<biases offset="31376" size="832"/>
			</blobs>
		</layer>
		<layer id="34" name="L0020_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="L0021_Conv2d-back_bone_seq.conv4_1_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="208" kernel="3,3" output="208" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="32208" size="7488"/>
				<biases offset="39696" size="832"/>
			</blobs>
		</layer>
		<layer id="36" name="Copy_L0023_ActivationBin-back_bone_seq.conv4_1_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="37" name="Copy_L0023_ActivationBin-back_bone_seq.conv4_1_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1052_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="38" name="662_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="39" name="664_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="L0023_ActivationBin-back_bone_seq.conv4_1_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="L0024_Conv2d-back_bone_seq.conv4_1_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="208" kernel="1,1" mode="xnor-popcount" output="216" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="40528" size="5616"/>
			</blobs>
		</layer>
		<layer id="42" name="L0024_Conv2d-back_bone_seq.conv4_1_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="46144" size="864"/>
				<biases offset="47008" size="864"/>
			</blobs>
		</layer>
		<layer id="43" name="L0025_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="L0026_Conv2d-back_bone_seq.conv4_2_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="216" kernel="3,3" output="216" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>216</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="47872" size="7776"/>
				<biases offset="55648" size="864"/>
			</blobs>
		</layer>
		<layer id="45" name="Copy_L0028_ActivationBin-back_bone_seq.conv4_2_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="46" name="Copy_L0028_ActivationBin-back_bone_seq.conv4_2_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1064_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="47" name="694_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="48" name="696_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="49" name="L0028_ActivationBin-back_bone_seq.conv4_2_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>216</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="L0029_Conv2d-back_bone_seq.conv4_2_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="216" kernel="1,1" mode="xnor-popcount" output="328" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="56512" size="8856"/>
			</blobs>
		</layer>
		<layer id="51" name="L0029_Conv2d-back_bone_seq.conv4_2_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="65368" size="1312"/>
				<biases offset="66680" size="1312"/>
			</blobs>
		</layer>
		<layer id="52" name="L0030_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="L0031_Conv2d-back_bone_seq.conv5_1_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="328" kernel="3,3" output="328" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="67992" size="11808"/>
				<biases offset="79800" size="1312"/>
			</blobs>
		</layer>
		<layer id="54" name="Copy_L0033_ActivationBin-back_bone_seq.conv5_1_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="55" name="Copy_L0033_ActivationBin-back_bone_seq.conv5_1_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1060_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="56" name="710_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="57" name="712_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="58" name="L0033_ActivationBin-back_bone_seq.conv5_1_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="L0034_Conv2d-back_bone_seq.conv5_1_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="328" kernel="1,1" mode="xnor-popcount" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="81112" size="11808"/>
			</blobs>
		</layer>
		<layer id="60" name="L0034_Conv2d-back_bone_seq.conv5_1_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="92920" size="1152"/>
				<biases offset="94072" size="1152"/>
			</blobs>
		</layer>
		<layer id="61" name="L0035_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="L0036_Conv2d-back_bone_seq.conv5_2_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="95224" size="10368"/>
				<biases offset="105592" size="1152"/>
			</blobs>
		</layer>
		<layer id="63" name="Copy_L0038_ActivationBin-back_bone_seq.conv5_2_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="64" name="Copy_L0038_ActivationBin-back_bone_seq.conv5_2_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1062_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="65" name="686_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="66" name="688_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="L0038_ActivationBin-back_bone_seq.conv5_2_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="L0039_Conv2d-back_bone_seq.conv5_2_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="288" kernel="1,1" mode="xnor-popcount" output="288" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="106744" size="10368"/>
			</blobs>
		</layer>
		<layer id="69" name="L0039_Conv2d-back_bone_seq.conv5_2_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="117112" size="1152"/>
				<biases offset="118264" size="1152"/>
			</blobs>
		</layer>
		<layer id="70" name="L0040_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="L0041_Conv2d-back_bone_seq.conv5_3_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="119416" size="10368"/>
				<biases offset="129784" size="1152"/>
			</blobs>
		</layer>
		<layer id="72" name="Copy_L0043_ActivationBin-back_bone_seq.conv5_3_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="73" name="Copy_L0043_ActivationBin-back_bone_seq.conv5_3_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1066_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="74" name="630_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="75" name="632_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="76" name="L0043_ActivationBin-back_bone_seq.conv5_3_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="L0044_Conv2d-back_bone_seq.conv5_3_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="288" kernel="1,1" mode="xnor-popcount" output="240" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="130936" size="8640"/>
			</blobs>
		</layer>
		<layer id="78" name="L0044_Conv2d-back_bone_seq.conv5_3_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="139576" size="960"/>
				<biases offset="140536" size="960"/>
			</blobs>
		</layer>
		<layer id="79" name="L0045_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="L0046_Conv2d-back_bone_seq.conv5_4_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="240" kernel="3,3" output="240" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="141496" size="8640"/>
				<biases offset="150136" size="960"/>
			</blobs>
		</layer>
		<layer id="81" name="Copy_L0048_ActivationBin-back_bone_seq.conv5_4_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="82" name="Copy_L0048_ActivationBin-back_bone_seq.conv5_4_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1056_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="83" name="670_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="84" name="672_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="85" name="L0048_ActivationBin-back_bone_seq.conv5_4_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="L0049_Conv2d-back_bone_seq.conv5_4_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="240" kernel="1,1" mode="xnor-popcount" output="264" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="151096" size="7920"/>
			</blobs>
		</layer>
		<layer id="87" name="L0049_Conv2d-back_bone_seq.conv5_4_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="159016" size="1056"/>
				<biases offset="160072" size="1056"/>
			</blobs>
		</layer>
		<layer id="88" name="L0050_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="L0051_Conv2d-back_bone_seq.conv5_5_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="264" kernel="3,3" output="264" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="161128" size="9504"/>
				<biases offset="170632" size="1056"/>
			</blobs>
		</layer>
		<layer id="90" name="Copy_L0053_ActivationBin-back_bone_seq.conv5_5_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="91" name="Copy_L0053_ActivationBin-back_bone_seq.conv5_5_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1048_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="92" name="654_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="93" name="656_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="94" name="L0053_ActivationBin-back_bone_seq.conv5_5_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="L0054_Conv2d-back_bone_seq.conv5_5_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="264" kernel="1,1" mode="xnor-popcount" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="171688" size="6336"/>
			</blobs>
		</layer>
		<layer id="96" name="L0054_Conv2d-back_bone_seq.conv5_5_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="178024" size="768"/>
				<biases offset="178792" size="768"/>
			</blobs>
		</layer>
		<layer id="97" name="L0055_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="L0056_Conv2d-loc_seq.conv4_3_0_norm_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="179560" size="110592"/>
				<biases offset="290152" size="64"/>
			</blobs>
		</layer>
		<layer id="99" name="conv4_3_0_norm_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv4_3_0_norm_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="L0057_Conv2d-loc_seq.conv4_3_norm_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="290216" size="110592"/>
				<biases offset="400808" size="64"/>
			</blobs>
		</layer>
		<layer id="102" name="conv4_3_norm_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv4_3_norm_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="L0058_Conv2d-back_bone_seq.conv5_6_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="400872" size="6912"/>
				<biases offset="407784" size="768"/>
			</blobs>
		</layer>
		<layer id="105" name="Copy_L0060_ActivationBin-back_bone_seq.conv5_6_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="106" name="Copy_L0060_ActivationBin-back_bone_seq.conv5_6_sep_relubin_bin_conv_BIN01/Input_1/Output_0/Data_1050_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="107" name="638_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14520" size="4"/>
			</blobs>
		</layer>
		<layer id="108" name="640_const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="14524" size="4"/>
			</blobs>
		</layer>
		<layer id="109" name="L0060_ActivationBin-back_bone_seq.conv5_6_sep_relubin_bin_conv_BIN01/Quantize_" precision="FP32" type="Quantize">
			<data levels="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="L0061_Conv2d-back_bone_seq.conv5_6_sep-BIN" precision="FP32" type="BinaryConvolution">
			<data dilations="1,1" group="1" input="192" kernel="1,1" mode="xnor-popcount" output="208" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="408552" size="4992"/>
			</blobs>
		</layer>
		<layer id="111" name="L0061_Conv2d-back_bone_seq.conv5_6_sep-BINMul/After/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="413544" size="832"/>
				<biases offset="414376" size="832"/>
			</blobs>
		</layer>
		<layer id="112" name="L0062_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="L0063_Conv2d-back_bone_seq.conv6_dw_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="208" kernel="3,3" output="208" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="415208" size="7488"/>
				<biases offset="422696" size="832"/>
			</blobs>
		</layer>
		<layer id="114" name="L0064_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="L0065_Conv2d-back_bone_seq.conv6_sep_BN" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="423528" size="73216"/>
				<biases offset="496744" size="352"/>
			</blobs>
		</layer>
		<layer id="116" name="L0066_ReLU-back_bone_seq.conv1_relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="L0067_Conv2d-loc_seq.fc7_0_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="497096" size="76032"/>
