name: "RMNetAngular"
layer {
name: "data"
type: "Input"
top: "data"
input_param: { shape: {dim: 1 dim: 3 dim: 128 dim: 128} }
}

layer {
    name: "BatchNormBackward_1_bn"
    type: "BatchNorm"
    bottom: "data"
    top: "ConvNdBackward_0"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_1_scale"
    type: "Scale"
    bottom: "ConvNdBackward_0"
    top: "ConvNdBackward_0"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "ConvNdBackward_2"
    type: "Convolution"
    bottom: "ConvNdBackward_0"
    top: "ConvNdBackward_2"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_3_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_2"
    top: "ConvNdBackward_2"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_3_scale"
    type: "Scale"
    bottom: "ConvNdBackward_2"
    top: "ConvNdBackward_2"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "ThresholdBackward_4"
    type: "ReLU"
    bottom: "ConvNdBackward_2"
    top: "ConvNdBackward_2"
}
layer {
    name: "ConvNdBackward_5"
    type: "Convolution"
    bottom: "ConvNdBackward_2"
    top: "ConvNdBackward_5"
    convolution_param {
        num_output: 8
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_6_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_5"
    top: "ConvNdBackward_5"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_6_scale"
    type: "Scale"
    bottom: "ConvNdBackward_5"
    top: "ConvNdBackward_5"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_7"
    type: "ELU"
    bottom: "ConvNdBackward_5"
    top: "ConvNdBackward_5"
}
layer {
    name: "ConvNdBackward_8"
    type: "Convolution"
    bottom: "ConvNdBackward_5"
    top: "ConvNdBackward_8"
    convolution_param {
        num_output: 8
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 8
    }
}
layer {
    name: "BatchNormBackward_9_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_8"
    top: "ConvNdBackward_8"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_9_scale"
    type: "Scale"
    bottom: "ConvNdBackward_8"
    top: "ConvNdBackward_8"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_10"
    type: "ELU"
    bottom: "ConvNdBackward_8"
    top: "ConvNdBackward_8"
}
layer {
    name: "ConvNdBackward_11"
    type: "Convolution"
    bottom: "ConvNdBackward_8"
    top: "ConvNdBackward_11"
    convolution_param {
        num_output: 32
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_12_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_11"
    top: "ConvNdBackward_11"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_12_scale"
    type: "Scale"
    bottom: "ConvNdBackward_11"
    top: "ConvNdBackward_11"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_13"
    type: "Dropout"
    bottom: "ConvNdBackward_11"
    top: "ConvNdBackward_11"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_15"
    type: "Eltwise"
    bottom: "ConvNdBackward_11"
    bottom: "ConvNdBackward_2"
    top: "AddBackward1_15"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_16"
    type: "ELU"
    bottom: "AddBackward1_15"
    top: "AddBackward1_15"
}
layer {
    name: "ConvNdBackward_17"
    type: "Convolution"
    bottom: "AddBackward1_15"
    top: "ConvNdBackward_17"
    convolution_param {
        num_output: 8
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_18_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_17"
    top: "ConvNdBackward_17"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_18_scale"
    type: "Scale"
    bottom: "ConvNdBackward_17"
    top: "ConvNdBackward_17"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_19"
    type: "ELU"
    bottom: "ConvNdBackward_17"
    top: "ConvNdBackward_17"
}
layer {
    name: "ConvNdBackward_20"
    type: "Convolution"
    bottom: "ConvNdBackward_17"
    top: "ConvNdBackward_20"
    convolution_param {
        num_output: 8
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 8
    }
}
layer {
    name: "BatchNormBackward_21_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_20"
    top: "ConvNdBackward_20"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_21_scale"
    type: "Scale"
    bottom: "ConvNdBackward_20"
    top: "ConvNdBackward_20"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_22"
    type: "ELU"
    bottom: "ConvNdBackward_20"
    top: "ConvNdBackward_20"
}
layer {
    name: "ConvNdBackward_23"
    type: "Convolution"
    bottom: "ConvNdBackward_20"
    top: "ConvNdBackward_23"
    convolution_param {
        num_output: 32
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_24_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_23"
    top: "ConvNdBackward_23"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_24_scale"
    type: "Scale"
    bottom: "ConvNdBackward_23"
    top: "ConvNdBackward_23"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_25"
    type: "Dropout"
    bottom: "ConvNdBackward_23"
    top: "ConvNdBackward_23"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_27"
    type: "Eltwise"
    bottom: "ConvNdBackward_23"
    bottom: "AddBackward1_15"
    top: "AddBackward1_27"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_28"
    type: "ELU"
    bottom: "AddBackward1_27"
    top: "AddBackward1_27"
}
layer {
    name: "ConvNdBackward_29"
    type: "Convolution"
    bottom: "AddBackward1_27"
    top: "ConvNdBackward_29"
    convolution_param {
        num_output: 8
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_30_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_29"
    top: "ConvNdBackward_29"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_30_scale"
    type: "Scale"
    bottom: "ConvNdBackward_29"
    top: "ConvNdBackward_29"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_31"
    type: "ELU"
    bottom: "ConvNdBackward_29"
    top: "ConvNdBackward_29"
}
layer {
    name: "ConvNdBackward_32"
    type: "Convolution"
    bottom: "ConvNdBackward_29"
    top: "ConvNdBackward_32"
    convolution_param {
        num_output: 8
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 8
    }
}
layer {
    name: "BatchNormBackward_33_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_32"
    top: "ConvNdBackward_32"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_33_scale"
    type: "Scale"
    bottom: "ConvNdBackward_32"
    top: "ConvNdBackward_32"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_34"
    type: "ELU"
    bottom: "ConvNdBackward_32"
    top: "ConvNdBackward_32"
}
layer {
    name: "ConvNdBackward_35"
    type: "Convolution"
    bottom: "ConvNdBackward_32"
    top: "ConvNdBackward_35"
    convolution_param {
        num_output: 32
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_36_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_35"
    top: "ConvNdBackward_35"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_36_scale"
    type: "Scale"
    bottom: "ConvNdBackward_35"
    top: "ConvNdBackward_35"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_37"
    type: "Dropout"
    bottom: "ConvNdBackward_35"
    top: "ConvNdBackward_35"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_39"
    type: "Eltwise"
    bottom: "ConvNdBackward_35"
    bottom: "AddBackward1_27"
    top: "AddBackward1_39"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_40"
    type: "ELU"
    bottom: "AddBackward1_39"
    top: "AddBackward1_39"
}
layer {
    name: "ConvNdBackward_41"
    type: "Convolution"
    bottom: "AddBackward1_39"
    top: "ConvNdBackward_41"
    convolution_param {
        num_output: 8
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_42_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_41"
    top: "ConvNdBackward_41"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_42_scale"
    type: "Scale"
    bottom: "ConvNdBackward_41"
    top: "ConvNdBackward_41"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_43"
    type: "ELU"
    bottom: "ConvNdBackward_41"
    top: "ConvNdBackward_41"
}
layer {
    name: "ConvNdBackward_44"
    type: "Convolution"
    bottom: "ConvNdBackward_41"
    top: "ConvNdBackward_44"
    convolution_param {
        num_output: 8
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 8
    }
}
layer {
    name: "BatchNormBackward_45_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_44"
    top: "ConvNdBackward_44"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_45_scale"
    type: "Scale"
    bottom: "ConvNdBackward_44"
    top: "ConvNdBackward_44"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_46"
    type: "ELU"
    bottom: "ConvNdBackward_44"
    top: "ConvNdBackward_44"
}
layer {
    name: "ConvNdBackward_47"
    type: "Convolution"
    bottom: "ConvNdBackward_44"
    top: "ConvNdBackward_47"
    convolution_param {
        num_output: 32
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_48_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_47"
    top: "ConvNdBackward_47"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_48_scale"
    type: "Scale"
    bottom: "ConvNdBackward_47"
    top: "ConvNdBackward_47"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_49"
    type: "Dropout"
    bottom: "ConvNdBackward_47"
    top: "ConvNdBackward_47"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_51"
    type: "Eltwise"
    bottom: "ConvNdBackward_47"
    bottom: "AddBackward1_39"
    top: "AddBackward1_51"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_52"
    type: "ELU"
    bottom: "AddBackward1_51"
    top: "AddBackward1_51"
}
layer {
    name: "ConvNdBackward_53"
    type: "Convolution"
    bottom: "AddBackward1_51"
    top: "ConvNdBackward_53"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_54_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_53"
    top: "ConvNdBackward_53"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_54_scale"
    type: "Scale"
    bottom: "ConvNdBackward_53"
    top: "ConvNdBackward_53"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_55"
    type: "ELU"
    bottom: "ConvNdBackward_53"
    top: "ConvNdBackward_53"
}
layer {
    name: "ConvNdBackward_56"
    type: "Convolution"
    bottom: "ConvNdBackward_53"
    top: "ConvNdBackward_56"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_57_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_56"
    top: "ConvNdBackward_56"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_57_scale"
    type: "Scale"
    bottom: "ConvNdBackward_56"
    top: "ConvNdBackward_56"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_58"
    type: "ELU"
    bottom: "ConvNdBackward_56"
    top: "ConvNdBackward_56"
}
layer {
    name: "ConvNdBackward_59"
    type: "Convolution"
    bottom: "ConvNdBackward_56"
    top: "ConvNdBackward_59"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_60_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_59"
    top: "ConvNdBackward_59"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_60_scale"
    type: "Scale"
    bottom: "ConvNdBackward_59"
    top: "ConvNdBackward_59"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_61"
    type: "Dropout"
    bottom: "ConvNdBackward_59"
    top: "ConvNdBackward_59"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "MaxPool2DBackward_63"
    type: "Pooling"
    bottom: "AddBackward1_51"
    top: "MaxPool2DBackward_63"
    pooling_param {
        pool: MAX
        kernel_size: 2
        stride: 2
        pad: 0
    }
}
layer {
    name: "ConvNdBackward_64"
    type: "Convolution"
    bottom: "MaxPool2DBackward_63"
    top: "ConvNdBackward_64"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_65_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_64"
    top: "ConvNdBackward_64"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_65_scale"
    type: "Scale"
    bottom: "ConvNdBackward_64"
    top: "ConvNdBackward_64"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "AddBackward1_66"
    type: "Eltwise"
    bottom: "ConvNdBackward_59"
    bottom: "ConvNdBackward_64"
    top: "AddBackward1_66"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_67"
    type: "ELU"
    bottom: "AddBackward1_66"
    top: "AddBackward1_66"
}
layer {
    name: "ConvNdBackward_68"
    type: "Convolution"
    bottom: "AddBackward1_66"
    top: "ConvNdBackward_68"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_69_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_68"
    top: "ConvNdBackward_68"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_69_scale"
    type: "Scale"
    bottom: "ConvNdBackward_68"
    top: "ConvNdBackward_68"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_70"
    type: "ELU"
    bottom: "ConvNdBackward_68"
    top: "ConvNdBackward_68"
}
layer {
    name: "ConvNdBackward_71"
    type: "Convolution"
    bottom: "ConvNdBackward_68"
    top: "ConvNdBackward_71"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_72_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_71"
    top: "ConvNdBackward_71"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_72_scale"
    type: "Scale"
    bottom: "ConvNdBackward_71"
    top: "ConvNdBackward_71"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_73"
    type: "ELU"
    bottom: "ConvNdBackward_71"
    top: "ConvNdBackward_71"
}
layer {
    name: "ConvNdBackward_74"
    type: "Convolution"
    bottom: "ConvNdBackward_71"
    top: "ConvNdBackward_74"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_75_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_74"
    top: "ConvNdBackward_74"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_75_scale"
    type: "Scale"
    bottom: "ConvNdBackward_74"
    top: "ConvNdBackward_74"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_76"
    type: "Dropout"
    bottom: "ConvNdBackward_74"
    top: "ConvNdBackward_74"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_78"
    type: "Eltwise"
    bottom: "ConvNdBackward_74"
    bottom: "AddBackward1_66"
    top: "AddBackward1_78"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_79"
    type: "ELU"
    bottom: "AddBackward1_78"
    top: "AddBackward1_78"
}
layer {
    name: "ConvNdBackward_80"
    type: "Convolution"
    bottom: "AddBackward1_78"
    top: "ConvNdBackward_80"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_81_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_80"
    top: "ConvNdBackward_80"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_81_scale"
    type: "Scale"
    bottom: "ConvNdBackward_80"
    top: "ConvNdBackward_80"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_82"
    type: "ELU"
    bottom: "ConvNdBackward_80"
    top: "ConvNdBackward_80"
}
layer {
    name: "ConvNdBackward_83"
    type: "Convolution"
    bottom: "ConvNdBackward_80"
    top: "ConvNdBackward_83"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_84_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_83"
    top: "ConvNdBackward_83"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_84_scale"
    type: "Scale"
    bottom: "ConvNdBackward_83"
    top: "ConvNdBackward_83"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_85"
    type: "ELU"
    bottom: "ConvNdBackward_83"
    top: "ConvNdBackward_83"
}
layer {
    name: "ConvNdBackward_86"
    type: "Convolution"
    bottom: "ConvNdBackward_83"
    top: "ConvNdBackward_86"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_87_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_86"
    top: "ConvNdBackward_86"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_87_scale"
    type: "Scale"
    bottom: "ConvNdBackward_86"
    top: "ConvNdBackward_86"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_88"
    type: "Dropout"
    bottom: "ConvNdBackward_86"
    top: "ConvNdBackward_86"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_90"
    type: "Eltwise"
    bottom: "ConvNdBackward_86"
    bottom: "AddBackward1_78"
    top: "AddBackward1_90"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_91"
    type: "ELU"
    bottom: "AddBackward1_90"
    top: "AddBackward1_90"
}
layer {
    name: "ConvNdBackward_92"
    type: "Convolution"
    bottom: "AddBackward1_90"
    top: "ConvNdBackward_92"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_93_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_92"
    top: "ConvNdBackward_92"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_93_scale"
    type: "Scale"
    bottom: "ConvNdBackward_92"
    top: "ConvNdBackward_92"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_94"
    type: "ELU"
    bottom: "ConvNdBackward_92"
    top: "ConvNdBackward_92"
}
layer {
    name: "ConvNdBackward_95"
    type: "Convolution"
    bottom: "ConvNdBackward_92"
    top: "ConvNdBackward_95"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_96_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_95"
    top: "ConvNdBackward_95"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_96_scale"
    type: "Scale"
    bottom: "ConvNdBackward_95"
    top: "ConvNdBackward_95"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_97"
    type: "ELU"
    bottom: "ConvNdBackward_95"
    top: "ConvNdBackward_95"
}
layer {
    name: "ConvNdBackward_98"
    type: "Convolution"
    bottom: "ConvNdBackward_95"
    top: "ConvNdBackward_98"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_99_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_98"
    top: "ConvNdBackward_98"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_99_scale"
    type: "Scale"
    bottom: "ConvNdBackward_98"
    top: "ConvNdBackward_98"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_100"
    type: "Dropout"
    bottom: "ConvNdBackward_98"
    top: "ConvNdBackward_98"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_102"
    type: "Eltwise"
    bottom: "ConvNdBackward_98"
    bottom: "AddBackward1_90"
    top: "AddBackward1_102"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_103"
    type: "ELU"
    bottom: "AddBackward1_102"
    top: "AddBackward1_102"
}
layer {
    name: "ConvNdBackward_104"
    type: "Convolution"
    bottom: "AddBackward1_102"
    top: "ConvNdBackward_104"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_105_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_104"
    top: "ConvNdBackward_104"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_105_scale"
    type: "Scale"
    bottom: "ConvNdBackward_104"
    top: "ConvNdBackward_104"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_106"
    type: "ELU"
    bottom: "ConvNdBackward_104"
    top: "ConvNdBackward_104"
}
layer {
    name: "ConvNdBackward_107"
    type: "Convolution"
    bottom: "ConvNdBackward_104"
    top: "ConvNdBackward_107"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_108_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_107"
    top: "ConvNdBackward_107"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_108_scale"
    type: "Scale"
    bottom: "ConvNdBackward_107"
    top: "ConvNdBackward_107"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_109"
    type: "ELU"
    bottom: "ConvNdBackward_107"
    top: "ConvNdBackward_107"
}
layer {
    name: "ConvNdBackward_110"
    type: "Convolution"
    bottom: "ConvNdBackward_107"
    top: "ConvNdBackward_110"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_111_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_110"
    top: "ConvNdBackward_110"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_111_scale"
    type: "Scale"
    bottom: "ConvNdBackward_110"
    top: "ConvNdBackward_110"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_112"
    type: "Dropout"
    bottom: "ConvNdBackward_110"
    top: "ConvNdBackward_110"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_114"
    type: "Eltwise"
    bottom: "ConvNdBackward_110"
    bottom: "AddBackward1_102"
    top: "AddBackward1_114"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_115"
    type: "ELU"
    bottom: "AddBackward1_114"
    top: "AddBackward1_114"
}
layer {
    name: "ConvNdBackward_116"
    type: "Convolution"
    bottom: "AddBackward1_114"
    top: "ConvNdBackward_116"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_117_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_116"
    top: "ConvNdBackward_116"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_117_scale"
    type: "Scale"
    bottom: "ConvNdBackward_116"
    top: "ConvNdBackward_116"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_118"
    type: "ELU"
    bottom: "ConvNdBackward_116"
    top: "ConvNdBackward_116"
}
layer {
    name: "ConvNdBackward_119"
    type: "Convolution"
    bottom: "ConvNdBackward_116"
    top: "ConvNdBackward_119"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_120_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_119"
    top: "ConvNdBackward_119"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_120_scale"
    type: "Scale"
    bottom: "ConvNdBackward_119"
    top: "ConvNdBackward_119"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_121"
    type: "ELU"
    bottom: "ConvNdBackward_119"
    top: "ConvNdBackward_119"
}
layer {
    name: "ConvNdBackward_122"
    type: "Convolution"
    bottom: "ConvNdBackward_119"
    top: "ConvNdBackward_122"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_123_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_122"
    top: "ConvNdBackward_122"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_123_scale"
    type: "Scale"
    bottom: "ConvNdBackward_122"
    top: "ConvNdBackward_122"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_124"
    type: "Dropout"
    bottom: "ConvNdBackward_122"
    top: "ConvNdBackward_122"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_126"
    type: "Eltwise"
    bottom: "ConvNdBackward_122"
    bottom: "AddBackward1_114"
    top: "AddBackward1_126"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_127"
    type: "ELU"
    bottom: "AddBackward1_126"
    top: "AddBackward1_126"
}
layer {
    name: "ConvNdBackward_128"
    type: "Convolution"
    bottom: "AddBackward1_126"
    top: "ConvNdBackward_128"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_129_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_128"
    top: "ConvNdBackward_128"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_129_scale"
    type: "Scale"
    bottom: "ConvNdBackward_128"
    top: "ConvNdBackward_128"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_130"
    type: "ELU"
    bottom: "ConvNdBackward_128"
    top: "ConvNdBackward_128"
}
layer {
    name: "ConvNdBackward_131"
    type: "Convolution"
    bottom: "ConvNdBackward_128"
    top: "ConvNdBackward_131"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_132_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_131"
    top: "ConvNdBackward_131"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_132_scale"
    type: "Scale"
    bottom: "ConvNdBackward_131"
    top: "ConvNdBackward_131"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_133"
    type: "ELU"
    bottom: "ConvNdBackward_131"
    top: "ConvNdBackward_131"
}
layer {
    name: "ConvNdBackward_134"
    type: "Convolution"
    bottom: "ConvNdBackward_131"
    top: "ConvNdBackward_134"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_135_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_134"
    top: "ConvNdBackward_134"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_135_scale"
    type: "Scale"
    bottom: "ConvNdBackward_134"
    top: "ConvNdBackward_134"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_136"
    type: "Dropout"
    bottom: "ConvNdBackward_134"
    top: "ConvNdBackward_134"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_138"
    type: "Eltwise"
    bottom: "ConvNdBackward_134"
    bottom: "AddBackward1_126"
    top: "AddBackward1_138"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_139"
    type: "ELU"
    bottom: "AddBackward1_138"
    top: "AddBackward1_138"
}
layer {
    name: "ConvNdBackward_140"
    type: "Convolution"
    bottom: "AddBackward1_138"
    top: "ConvNdBackward_140"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_141_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_140"
    top: "ConvNdBackward_140"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_141_scale"
    type: "Scale"
    bottom: "ConvNdBackward_140"
    top: "ConvNdBackward_140"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_142"
    type: "ELU"
    bottom: "ConvNdBackward_140"
    top: "ConvNdBackward_140"
}
layer {
    name: "ConvNdBackward_143"
    type: "Convolution"
    bottom: "ConvNdBackward_140"
    top: "ConvNdBackward_143"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_144_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_143"
    top: "ConvNdBackward_143"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_144_scale"
    type: "Scale"
    bottom: "ConvNdBackward_143"
    top: "ConvNdBackward_143"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_145"
    type: "ELU"
    bottom: "ConvNdBackward_143"
    top: "ConvNdBackward_143"
}
layer {
    name: "ConvNdBackward_146"
    type: "Convolution"
    bottom: "ConvNdBackward_143"
    top: "ConvNdBackward_146"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_147_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_146"
    top: "ConvNdBackward_146"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_147_scale"
    type: "Scale"
    bottom: "ConvNdBackward_146"
    top: "ConvNdBackward_146"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_148"
    type: "Dropout"
    bottom: "ConvNdBackward_146"
    top: "ConvNdBackward_146"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_150"
    type: "Eltwise"
    bottom: "ConvNdBackward_146"
    bottom: "AddBackward1_138"
    top: "AddBackward1_150"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_151"
    type: "ELU"
    bottom: "AddBackward1_150"
    top: "AddBackward1_150"
}
layer {
    name: "ConvNdBackward_152"
    type: "Convolution"
    bottom: "AddBackward1_150"
    top: "ConvNdBackward_152"
    convolution_param {
        num_output: 16
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_153_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_152"
    top: "ConvNdBackward_152"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_153_scale"
    type: "Scale"
    bottom: "ConvNdBackward_152"
    top: "ConvNdBackward_152"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_154"
    type: "ELU"
    bottom: "ConvNdBackward_152"
    top: "ConvNdBackward_152"
}
layer {
    name: "ConvNdBackward_155"
    type: "Convolution"
    bottom: "ConvNdBackward_152"
    top: "ConvNdBackward_155"
    convolution_param {
        num_output: 16
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 16
    }
}
layer {
    name: "BatchNormBackward_156_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_155"
    top: "ConvNdBackward_155"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_156_scale"
    type: "Scale"
    bottom: "ConvNdBackward_155"
    top: "ConvNdBackward_155"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_157"
    type: "ELU"
    bottom: "ConvNdBackward_155"
    top: "ConvNdBackward_155"
}
layer {
    name: "ConvNdBackward_158"
    type: "Convolution"
    bottom: "ConvNdBackward_155"
    top: "ConvNdBackward_158"
    convolution_param {
        num_output: 64
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_159_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_158"
    top: "ConvNdBackward_158"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_159_scale"
    type: "Scale"
    bottom: "ConvNdBackward_158"
    top: "ConvNdBackward_158"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_160"
    type: "Dropout"
    bottom: "ConvNdBackward_158"
    top: "ConvNdBackward_158"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_162"
    type: "Eltwise"
    bottom: "ConvNdBackward_158"
    bottom: "AddBackward1_150"
    top: "AddBackward1_162"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_163"
    type: "ELU"
    bottom: "AddBackward1_162"
    top: "AddBackward1_162"
}
layer {
    name: "ConvNdBackward_164"
    type: "Convolution"
    bottom: "AddBackward1_162"
    top: "ConvNdBackward_164"
    convolution_param {
        num_output: 32
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_165_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_164"
    top: "ConvNdBackward_164"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_165_scale"
    type: "Scale"
    bottom: "ConvNdBackward_164"
    top: "ConvNdBackward_164"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_166"
    type: "ELU"
    bottom: "ConvNdBackward_164"
    top: "ConvNdBackward_164"
}
layer {
    name: "ConvNdBackward_167"
    type: "Convolution"
    bottom: "ConvNdBackward_164"
    top: "ConvNdBackward_167"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 2
        dilation: 1
        group: 32
    }
}
layer {
    name: "BatchNormBackward_168_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_167"
    top: "ConvNdBackward_167"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_168_scale"
    type: "Scale"
    bottom: "ConvNdBackward_167"
    top: "ConvNdBackward_167"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_169"
    type: "ELU"
    bottom: "ConvNdBackward_167"
    top: "ConvNdBackward_167"
}
layer {
    name: "ConvNdBackward_170"
    type: "Convolution"
    bottom: "ConvNdBackward_167"
    top: "ConvNdBackward_170"
    convolution_param {
        num_output: 128
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_171_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_170"
    top: "ConvNdBackward_170"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_171_scale"
    type: "Scale"
    bottom: "ConvNdBackward_170"
    top: "ConvNdBackward_170"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_172"
    type: "Dropout"
    bottom: "ConvNdBackward_170"
    top: "ConvNdBackward_170"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "MaxPool2DBackward_174"
    type: "Pooling"
    bottom: "AddBackward1_162"
    top: "MaxPool2DBackward_174"
    pooling_param {
        pool: MAX
        kernel_size: 2
        stride: 2
        pad: 0
    }
}
layer {
    name: "ConvNdBackward_175"
    type: "Convolution"
    bottom: "MaxPool2DBackward_174"
    top: "ConvNdBackward_175"
    convolution_param {
        num_output: 128
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_176_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_175"
    top: "ConvNdBackward_175"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_176_scale"
    type: "Scale"
    bottom: "ConvNdBackward_175"
    top: "ConvNdBackward_175"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "AddBackward1_177"
    type: "Eltwise"
    bottom: "ConvNdBackward_170"
    bottom: "ConvNdBackward_175"
    top: "AddBackward1_177"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_178"
    type: "ELU"
    bottom: "AddBackward1_177"
    top: "AddBackward1_177"
}
layer {
    name: "ConvNdBackward_179"
    type: "Convolution"
    bottom: "AddBackward1_177"
    top: "ConvNdBackward_179"
    convolution_param {
        num_output: 32
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_180_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_179"
    top: "ConvNdBackward_179"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_180_scale"
    type: "Scale"
    bottom: "ConvNdBackward_179"
    top: "ConvNdBackward_179"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_181"
    type: "ELU"
    bottom: "ConvNdBackward_179"
    top: "ConvNdBackward_179"
}
layer {
    name: "ConvNdBackward_182"
    type: "Convolution"
    bottom: "ConvNdBackward_179"
    top: "ConvNdBackward_182"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 32
    }
}
layer {
    name: "BatchNormBackward_183_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_182"
    top: "ConvNdBackward_182"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_183_scale"
    type: "Scale"
    bottom: "ConvNdBackward_182"
    top: "ConvNdBackward_182"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_184"
    type: "ELU"
    bottom: "ConvNdBackward_182"
    top: "ConvNdBackward_182"
}
layer {
    name: "ConvNdBackward_185"
    type: "Convolution"
    bottom: "ConvNdBackward_182"
    top: "ConvNdBackward_185"
    convolution_param {
        num_output: 128
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_186_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_185"
    top: "ConvNdBackward_185"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_186_scale"
    type: "Scale"
    bottom: "ConvNdBackward_185"
    top: "ConvNdBackward_185"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_187"
    type: "Dropout"
    bottom: "ConvNdBackward_185"
    top: "ConvNdBackward_185"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_189"
    type: "Eltwise"
    bottom: "ConvNdBackward_185"
    bottom: "AddBackward1_177"
    top: "AddBackward1_189"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_190"
    type: "ELU"
    bottom: "AddBackward1_189"
    top: "AddBackward1_189"
}
layer {
    name: "ConvNdBackward_191"
    type: "Convolution"
    bottom: "AddBackward1_189"
    top: "ConvNdBackward_191"
    convolution_param {
        num_output: 32
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_192_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_191"
    top: "ConvNdBackward_191"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_192_scale"
    type: "Scale"
    bottom: "ConvNdBackward_191"
    top: "ConvNdBackward_191"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_193"
    type: "ELU"
    bottom: "ConvNdBackward_191"
    top: "ConvNdBackward_191"
}
layer {
    name: "ConvNdBackward_194"
    type: "Convolution"
    bottom: "ConvNdBackward_191"
    top: "ConvNdBackward_194"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 32
    }
}
layer {
    name: "BatchNormBackward_195_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_194"
    top: "ConvNdBackward_194"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_195_scale"
    type: "Scale"
    bottom: "ConvNdBackward_194"
    top: "ConvNdBackward_194"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_196"
    type: "ELU"
    bottom: "ConvNdBackward_194"
    top: "ConvNdBackward_194"
}
layer {
    name: "ConvNdBackward_197"
    type: "Convolution"
    bottom: "ConvNdBackward_194"
    top: "ConvNdBackward_197"
    convolution_param {
        num_output: 128
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_198_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_197"
    top: "ConvNdBackward_197"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_198_scale"
    type: "Scale"
    bottom: "ConvNdBackward_197"
    top: "ConvNdBackward_197"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "DropoutBackward_199"
    type: "Dropout"
    bottom: "ConvNdBackward_197"
    top: "ConvNdBackward_197"
    dropout_param {
        dropout_ratio: 0.1
    }
}
layer {
    name: "AddBackward1_201"
    type: "Eltwise"
    bottom: "ConvNdBackward_197"
    bottom: "AddBackward1_189"
    top: "AddBackward1_201"
    eltwise_param {
        operation: SUM
    }
}
layer {
    name: "EluBackward_202"
    type: "ELU"
    bottom: "AddBackward1_201"
    top: "AddBackward1_201"
}
layer {
    name: "ConvNdBackward_203"
    type: "Convolution"
    bottom: "AddBackward1_201"
    top: "ConvNdBackward_203"
    convolution_param {
        num_output: 32
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_204_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_203"
    top: "ConvNdBackward_203"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_204_scale"
    type: "Scale"
    bottom: "ConvNdBackward_203"
    top: "ConvNdBackward_203"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_205"
    type: "ELU"
    bottom: "ConvNdBackward_203"
    top: "ConvNdBackward_203"
}
layer {
    name: "ConvNdBackward_206"
    type: "Convolution"
    bottom: "ConvNdBackward_203"
    top: "ConvNdBackward_206"
    convolution_param {
        num_output: 32
        pad_h: 1
        pad_w: 1
        kernel_h: 3
        kernel_w: 3
        stride: 1
        dilation: 1
        group: 32
    }
}
layer {
    name: "BatchNormBackward_207_bn"
    type: "BatchNorm"
    bottom: "ConvNdBackward_206"
    top: "ConvNdBackward_206"
    batch_norm_param {
        use_global_stats: true
        eps: 1e-05
    }
}
layer {
    name: "BatchNormBackward_207_scale"
    type: "Scale"
    bottom: "ConvNdBackward_206"
    top: "ConvNdBackward_206"
    scale_param {
        bias_term: true
    }
}
layer {
    name: "EluBackward_208"
    type: "ELU"
    bottom: "ConvNdBackward_206"
    top: "ConvNdBackward_206"
}
layer {
    name: "ConvNdBackward_209"
    type: "Convolution"
    bottom: "ConvNdBackward_206"
    top: "ConvNdBackward_209"
    convolution_param {
        num_output: 128
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        dilation: 1
        group: 1
    }
}
layer {
    name: "BatchNormBackward_210_bn"
    type: "BatchNorm"
